{"pageProps":{"frontmatter":{"slug":"/blog/movable_type_and_brads_thought","date":"Sat, 18 Aug 2007 01:46:00 GMT","title":"Movable Type and \"Brad's Thoughts on the Social Graph\"","epoch":"1187401560"},"markdownBody":"\n\n> I've been thinking a lot about the social graph for awhile now: aggregating the graph, decentralization, social network portability, etc.\n>\n> [Thoughts on the Social Graph](https://bradfitz.com/social-graph-problem/)\n\n\n昨年の今頃、MT 3.3を出してMTEにかかって、MT 3.3のバグ直して、まだMT4には専任のPMがいなくて、って時期に、MT4って何なのか、何を実装すればMTを4と呼べるようになるのか、つらつら考えていたころに社内のブログに投稿したのがこれ。\n\n> MT 4が当社のフラッグシップであり続けるためには、どこかでたしか社長が書いてましたが、トラックバックに続く「仕組み」の創造が不可欠です。また最近のブログ界隈では、プライバシーコントロールや社内SNSに代表される、オープン過ぎないつながりがキーコンセプトになっているようです。当社では当然Voxがその波を思い切り先導しようとしています。\n> \n> Voxとは別のベクトルで、しかし「つながり」を体感できる仕組みをMTに導入できないものだろうかということで、ない知恵絞って考えたのが下の図です。要するに、お互いにお互いのコネクション情報をオープンなスキーマにあわせてもっておいて、「俺MT」と「君MT」とのつながりは、ただの「他人のブログ」よりも強い結びつきを表現できるようにします。一例を挙げれば、このつながりの中でのコメントやトラックバックはモデレーションされない設定や、このつながりの中でのフィードやブクマの共有、つながりに含まれるMTブログをアグリゲートしたポータルをホストできる機能などが考えられます。Federated MT Networkというわけです。\n> \n> このつながりを表現するデータフォーマットとAPIを公開すれば、トラックバックの夢をもう一度ってことになるんではなかろうか、というのが今なんとなくつらつらと考えているMT 4のBig Pictureです。もちろん僕の個人的な絵なんで、何も決定事項ではありません。\n\n今読むと、いかにもバックエンドの実装しか考えていない人の発想というか、MT4を誰に売ろうとしているのかという部分で根本的に考え方がずれているのが見て取れて興味深いわけです。MT4には結局バックエンドに「トラックバック以来の革新」は盛り込めませんでした。\n\nでも、このアイデアをあきらめたわけではないし、このアイデアは[Rojoから来た現在のGMのChris Alden](http://web.archive.org/web/20130209044837/http://www.sixapart.com/about/press/2006/09/six_apart_acqui_1.html)も温め続けているアイデアであることからして、そのうち実装できるはずなんです。ただ、昨年から抱え続けていたのは、どんなAPIを用意すればこれが実現できるか。OpenIDをベースにするのは間違いないけど、それだけでは足りない。そこに出てきたBrad Fitzpatrickのこのマニフェスト。これはもう注目するしかありません。[Davidが戻ってきてこの手のものをSix Apartの中でやるらしい](http://web.archive.org/web/20130209044837/http://daveman692.livejournal.com/310424.html)し。\n\nMT4ではOpenIDをコメント認証の中心に置いていますが、OpenIDは認証の仕組みを提供するだけで、Trustはそれぞれケースバイケースで行います。よく誤解しているのを耳にします（とBradも来日したときに言っていた）が、OpenIDを認証したプロバイダ（LiveJournal？Vox？AOL？Livedoor？）が誰かということはTrustとは無関係（であるべき）で、だから大手がOpenIDをサポートするしないというのは、Trustネットワークの構築には結びつかない（はず）です。もちろんLiveJournalからのOpenIDは無条件に信頼するという実装をすることもできるけど、それはTrustになりえないと。\n\nそこでほしくなるのは、Voxやnowa、それにFlickrのcontactsやはてなスターのフレンドなどの、認証を前提に作られたつながりネットワークの情報です。つながりの定義に差はあれど、吉松がVoxにログインした状態で行ったVox内部での友人という設定は、その友人がVox（OpenID）で認証を受ける限りにおいては、吉松のMT上でも友人とみなしたい。もしかしてあるVoxのIDがあるはてなのIDと同じ人であることがわかったら、どっちのIDでも同じ人であることをMTでも認識したい。\n\nさらに、このつながりネットワークのプロバイダとしてMTが機能するようになったら。トラックバックを承認するとそのブログとのつながりが生まれ、そのつながりを利用して、それぞれが自分でインストールしたMTにログインしながらも、あたかもある種のSNSにログインしたかのように、つながった先にあるMTと情報を共有できたら。あるOpenIDからのコメントを承認したら、Vox上でも自動的に近所になってくれたら。1年経ってもまだこの辺をつらつらと考えているだけなのでした。\n\nそういうわけでBrad Fitzpatrickの今後に要注目だ。","navs":{"nextPage":{"epoch":"1188021000","title":"MTHatenaStar作った","slug":"/blog/mthatenastar"},"prevPage":{"epoch":"1187401560","title":"Movable Type and \"Brad's Thoughts on the Social Graph\"","slug":"/blog/movable_type_and_brads_thought"}}},"__N_SSG":true}