{"pageProps":{"posts":[{"frontmatter":{"slug":"drivers-license-ca-dmv-20220917","date":"Sat, 17 Sep 2022 22:06:24 GMT","title":"カリフォルニアで運転免許を取った","epoch":"1663452385","excerpt":"カリフォルニアのドライバーになりました"},"markdownBody":"\n## 他州の免許所持者の転入\n\nカリフォルニア州では、運転するなら[「州に住居を構えてから10日以内に」運転免許証を取得しなければならない](https://www.dmv.ca.gov/portal/driver-education-and-safety/special-interest-driver-guides/new-to-california/)と決められている。そういうわけで、DMVに出向いて運転免許を取得することになった。運転免許証を取得するのがいかに辛い経験だったかについては以前に書いたとおりで、カリフォルニアに来てまたあれを一からやり直すのは本当にごめん被りたい。しかしカリフォルニアのDMVのサイトを見ても、「住所登録だけ」で済むオプションなど見当たらない。他州からの転入の場合でも筆記試験を受けることが一番最初の手続きとなっている。ググってみると、筆記試験に合格したあとでLearners Permitが出るかTemporary Licenseが出るかの違いがあって、後者が出れば実技試験は免除ということになるらしい。実技試験が免除される条件はよくわからなかった。過去の事故や違反の履歴が問題になるのはそうだろうが、例えば免許を取得した州によって変わったりするのだろうか。わからないが、事故や違反の履歴はないし、ニューヨークは全米で一番免許を取るのが難しいと言われているということなので、それなら実技試験はいらないだろうと信じることにした。\n\n日本だと運転免許証は住所変更をするのであって他県へ引っ越したら取り直すわけではないと思うが、アメリカ合衆国では道路交通法が各州ごとに異なるので、運転免許証も州ごとに発行していることになり、互換性はあっても同じものではない。州をまたがって運転したらいきなり無免許運転として扱われるわけではもちろんないが、住所変更、的なオプションはないということのようだった。\n\n## 筆記試験の勉強\n\n仕方がないので、免許を取るときと同じように筆記試験の勉強をしなければならない。ググってみると日本人の体験談や勉強法がそこそこ出てくるが、古い情報が多い。結局、筆記試験の勉強としてやったのは、王道の[Califorinia Drivers Handbook](https://www.dmv.ca.gov/portal/file/california-driver-handbook-pdf/)を英語で一通り読むことと、[RISTAドライビングスクールさんの練習問題集](https://ristadrivingschool.com/practicetest/)をやること。RISTAドライビングスクールさんの練習問題集に出てくる全然わからない（こんなんニューヨークのときもあったっけ？）問題についてハンドブックを確認し、周辺に書いてあることを覚える。血中アルコール濃度とかAlleyの制限速度とかの数値系は練習問題集に大体網羅されているので、それとそれが書いてあるハンドブックの周辺に書いてある他の数値も一緒に覚える。まああとは常識的な話がほとんどなので、多分そんなにたくさん間違えないはず。\n\n## 筆記試験当日\n\nDMVのサイトで必要事項を入力して事前登録をすると番号が出てくるので、それを携帯のカメラで撮影するなりして控えておく。これはいわゆるアポではないので、行ける日時に最寄りのDMVへ行き、アポがない人の列に並んでそれを見せるという段取りになる。\n\n車で15分程度のところにDMVがあるので、朝イチを目指して早起きして出発する。7時過ぎについたがすでにそこそこ人が並んでいた。中に入るとノリノリのおばちゃんが、流れているHotel Californiaを歌いながら「何しに来たの？」「引っ越して来たので免許を取りに」「事前登録した？」「これ」「OKじゃあこれ」といって番号札を渡され、壁沿いに並んでいる椅子に座って待つ。\n\n今回もReal IDが欲しいということにしていて、そうするとグリーンカードとSSNと住所を証明する書類が2点必要になる。しかし、ニューヨークのときと違って今回は引っ越して来たばかりなので、まだ電気やインターネットのBillが来ていないし、銀行やカードの住所変更はしたもののまだステートメントが出ていない。そこでアパートの賃貸契約書とRenters Insuranceの証書を持っていった。Renters InsuranceはDMVのサイトの受け入れ可能な書類のリストには載っていないので、[ニューヨークのDMVと同様に「これはだめ」と言われるかもなー](/blog/2020-01-11_--------------45d1865c8b3a/)と思っていた。なおSSNについては番号を聞くことはあってもSSNのカードを持ってくる必要はなくなったらしい。一応持っていったけども。\n\n待ち時間中も筆記試験の勉強をし、1時間以上待ってようやく番号がよばれる。窓口にいって、愛想が悪いわけではないがボソボソ喋るので聞き取りづらい担当者とのやりとりをしばらくして、お支払いをして、筆記試験の列に並び直す。Renters Insuranceで何も問題なかった。ニューヨークのDMVの塩対応とはえらい違いである。あんなニューヨークで生きられたんだからここでも生きられるさきっと。\n\n筆記試験の列で順番が来て、まずは写真を撮る。写真を撮っている人が1人で筆記試験のコンピューターのサポートも兼ねていて、おじいちゃんおばあちゃんがコンピューターと悪戦苦闘しているのを助けているので全然進まない。まあ仕方ない。それよりこのおじいちゃんおばあちゃんも運転免許を更新するのだなあ...とちょっとなんというか。\n\n筆記試験のコンピューターを指定されて、試験開始。するとすぐ隣のブースに人がきて、なんか大声で喋り出す。どうも試験を受けているときにそのブースにパスポートを置いていて、そして試験後に忘れていったので見にきたらなくなっているということで大騒ぎしているらしい。そんな話を10分以上その場でしているので（なんか英語が辿々しくて要領を得ていなかった）うるさくて集中できない。\n\n結局2問間違えたが合格したので列に並び直す。何が出てくるかドキドキだったが、無事Temporary Licenseが出てきて実技は免除。数日後には運転免許証も送られてきて、無事カリフォルニアのIDを手に入れることができた。\n\n## まとめと反省\n\n確かに時間はかかったが、自分の番号が呼ばれた8時ごろから、筆記試験を受けて終わった9時ごろの間で、列の長さは短くなっていた。実は朝イチで来るのは間違いで、9時過ぎに来るのがよかったのかもしれない。もっとも自分はこの日は仕事をしなければならなかったので、9時に行って5時間かかったなんてことにするわけにはいかなかったから仕方ないのだが。\n\nニューヨークのDMVと違って雰囲気が殺伐としていない。実際にやりとりした担当者も、並んでいる間に他の担当者とのやりとりを聞いていたときも、なんというかそれなりに「なんとかしてやろう」という雰囲気を感じたように思う。ニューヨークでは「完璧に用意されていないなら来るな」って感じだったので、あとはこちらにどれだけ戦う覚悟があるかの問題だったように思うが、そういう雰囲気ではなかった。カリフォルニア最高。"},{"frontmatter":{"slug":"/blog/bought-mini-cooper-s-20220910","date":"Sun, 11 Sep 2022 01:39:14 GMT","title":"カリフォルニアで車を買った","epoch":"1662860353","excerpt":"アメリカでミニに乗るやつになりました"},"markdownBody":"\n[カリフォルニアのアパートへ入居](blog/moving-6-20220905)して新生活をスタートしたわけだが、ニューヨーク市内では不要でもこちらではどうしても必要なものを1つ買う必要があった。自家用車である。\n\n## 車を買わないという選択肢\n\nロスアンゼルス郊外のベッドタウンでは何をするにも車で移動する必要がある。セントラルパークのような公園でピクニックしようと思ったら車で行かなくてはならない。一番近所のWholefoodsにはギリ歩いて行ける距離なのだが、ミツワやH-martに行って食材を買おうと思ったら車で行くしかない。\n\n引っ越す1ヶ月以上前から、車を買うことが頭にあって色々シミュレーションをしていたのだが、車を買わないということも考えてみていた。[ニューヨークですでに運転免許をとっていて](https://luckypines.com/blog/2021-10-21-dmv-road-test-astoria-heights-2/)何度か運転もしているので、アメリカで右側通行の道を運転することを拒否するわけではないものの、2022年現在、COVID-19とロシアによるウクライナ侵攻が重なっている上にインフレが進行してガソリン価格が上がっており、さらには同様の理由で中古車価格が高騰していることもあるので、車を買わないで済む方法を模索した。\n\nなんでもUberを利用するという方法が当然ある。そこまで頻繁には出歩かないし、買い物はまとめ買いすることで回数を減らせるし、ということで頑張ればトントンにできるのかもしれない。点検や保険のことを考えるとペイするのかもしれない。遠出するときだけレンタカーなりTuroなりをすればいい。\n\n自転車も選択肢ではある。ただ自分はともかく妻に数十キロを自転車で、というのは言いづらい。あとストリートビューなどをみても、Bike LaneはあるもののBikeが走っている形跡がない。Wholefoods周辺にも自転車を駐輪する場所があるようには見えない。\n\nじゃあ流行りの電動スクーターはどうか？これもまあ慣れれば便利なのかもしれないが、買い物にこれで行ったとしてどこに停めるのか、停めないで店内をガラガラ連れて歩くのか（WilliamsburgのWholefoodsにそういうことをしている人がいた）。なんだかめんどくさい。\n\nさらに、入居することになったアパートにはテスラをカーシェアしているサイトがあることが判明して一瞬テンションが上がる。これでいいか？テスラだし？アプリをダウンロードしてみたらアイコンがAndroid Studioのデフォルトのアレで唖然としたけども。\n\n結局、やってやれないことはないのかもしれないが、せっかくカリフォルニアに来て得ようとしている自由の一部を阻害されてしまうような気がした。何かを色々我慢すれば自家用車なしでの生活は不可能ではなさそうだが、どっかに行きたい、じゃあ行こう、ってなったときにレンタカー屋に行って、返してからUber呼んで帰って、とかめんどくさそう。買うってことでいいか。\n\n## 車種\n\n車を買う手順は人それぞれだが、うちの場合はすでに車種が決まっていて変更できなさそうだったので、その車種で買える車を探すことにした。妻がずっと前から繰り返しミニに乗りたいと言い続けていたので、車を買うのにミニではないという選択肢はなかった。アパートの駐車場には4種のテスラがそこいらじゅうに停まっているばかりか、Rivianが2台、その他のEVもちらほらあるし駐車場に充電設備もあるので、ガソリン代高騰の今BEVという選択は大いにありなんだが、しかしミニなんである。\n\nミニもCooper SEというBEVを出している。これがなかなかのお手頃価格で見た目や走りはミニらしいので、一応検討してみた。YouTubeでレビューを見たりして結構その気になりかけていたんだが、予算を少しオーバー気味なのと、満充電での航続距離が110マイルしかないということがどうしてもひっかかって、断念した。100マイル前後走れれば我が家の用途としてはおそらく十分なんだが、どっかに行こうとなったときにこれのせいで「充電が不安」という理由でストレスを感じたくない。せっかくの自由を手放している気がする。\n\nそういうわけで、予算$25,000前後で2019以降のCooperを探し始めた。2019以降という設定は適当に決めただけだが、点検とかめんどくさいのでなるべく新しくてメーターもそこまで乗っていないやつの方がメンテナンスの手間が少し省けるかなと思った。\n\n## Mini Cooperを探して\n\nこの時点で引っ越しまでまだ1ヶ月もあったが、予算と年式の兼ね合いで、あと燃費的にもこっちの方がいいのでSではないCooperを探して、とりあえずオンラインで探せるものを見始めた。新居のアパートから一番近いミニの正規ディーラーのWebサイトでは中古が少々、新車がぼちぼち、登録されては消え、また在庫が増え、減り、を繰り返していた。$25,000だと厳しいが$30,000まで出せばそこそこある。$30,000出せば新車でもまあ行ける可能性がある。\n\n2022年のアメリカは、オンラインで中古車を買うこともできて、自宅まで配達してくれて気に入らなければ返品もできるという便利な世の中になっていた。他にもいくつもあるが、Carvana、Vroom、Carmaxの3つのWebサイトを毎日チェックして、予算内のCooperを見つけてFavし、それが売れていくのを眺めていた。常にそれなりに在庫はあるっぽくて、しかしこれは！と思ったやつはやはりすぐに売れる。\n\n最後にCargurus.com。ここは他のサイトのアグリゲートなので上記3社のものも出てくるのだが、それ以外に普通のディーラーの中古車も載っているので、ミニのディーラーではないところにたまたま入ったミニの在庫を見つけるのに役立った。\n\nある日Cargurus.comで紺色のCooperが$25,000強で掲載されているのを発見した。しかも販売しているのは新居からほど近いBMWのディーラー。そのディーラーのサイトに行ってみて中古車の在庫を検索してみると、Miniだけで6台も在庫を持っている。どれも年式が新しく、走行距離は短めでしかもお値段は予算の範囲内。中でも紺色のCooperが色以外は要件を満たしている。さっそくFavして様子を見始めた。\n\n## 車を買いに出かけた\n\n毎日Mini Cooperの在庫チェックをし続けているうちに引っ越し期日が近づいた。いいなと思っていた紺色のCooperは1週間前くらいにサイトから消えてしまい、そのディーラーで残っているのは$30,000超えの赤のCooper Sが2台だけになっていた。他のサイトもチェックし続けているものの、年式と予算に合うものはなかなかない。カリフォルニアに着いた日に2泊3日でレンタカーを借りたのだが、これを返して以降はミニを探しつつUberとTuroとカーシェアでなんとかしようと思っていた。\n\n確か引っ越し日の2日前に例のBMWディーラーのサイトを見てみたら、赤のCooper Sの片方が$26,000に値下がりしていた。$30,000を超えていたのに！2021年で9,000マイルしか走ってない、CarFaxもきれいなCooper Sが$26,000？違う車なのかと思ったけどCargurus.comは価格の履歴も出してくれるので、以前は$30,000以上で出ていたことが確認できた。これはお得なのでは？\n\nカリフォルニアに到着して入居した日の夜、改めてサイトをみたらまだ出ている。さっそくWebサイトから翌日の試乗希望のアポを入れてみた。すると次の日の朝テキストが来て、その日の午後試乗に行くことになった。仕事の方は、この日はまだ引っ越しのための有休をもらっていたのでちょうどよい。さっそくレンタカーでディーラーへ向かう。\n\n入り口で身体のでっかい営業さんに声をかけられたので「Benとアポがある」と言ったら「俺がBenだ」「O hai」となって、さっそくオフィスに入り、軽く車の説明を受けて、免許証を見せて「OKじゃあ乗ろう。今車を回してくるから」\n\nここでの試乗は、この営業さんも同乗するスタイルだったので、急ブレーキをかけてみるとかめちゃ加速してみるとかそういうことはしなかった。そういえば、買うかもしれない車の試乗って生まれて初めてだった。事故しないようにテンパってて、なんか何もチェックもしないまま乗ってディーラーを出て、目の前の道をまっすぐ走って、しばらくしてUターンして戻ってきて終了。\n\n車自体はピッカピカで、走行距離もまだ9,000行ってない。タイヤの溝だけは見たんだけど問題なし。めちゃスタンダードな設定に何故かハンドルだけJCWのカバーが付いている。本当はエンジンルームだのブレーキだの、ライトはすべて点灯するかとかそういうのチェックすべきだったんだろうけど、何しろ外装も内装も新車のようなピカピカ加減だったので何にも見なかった。「買います」「じゃあ手続きしようか」\n\nオフィスへ戻り、2人の名義にするため妻のIDも出し、改めてCarFaxの内容を確認した。ここでやっとわかったのは、このBMWディーラーが似たような年式と走行距離のミニを6台も放出していたのは、隣にあったミニの正規ディーラーが閉店したからだった。この車がいわゆるCourtesy CarというかLoanerというか、要はディーラーが代車として貸し出すために使っていたものだということはサイトに書いてあったので知っていたんだが、そのディーラーが閉店したので、そこで使われていたLoanerをこのBMWが販売していたということだった。\n\nLoanerだったので、ディーラーが常に点検しているしそもそも走ってないし、何も問題ないだろ？これはいい買い物だよな？え？と言われて言われてイエースアイシンクソーと返し、契約に関わる2つの重要な話が始まる。\n\n## 売買契約\n\n重要な話の1つは支払い方法。ローンを組むのもありだったのかもしれないが、新しい土地、初めての自家用車、その他もろもろ新しいことの中にさらに車のローンも入ってくるのをなんとなく負担に感じたので、最初から一括で買うことに決めていた。一括で買うと言ったら、「うむ、で？」\n\nCarvanaなどのオンラインショッピングだとまた違うのだろうが、ディーラーで一括で買うときの支払い方法については事前に調べておいた。本当に現金（Green Money）で持っていくのはさすがにない（多分できるけど）。クレジットカードで払えればポイントをたくさんもらえて嬉しいので、できるのか調べてみた。中には数枚のクレジットカードで支払ってその場で乗って帰った、なんて話もあるんだが、多くの場所で説明されているのは大体$5,000くらいまでならクレジットカードでも払えるが、それ以上の金額は無理。もしかしたらデビットカードなら行けるのかもしれなかったのだが（聞かなかった）、多分$30,000とかいう金額は上限を超えているだろう。こういう場合はあれ。小切手である。なんでクレジットカードがダメで個人小切手はいいんだよって話なんだがそこはそういうもんだ。自分は個人小切手帳を持ったことがほぼない[1]ので、Cashiers Checkすなわち銀行小切手ということになる。そういうことを調べておいたので、あらかじめCitiのChecking Accountに$40,000を入れたおいた。最終的な金額がわかったら近くのCiti（があることも調べておいた）に行って銀行小切手を取り出せばよい。\n\n*1 Schwabの小切手がどこかに数枚あるはずだが使ったことがない\n\n余談だが、ニューヨークへ引っ越してきて最初にやったのが[マンハッタンのPark AvenueのCiti Bankで口座を作った](/blog/2018-03-03_------------------c07c6b753d71/)ことで、その後Brooklynに引っ越した後すぐにこのアカウントをPriorityにアップグレードしたのだが、最近の金利上昇の恩恵を最大限受けるためにほとんどをWealthfrontへ移して、CitiのパッケージはBasicにダウングレードしてあった。このダウングレード作業がなかなか厄介だったのだがそれはおいておいて、とにかくWealthfrontから銀行小切手を出してもらうのは不可能ではないのだが時間がかかるので、用意周到に、資金を近くに支店のあるCitiに再度移しておいた、という話。\n\n「クレジットカードで$5,000くらい払って残りをCheckで払ってもいいかな？」「あーポイントつくからねー。大丈夫。じゃあそれで。じゃあ上で書類を作ってくるからちょっと待て」\n\n重要な話の2つ目は自動車保険への加入。保険に加入していないとディーラーは車を引き渡してくれない。しかし自動車保険に入るには車が必要である。まさかの鶏卵問題かと思ったが、自動車保険に入るのに必要なVIN（Vehicle Identification Number）は手元にある。BenにGEICOの担当者の名刺をもらって、帰ってすぐに電話をかけることにした。日本で車を買ったときは自賠責に入れば乗って帰ることができたはずだが、こっちでは車のディーラーは保険を売ってくれない。それどころか車の営業さんは車の売買契約もできない（担当者が別にいる）。そういうわけで重要な話だがこの時点でできることはない。\n\n「じゃああとは契約担当者とやり取りしてくれ。保険証書と小切手はいつ用意できる？よしじゃあ明日の10時ってことでアポを入れておくから何かあったら連絡をくれ」ということで営業のBenとはここで一旦お別れ。2階の冷房が効きすぎている待合場所で30分以上待たされる。やがて奥からKenという人が登場して「フマカイ？」「Fumiaki」「Ah, follow me」\n\nKenのオフィスはカードがないと入れない場所にある。入って座って、ここからの怒涛の書類サインラッシュがすごかった。ものすごい早口でこの書類がなんなのかを説明し、「ここにサイン」「ここは拇印」「ここ」「ここ」と全部で10種類くらいの書類にサインと拇印をした。もろもろを入れた最終的な金額は$30,000を少し超えていた。クレジットカードで$5,000を払い、残りの金額と小切手の宛先を再確認（LLCとかIncとかいるの？いらない、みたいな）して、その種類は再度Kenの引き出しにしまわれ「おしまいです」\n\n当たり前だが、営業のBenと比べると契約担当のKenは愛想がゼロである。愛想どころか、自分の話していることが相手に伝わっているかどうか、よりよく伝えるためにどうしたらよいか、そういうことはまるで考えたことがないような感じ。テレビで見る薬のCMで早回しで流れる注意事項を目の前で実演された感じだった。\n\n## 銀行小切手を取りに行く\n\nディーラーを後にして、Citiの支店へ向かう。この時点で16時をすぎていて17時閉店なので少し焦った。到着し、窓口に行くとすぐに案内されたので「車を買ったのでCashiers Checkが欲しい」「金額と宛先をここに書いてください」「はい」\n\nしばらくポチポチと作業していた担当者（アジア系の女性、だと思う）が顔を上げて「ニューヨークから来たんですか？」「昨日に引っ越してきました」「Welcome to Caifornia!」「Thank you we are loving it」的な何でもない会話をした。するとその横で別の客に対応していた、どうも上司っぽい女性（だと思う）がおもむろに、「ほにゃららほにゃららをチェックして」と担当者に。そしてこちらへ向いて「住所変更しましたか？」「はい昨日Webサイトでしました」「やっぱり！ほにゃららをほげほげしないと」\n\n2人の間で何やら色々話していたが、要するに住所変更してすぐに大金を引き出そうとしているので、Fraudを疑われてアカウントがロックされてしまう可能性がある。が、対面の窓口でやってるしDebit Cardの暗証番号も入れたし（NYの）免許証も見せてあるので、カリフォルニア側で本人確認をきっちりやったという「Note」をアカウントに対してつけておくことで、ロックされないようにできる、という話だったらしい。[口座ロックといえばニューヨークに来てすぐのときにやらかした](/blog/2018-03-03_------------------c07c6b753d71/)。今回は窓口でお金をおろそうとしているので大丈夫だと思っていたが、やはり問題になる可能性はあったらしい。たまたま担当者が何気ない会話を始めてくれて、その会話をたまたま経験のある隣の上司が聞いていたおかげで助かった。やはり対面の窓口を持っている銀行はこういうときは強い。手数料が高かったり利率が低かったりするのも仕方ない。\n\n「じゃあ少し時間がかかるのであっちで座って待っててください」というわけで少しだけ待たされる。支店の様子を見ていると、隣でその上司氏が担当していた客もどうも日本人っぽい見た目。しかも話している内容が「IDの写真と見た目が違いすぎるので...」「このお金をどうするつもりですか...」みたいなことで、なんだなんだどうしたんだ\n\nしばらくして呼ばれたので行くと、上司氏がこちらにも「このお金は何に使うんですか」「車を買うんです。こっちじゃ必要だから」「ああ、何を買うの？」この質問に、こちらの担当者が「BMW」と答える。小切手の宛先がBMWだったから。なので、自分で「いや買うのはミニなんです」と言ったら担当者のテンションが爆上がり氏「ミニクーパー」「イエース」「ミニクーパー最高よね！」「俺じゃなくて妻の趣味ですけどね」「色は」「赤」「彼女には赤が似合いそうだって今言おうとしたところなの！」\n\nそういうわけで手続きは終わり、小切手が出てくる。「引っ越してきたということはこれからもお付き合いがあるんですよね」「あ、はいそうだと思います。」「それではまた」Citiの支店に出向く用事はそんなに多くないんだけど。でもBrooklynとはレベルの違う対応でよかった。カリフォルニア最高。\n\n## 自動車保険\n\n家に戻り、自動車保険の加入手続きを始める。まずはもらった名刺に電話してみるんだが、留守電でつながらない。しかたないのでWebで自力でやってみることにして、GEICOのページへ行ってみる。いろいろ個人情報を入力しまくって、VINも入れて見積もりを出そうとするのだが、開始日が1週間先以降になってしまう。GEICOは安くて良いと聞いていたのでGEICOにしたかったんだが、もうお金もあるのに1週間先まで待つのは嫌だ。\n\n名刺の電話にGEICOの代表番号みたいなのが書いてあるのでそっちにかけて、自動音声の案内にしたがって保険の契約を試みる。案内音声では見積もりから契約までいけそうな感じでオプションが提示されるので、それにしたがって進んでいくと最後に「GEICOでは電話での契約はできなくなりました。さようなら」と言われて切られた。なんだこれ！何度か別の電話番号からトライしてみるものの、結局同じこれを3回食らった。だいぶ夜も遅くなって、明日の朝のアポに間に合わなさそうだとだいぶ焦ってきたときにこれを3回食らったので、完全にキレてGEICOは使わないと決めた。\n\n自動車保険といえば他にもFarmersとかNationwideとかState FarmとかCMでお馴染みの会社がいくつかある。どこもWebで見積もりができるのでいくつかやってみたが、結構高い。だいぶあきらめ気味で最後にこれもCMでお馴染みのProgressiveにトライした。\n\nProgessiveもWebでの見積もりができてしかも開始日を翌日にできた。そして他より安い。カリフォルニアで決まっている最低限の内容よりも少し良い内容で他と比べるとだいぶ安い。これで行きたい。が、最後のボタンをクリックすると「問題が起きました。こちらに電話してください」まじか...自動音声のオプションをそれなりに選んで進むが、「契約したいけどWebで問題が起きたから先に進めない」というときに行くべき道が提示されない。どうしたのか覚えていないがようやく人間に繋がるオプションを探り当てて、話をした。\n\nすごいノリのいい感じの男性（だと思う）に、起こったことを説明する。「ちょっと見てみます」「ああー、時間が遅いので先に進めない状態になっていますね。今はこれ以上先に進めないです」「そうなんですか。。。ディーラーとの契約は済んでいるので明日の朝保険を持っていくだけなんですが、なんとかならないんですか？」「実は自分もディーラーで働いていたことがあって、時差のせいでこういうことが起きるんですよね。わかるんですけど、でも担当者が今日はもういないのでどうしようもないんです」「そうですか。。。」「お急ぎのようなので、こういうことをいうのは変なんですが、他の保険会社に当たってみた方がいいかもしれません。当社の見積もりはGood Dealでしたか？」「そうなんですよねえ、それもあって御社にお願いしたくて」「そうですか。それならなんとかしたいんですが、明日にならないとどうしようもなくて」「わかりました」「Good luck」\n\n最初のノリとは打って変わってえらい真摯な対応で、挙句には「他所ならまだやってるかもしれないから試してみて」という始末。GEICOに食らった後だったのでなおさら感動したのと、別に明日ではなく明後日になる程度のことなら別にいいかってことで、今日は寝て明日の朝もう一度Progressiveでトライしてみることにした。\n\n次の日。金曜日だがこの日は有休を取っていないので仕事をしないといけない。朝6時ごろに起きてすぐにProgressiveのWebサイトへ行き、同じ見積もりをもう一度やってみる。開始日は今日にすることができたものの、やはり最後に「問題が起きたのでこちらに電話してください」。昨日のことがあったのでそれほど重い気持ちにならずに電話してみる。もちろん違う人が出て、ノリもだいぶ違ったが、何が起きたか説明すると「んーこっちでは何も問題がないように見えるんですが...。このまま電話で支払いをしますか？それともWebでやりますか？」「WebでできるならWebでやります」「問題なくできるはずなのでやってみてください」\n\n再度Webへ進むと今度はその次の画面へ行くことができた。そのまま契約内容を確認し、引き落とし口座を設定し、初回分を支払って、作業完了。アカウントができた。Web上でさらに必要な書類をアップロードしていく。Garaging Proofがないと言われて、車庫証明なんてどうやって取るんだ？と焦ったが、アパートの賃貸契約書とRenters Insuranceの書類を送ってOKだった。車庫証明というか、申告した住所の居住証明という意味だったっぽい。\n\n最終的に朝の7時30分には保険のIDカードと証明書をPDFでダウンロードできたので、それを営業のBenにメールで送って「10時に会いましょう」\n\n## 納車\n\nこれまで乗っていたレンタカーは、カリフォルニアについた日の朝10時から金曜日の朝10時まで借りていたので、この朝に空港まで返却に行った。Progressiveが数十分で保険契約を完了してくれたので本当に助かった。空港近くで給油して返却した。返却といっても決まった場所に停めて鍵を置いておくだけ。しかしこれが後々問題になった。\n\nそれはともかく、空港で今度はUberを呼んで、ディーラーへ送ってもらう。少し早く着いてしまったが、Benはすでに出勤していて、小切手を渡したら手続きを始めてくれた。「洗車してるからちょっと待ってて」ちょっと早くきてしまったのはこっちなので、無料のコーヒーを飲みながら待つ。\n\n「準備できました。これがキーです。これが書類です。Congratulations」\n\n車へ行くと窓ガラスにシールが貼られていてそれが車両登録証の代わりになるらしい。「警官に言われたらこれを見せて。車両登録証は3週間くらいで送られてくるから」本当に3週間後に送られてきた。「あと何かあったらここにきたほうがいいの？」「いや、ミニのディーラーに行け。小さいことならそこらへんのなんでもいいけど大きなことはミニのディーラーでやってくれるから」「ありがとう」\n\n「ところで、日本に行くとしたらどこがおすすめ？」「あー、何したいかによるな。寺とか街並みとかなら京都だろうし、自然なら北海道で食なら福岡かな」「オッケー。じゃ」\n\nということで赤のMini Cooper Sが我が家の自家用車になりました。\n\n## Hertz...\n\n帰ったらHertzから領収書が届いていたのでなんとはなしにチェックすると...ガス代を取られていた。$18。あわててカスタマーサポートへ「ガス代が取られているが満タンにして返した。GSの領収書もある。Refundしてくれ」と送る。自動メールが返ってきて7-10営業日待てと。そしたらその数分後に「今の今返却手続きが終わったばかりなので、対応を24-48時間待ってくれ」という返事が来た。\n\nそれから土日を挟んで、月曜日は許してあげたが火曜日になっても返事がないので、「72時間経ったのに返事がないけどどうなっての」と再度送る。今度は何の返答もない。\n\n木曜日に、返信ではなくもう一度新しく起票して「前回このIDでサポートリクエストを投げた件はどうなってんの」と送ってみたら、今度はすぐに返事が来て「遅れてすみません。ケースをレビューした結果BillをAdjustすることに決定したのでクレジットカードに返金されます」という返事がようやくきた。\n\n最終的には解決したものの、なんとはなしに領収書の内容を確認しなければ（いつもそんなことしてない）気づかなかったと思う。Hertzめぇ。\n"},{"frontmatter":{"slug":"/blog/moving-6-20220905","date":"Tue, 06 Sep 2022 01:25:10 GMT","title":"引っ越し先へ入居した","epoch":"1662427509","excerpt":"カリフォルニア州民になりました"},"markdownBody":"\n## ベッドとマットレス\n\n[引っ越し当日](/blog/moving-5-20220904)から少し時間を戻して、引っ越す2週間くらい前の話。引っ越したあとの生活を想像したとき一番問題になるのが寝床の確保だった。こちらからベッドを送ったところで2-3週間は届かないので意味がない。そのため、オンラインであらかじめ購入して絶妙のタイミングで配送してもらうことで引っ越し当日の寝床だけは確保する必要がある。今更ホテルやAirbnbには行きたくないし。\n\n前回引っ越したときもCasperもどきのNectarというブランドのマットレスにトライしたんだが、今回もチャットで聞いてみたところやはり今から頼んでも配送は8月中旬以降になるという返事が来た。結局ある程度高いのは承知で、しかし配送日が確実なCasperでマットレスを買った。事前にアパート側に問い合わせたところ、人間が到着する以前に家具が届いてしまう場合、スタッフが「できる限りの努力」で部屋に家具を入れてくれるらしい。それを信じて、Casperに発注をかけた。ベッドフレームについても使っていたものと同じものをAmazonで発注する。こちらは最悪2、3日届かなくてもマットレスを床に置いて寝られないことはないので、届くのを期待しつつあまり信用しないことにした。\n\nCasperのマットレスは予想より早く出荷され予想よりも早く届いてしまうことが判明したので、あわててカスタマーサポートにチャットで連絡して「配送を8月8日以降にしてほしい」と、お願いした。その後もやりとりはあったものの、最終的にこのお願いは届いて、UPSはきっちり8月8日に配送してくれた。最も、8月8日ではまだこちらはニューヨークにいるため、メールで「マットレスが家の前に置き配してあるので、部屋の中に入れておいてほしい」とResident serviceのオフィスにお願いした。これも何度かやり取りがあって、最終的には電話したところ「OK今すぐ見てきます」と言ってなんとかしてくれた。そういうわけで、前記した通り、部屋に入ったらマットレスが置いてあったので安心したのだ。\n\nAmazon発送のベッドフレームの方はこれほどスムーズにはいかなかった。これも入居1週間前にAmazonで発注して、PrimeなしのFree shippingで1週間後に届けばいいやというノリでいたのだが、これが早く出荷されてしまい、入居する前に配達に出られてしまった。配達マンらしき人から携帯に電話が入ったのだが、たまたまそれを取ることができず、すると「配達不能」ということで止まってしまった。Amazon上のステータスでは「後日再度挑戦します」になっていて先に進まない。引っ越してきた後も再挑戦してくれないので、チャットでこれをキャンセルし、同じものを再度Primeで注文し直した。\n\n間の悪いことに、2回目の注文の方も外出中に配達マンから連絡が来たのを取り損ねて、また持ち帰りになってしまった。「中に入れなかったので配達できませんでした」という前と同じステータスになってしまったので焦った。たまたま外出していたそのタイミングでこれかあ、どうしようかと悩んでいたらその後「配達完了」になったので？？？と思いながら帰ってきたら部屋の前に置き配されていた。なんかどうにかしてアパートの中に入ったのだろうか。まあ届いたからよしとしよう。\n\n## バー スツール\n\n寝床はなんとか確保されたのだが、部屋でくつろいだり食事したりするために座る場所がない。新居にはキッチンの後ろにカウンターが設置されていて、ダイニングテーブルはいらないね、ということになっていたで、そこで食事するためのバー・スツールを買うつもりでAmazonでPrimeに入り、注文をした。しかしこれがまた「配送場所に入れないので配達不可」となってしまった。USPSだったのでトラッキング番号を入れて明日の再配達依頼をWebでやってみた。\n\nしかし1日経っても何も起こらない。Amazonに行くと「後日再挑戦します」というステータスになっている。Amazonのチャットに行ってみると、明日まで待ってもう一度連絡しろとBotに言われる。もう1日待ってみたがもちろん来ないので、再配達依頼を出す前に見た「局で預かっているので取りに来い」というステータスを信じてUSPSのオフィスに行ってみた。\n\nオフィスではやる気のない職員がトラッキング番号を見てそれを探しに行き、数分後に戻ってきて「ないです」。そして思い立ったように横にあるPCに何やら入力し、ため息をつき、「ないです。配達に出ているかもしれないのでまた来てください」家に帰り、何も信じられないのでこれはAmazon上でキャンセルできるようになったらキャンセルすることにして、再度一番早く配達できるとなっているものを注文し直した。\n\n新しい注文の方は2日後に配送中状態になったのだが、また同じ「配送場所に入れないので配達不可」となって「後日再挑戦します」というステータスになってしまった。これは困る。家にもどってAmazonのチャットに行き、人間にたどり着いて、さらに（どうやったのか覚えていないが）電話することができた。人間と思しき相手が出たのでことのしだいを改めて説明し、ああだこうだやっているとなんと上司に代わるという。上司氏に対してまた説明をし、なる早で配達してくれと伝えると「状態が不明なので今すぐ返答できないが、私の責任で必ず調べて結果を30分以内に折り返します。良いですか？」はいお願いします\n\nそして...。それっきりこの上司氏から（も他の誰からも）一切の連絡はない。結局1週間立って食事をし、床に座ってテレビをみていた。\n\n2点のバー・スツールが再配達に挑戦しますというステータスのまま放置されて1週間が経ってしまった。途方に暮れつつ、Redditで「ずっとステータスが変わらなかったパッケージがUSPSのWebフォームに入力した途端に見つかった」という書き込みをみつけたので、2つ目に頼んだ方について[ロストパッケージの連絡](https://www.usps.com/help/missing-mail.htm)をしてみた。どうせ何も起こらないんだろうと悲観していたんだが、数時間後になんと担当者から電話がかかってきた。そしてその担当者曰く「お宅のStreetへは配達はしませんので自動的に局留めになりますから取りに来てください」はぁぁぁぁぁぁぁ？なんで？え？取りに行くのはいいけど「お宅のStreetへは配達はしません」？？？配達しないならAmazonでPickupするのもやめてくれよおい。Amazon直営の配達業者なら配達してくれるんでしょ？\n\n担当者には「いや取りに行ったんですよ、そしたら配達中だからここにはないって言われたんですよ」「え？ちょっと私が今見てきます」...「はい、ちゃんとありました。取りに来てください」ほんとかよ\n\nこの担当者はいい感じの人だった。申し訳なさげな、ただ内容は「お宅には配達はしないことになってるんで」という話を繰り返されたので、「わかったじゃあ明日行きます」「はいどうも」となった。\n\n翌日車でUSPSへ行くと、今度はちゃんと箱が出てきた。なんとか車に積み込んで帰宅して、箱を開けてみてびっくり。2つ目に頼んだ方だと思っていたのに、最初に頼んだ方のだった。どうなってんの？2つ目のトラッキング番号でロストのクレームを入れたのに？なんだろうこれ。椅子が来たからまあいいけど。\n\n結局「私の責任において調べて必ず折り返す」Amazon上司氏からの折り返しはないまま、2つ目の方はCancel & Refundを受けた。引っ越してきて1週間、ようやく座って食事できるようになった。\n\n## その他\n\n住んでいる場所はすぐ近くにニトリ（Aki-Home）がある。引っ越してきた翌日にソファを見に行って、なぜか包丁とまな板を買って帰ってきたのだが、色々ネットで検索してみたり、IKEAにも行ったのだが、結局ここで見たソファがコスパが良いということになり、再度出かけていって購入した。\n\nそんなこんなで徐々に生活ができるようになっていった。出荷してから2週間後の25日には日通の荷物も届いた。やはり日本人のリーダーとヒスパニック系の2にんと計3人。箱を開けるところまでやると言われたのだが断って、運び入れてもらうだけで終わったのであっという間。壊れていたりなくなっているものもなく、自転車も無事だった。これにてようやく普通の生活を取り戻した。\n\n日通さんは多分アメリカンな会社に頼むよりも絶対的な金額は割高だったんだろうと思うが、そもそも精神的な余裕がなくなりがちな引っ越し、さらに考えたこともないような長距離ということを踏まえると、決して無駄に出費したような感じはしない。今回はニューヨークからロスアンゼルス近郊ということで発と着の両方に営業所があったこともあって、担当してくれた全員が見積もり依頼から梱包資材の配達、出荷当日、入荷当日とひたすらとてもよくしてくれた。限界まで節約したいということなら別だが、アメリカ国内で引っ越し会社に頼んで引っ越しをする際に自力でU-Haulしないなら、日通さんはお勧めできます。\n\nそういうわけでカリフォルニア州民になりました。"},{"frontmatter":{"slug":"/blog/moving-5-20220904","date":"Mon, 05 Sep 2022 01:56:18 GMT","title":"引っ越し当日になった","epoch":"1662342977","excerpt":"いよいよ引っ越しの日になりました"},"markdownBody":"\n## 引っ越し当日の流れ\n\n[引っ越し荷物の梱包もすべて終えた](/blog/moving-4-20220831)ので、あとは当日を待つばかり。\n\n内見のために引っ越し先のアパートを訪れたときは、ロスアンゼルス空港に入ってレンタカーで回った。今回もレンタカーするのだが、2、3日で返したあとで自宅へ戻らなければならない。LAXで借りてLAXへ返すとLAXから自宅までUberか何かで帰ってくる羽目になる。LAXはデカくて混んでるしLAXから自宅までのフリーウェイもなかなか大変な道のりだ。\n\n自宅近くにはLAX以外に3つ空港がある。Long BeachとOntarioとSanta Ana。一番近くてNYCから直行便が出ているのがSanta Anaなので、ここへ飛んでレンタカーをすれば便利だ。NYC発LAX行きの便に比べてSNA行きの便は$100前後高いんだが、LAXからレンタカーしてSNAに返したり、LAXまで返しに行ってLAXからUberする値段などを考慮すると実はたいして変わらない。SNAはローカル空港なのでこじんまりしていてLAXみたいな大混雑もなさそう。というわけで、UnitedのEWR発SNA行きを予約した。\n\nEWRの出発時間が午前7時なので、Williamsburgから出てEWRに6時とかに着くのは辛い。そこで、EWR近くの安いホテルに一泊することにした。したがって荷物の搬出はNYCにサヨナラする日の一日前になる。搬出日の作業時間が朝イチに設定されたこともあって、その日に焦って何かをしなくてよいこともメリットだった。引っ越し先のアパートで入居手続きを予約しなければならないのだが、時差の関係でNYCで朝7時に発つ便は現地の朝10時過ぎに着くので、11時からの設定でちょうどよい。\n\n## 日本通運搬出チーム\n\n当日、指定の時間に日本通運チームから入電。作業が始まる。梱包資材を持ってきた方とはまた違う日本人のリーダーとヒスパニック系の3人組の合わせて4人。やりとりは日本人リーダーと行うのがほとんどなので日本語だけで済む。スペイン語力を試すことはできなかった（笑。最初みんな靴を脱ぎ履きしていたので、土足で入っていいよと伝えるとやたら喜ばれた。\n\nこちらの梱包にいくつか問題があったものの、基本的にはそのまま30数個の箱を運び出すだけ。上記の通り、梱包作業中に箱の中身を思い出しながら個数をmanifestに記録し、日通のリーダーが例の謎の記号（箱の大きさ、箱が日通のものか客が用意したものか、それと梱包は日通がやったか客がやったか）を入力し、部屋から出すときに番号を確認していく。\n\n梱包できなかったのは輪行袋に入れた自転車とSwifferの棒とフロアランプ。どうするのか分からなくて番号だけつけておいたのだが、でっかい箱にまとめて納められた。テレビは足を外して、その場ですっごい念入りに箱が作られ、念入りにテープで巻かれた。それと無印のプラスチックの衣装ケースも番号だけつけておいたのだが、周りを囲う段ボールがあっという間にその場で作られて梱包された。ものの2時間で工程は完了。チップを渡して搬出は終了。\n\n## 処分品の処分\n\n部屋の中はベッドフレームとマットレス、ダイニングテーブルと二脚のチェア、それにカラーボックスみたいな棚だけが残った。これらを解体し、まだ引っ越しモードになっているエレベーターに乗せて運び出し動線の途中にある大物が捨てられていると思しき場所まで手で持っていく。途中でアパートで普段Handymanをやっているおっちゃんを見つけて、「マットレスを捨てたいんだけど運ぶ道具を貸してくれ」と言ったら予想外に「マットレスなんて捨てられないよ何言ってんの？」「あそこに捨ててあるじゃん。あれと同じことをしたいだけ」「いやマットレスは捨てられない」というやりとりをすることになって、「えーじゃあどうしろっての？」「サイズは？」「クイーン」「。。。。。じゃああそこに置いておけ」いやだからそれでいいんじゃん。結局運ぶためのドーリーみたいなものはないので、仕方なくマットレスをひたすら引きずって運ぶことに。[NYCではマットレスは袋にきちんと包めば普通にゴミに出していいことになっている](https://portal.311.nyc.gov/article/?kanumber=KA-02378)ので、アパートの前のゴミ捨て場に出していいはずなのだ。だから道具を借りたかっただけなのに。ひいひい言いながら妻と2人でマットレスを1階まで運んだ。\n\n最後に空になった部屋で床や壁などの様子を動画で記録しておいた。多分ないとは思うんだが、傷とかをセキュリティデポジットから引かれると癪だから。\n\n## 退去してNewarkへ\n\n最後に忘れ物を確認して、スーツケースを持って部屋を出る。出たところでさっきのおっちゃんと鉢合わせして、「お世話になりました」といったら「あ、あんたが引っ越す人だったのか！」という反応をされたので、マットレスですったもんだしていたときは住人だと気づいていなかったのかもしれない。\n\n部屋の鍵、郵便ポストの鍵、アメニティを使うためのFOBを2組、フロントデスクに返す。[奇しくも入居のときに鍵をもらった（というか鍵が見つからなくて結局作り直した）とき](/blog/2018-03-22_-----------------bd1b22641946)と同じフロントマン。「お世話になりましたありがとう」「ああやっぱり今日出ていくのはあなただったのね。元気で」というやりとりをしてさよならする。\n\nアパートのすぐ下にあるカフェで昼飯を食べて、それから歩いてすぐのところにある乗り場からフェリーでWall Streetへ渡る。この辺りはこんな具合で交通の便も良くて、コロナとかその他もろもろで外出したくないような状況にならなければ、住みよい場所だったのだ。もうああいう空気には2度とならないんだろうね。\n\nWall StreetのPierで降りて、猛暑の中マンハッタン島を東から西へ移動する。WTCの麓にあるPATHの駅からNewarkへ行くのだ。[前回Uberで渡って高くて時間がかかって辟易した](/blog/moving-2-20220807)ので、今回は電車で行くのだ。乗ったことないのでおっかなびっくりだけど昼間だし大丈夫だろ？\n\nこの移動がなかなか大変で、スーツケース2つを引きずりながらウォール街周辺をとぼとぼと歩いた。だいぶ暑い日で汗だくになり、水筒で持ってきた水もなくなってしまう。この周辺に住んでいたので土地勘があって道に迷ったりはしなかったものの、暑さのあまり途中のBodegaで水を追加購入して休憩してしまった。少し休んで気を取り直して「確かこの辺」という場所へ進むとWTCのビルの入り口にSubway and PATHの文字が。Oculusの中からPATHに行けるのを思い出してビルに入る。冷房！涼しい！おまけに公衆トイレがある！\n\nトイレを済ませてOculusを通り抜けてPATHの駅へ。Oculusの大きな広場みたいなところに出て「こんなになったんだー（正式オープンする前に引っ越したので来てない）」としばし眺めていたら、おばちゃんが寄ってきて「どこに行きたいの？」どうやらスーツケースを持って途方に暮れる観光客に見えたらしい。「いやPATHに乗ってNewarkに行くつもりだから大丈夫」「あ、そう」ってやりとりをしてこの街にはこういう親切があふれているんだよなあ。見えづらくなっていたけども、と思って少し感慨深かった。だが未練はない。さよならNYC。\n\nPATHの券売機で「これも最後か」と思いながらメトロカードに2回分チャージして、2人で改札をくぐる。数セント残ってしまっているがもう仕方ない。一応取ってはあるが、もし今後NYCに行くことがあったとしてもメトロカードは使わない（使えない？）だろうなあ。\n\n止まっていたPATHの電車に乗ってNYCを後にした。\n\nPATHでNewark Penn Stationまで行ったら、外に出てUberを呼びホテルまで乗せてもらう。電車で最寄り駅まで行けただろうけど、こっちの方が楽そうだったので。ホテルにチェックインしてシャワーして一息ついた。空港までのシャトルバスが毎時00分と30分に出ていることを確認して、朝5時のシャトルに乗ることにした。この時点で5時くらいだった気がするので、Uber eatsをホテルへ頼む。メキシカン。量が多くて味も良かった。\n\n## EWR - SNA\n\n朝起きて5時のシャトルに無事乗り込み、空港について荷物を預け、セキュリティを普通に通過してゲートへ。なかなか綺麗でそこまで混雑してもいない感じ。時間までぼーっとして、搭乗した。\n\n機内ではなぜか席の上の荷物入れはそもそも使えないようになっていて、荷物を入れられない人たちが下に預け入れるために一旦外に出されたりしていたが、離陸時間は予定通りだったと思う。6時間以上の旅だったが、ダウンロードしておいたNetflix映画を見ていたら着いた。The Gray Manはなんか深みがなかったなあ。Unitedは好きじゃないんだけどもまあまあ問題なし。\n\n## 新住所へGo\n\nフライトは予定より1時間くらい早くSNAに着陸した。あるあるなんだが、これだけ早く着いてしまうとゲートが空いていなくて結局機内で待つことになる。まあ時間通りにゲートを出られたのでよし。手荷物もさっさと出てきたし、レンタカーの場所もすぐにわかった。\n\nLAXと同じようにGoldメンバーは直接駐車スペースへ行くようになっていたが、LAXとは違って鍵は駐車スペースで人から受け取るようになっていた。「日本人？」「そう」「私はペルーから来たので日本人には親しみがあるよの。大統領も日本人だったし」「フジモリさん」「そうフジモリ」フジモリ大統領の評価というような野暮な話は持ち出さないように相槌を打って鍵をもらう。燃費を気にしてMediumサイズにしておいたのに車に行ってみたらなんとGrand Cherokee。デカすぎて不安だったので戻って「小さい車ないの？」「んー、Nissan Altimaならある」「じゃあそれで」というわけでFull sizeになってしまった。どんまい。\n\nアパートへは20分程度で到着した。10時半には着いてしまったのでLeasing Officeに入ってみると、隣のResident Serviceまで案内してくれて、そのまま手続き開始。この時点で支払っておくべき今月分の家賃やセキュリティデポジットなどはすべてオンラインで支払い済みで、書類にもサイン済みなので、やることは多くない。鍵を受け取ったという書面にサインし、駐車場の位置やゲートの動作などを案内してもらって確認して、部屋に入る。無事にマットレスが届いていて安心した。\n\n[入居した](/blog/moving-6-20220905)へ続く\n"},{"frontmatter":{"slug":"/blog/moving-4-20220831","date":"Thu, 01 Sep 2022 06:07:30 GMT","title":"引っ越し業者を探して荷物を梱包した","epoch":"1662012453","excerpt":"大陸横断引っ越しで荷物を運んでくれる会社を探しました。"},"markdownBody":"\n## 退去通知\n\n[引っ越し先を決めた](/blog/moving-3-20220813)ので、現住アパートの管理会社へ退去を通告する。Williamsburgの中でもEast River沿いの一等地、[南向きで明るく中庭に面していて静かなこのStudioアパート](https://streeteasy.com/rental/2228775)ともお別れである。なんつってそこまで未練はない。隣の音楽は筒抜けだし重低音は響くし犬はうるさいし。\n\n2018年2月に$2,400（という破格値）で入居し、更新のたびに$100ずつ上げられて今$2,700。周囲の相場を見るにつけ、次は$3,000超えてくるんだろうな、そして追い出した上でもっと高く新規入居者を募るんだろうな、と予想していた（それもあって引っ越しを検討していた）。6月中頃にいつも通り次の家賃の通知が来て、なんと$2,975だという。へえ、商売っ気ないんだなあ。いつまでに更新するかしないか返事すべきか聞いたところ、独立記念日直後までにはということだった。その後引っ越し先を決めて更新しないことを通知したんだが、なんとなく想像で、このアパート、新規に募るときはもっと値段をあげるんだろうなと思ってウォッチしていたら、そのまま$2,975で募集されていてびっくりした。だって同じ間取りの同じ場所の下の階とかが$3,500で出しているのに。\n\n再契約せずに退去することを通知したら、次の週から募集をかけること、そしたら不動産屋が候補者に内見をさせるから「事前通知をした上で」見にくることになるからよろしく、と返事が来る。その不動産屋のエージェントが自分が入居したときと同じ人で、しかもあまり良い印象を持っていなかったのでまたちょっとどんよりする。そしたら案の定その不動産屋からすぐにメールが来て「来週水曜日にオープンハウスをする。OKね？」いや、NGです。\n\n家で仕事をしているし土足であがられても困るし、自分の前回までの経験でも、住んでいる人がいる部屋にピンポンして入れてもらって見せてもらうということを行なっていたので、それでいいでしょ？と返事したところ「このマーケットでこの値段で出すので、日に何組も来ることになるから、アポとかだるいことやってられない。オープンハウス常識でしょ」いえ、常識とか知りません。\n\n「じゃあその間俺らも部屋にいるよ」「はぁ？そんなWeirdなオープンハウス聞いたことない。1時間だけなんだから出てて」「あのさあ、部屋の中のものとかどうなるわけ？なんか保証されるわけ？」「今まで何も起きたことがないから大丈夫」「土足」「靴は普通脱ぐでしょ、他人の家に入るのに」えっ？普通脱がないじゃん！\n\nこういう不愉快なやりとりをさんざんして、しかし埒が開かないので渋々承諾。「マジ土足厳禁」「だからそんな人いないっつの」ほんとかよおい\n\nこの一連の話とは別に、管理会社の担当者と退去時の手続きについてもなんとなくふわっと合意する。こちらは1ヶ月分のSecurity Depositを質に取られている身なので、出るときのInspectionとかしつこく問いただしたのだが、結果はなんかふんわりと「1ヶ月後の電気代を精算したら残りを返します」ほんとだろうなおい\n\n## 引っ越し方法を決める\n\n次に決めなければならないのが引っ越し方法。とにかくアメリカ横断なので、荷物を運ぶったってすごい距離を移動することになる。当然お金がかかる。ざっと検索してオンラインで見積もれるサイトを使ってみたりしたところ、$3,500 - $5,000あたりが相場らしい。高い。しかしアメリカの若者たちがやるようにU-haulのバンを借りて自分で運転するような体力も時間もない。ということは選択肢は2つ。\n\nまず、捨てたくない（捨ててまた買うと高くつく）ものを自分たちで箱詰めしてUPSなりFedExなりで送り、持てるものは飛行機で一緒に持っていき、それ以外の持てないものはすべて処分するという案。UPSなりで10箱程度送ると$1,000は超えそうだが、それでも安くつく。ただし大物は持っていけないし、服や靴などだけで10箱くらいにはなってしまいそうで、どんなに吟味しても結局$3,000くらいにはなってしまいそう。\n\nあとは普通に引っ越し業者に頼む方法。とはいえ普段見かける引っ越し屋さんは大陸を横断してくれないので、大陸横断をやっているところを探さないといけない。なんとなく「long distance moving」とかで検索してみると、Allied Van Linesとかいくつか見つかるのと、ヤマトや[日本通運](https://www.nittsu.com/Hikkoshi/)もやってそうに見える。ニューヨークで日本人が開業したっぽいのもあった。\n\n早速これらの会社のWebフォームに引っ越し内容を入力して見積もりを取ってみる。予想通り、アメリカの会社からはメールの返信ではなく電話がガンガンかかってきた。Allied Van Linesから来た電話を取ってみたら、Webで入力した内容を15分ほどかけて全部確認し、「それでは見積もりをするので少々お待ちください」数分後「残念ですがStudioサイズの引っ越しは当社では受けていません」はぁぁぁぁぁぁぁ？最初に言えよ。それWebフォームに入力してあるだろ\n\n他のアメリカの会社からの電話に出ないでいると、ヤマトと日通からそれぞれオンラインでの内見の日にち設定の連絡が来る。ヤマトは明後日、日通は来週、みたいな感じだった。この時点では、どうせ高いだろうからできればこの2社には頼みたくないというのが正直なところだった。\n\nヤマトの内見はFaceTimeで部屋の様子を見せて回る感じだった。所詮Studioなのですぐ終わると思っていたんだが、コートが何枚だとか本が何冊だとか、クロゼットの奥の方の箱の中に何が入っているかとか、結構細かく聞かれる。全部見せたあとで、なんとなく妙な空気が流れて、「少々お待ちください」そして見積もり担当者の上司なる人物が登場して、面談みたいなことが始まる。「聞いたことがなかったんだけど何をやっている会社なんですか？」「ああアメリカの会社の現地採用なんですね」みたいな話。まあすぐピンと来たんだが、多分量が小さすぎてやりたくないんだろうなと。やりたくないんだけど、もしこの会社が今後も引っ越しを何度もするようなところなら繋がる意味があるかな、と思ったんだろう。Allied Van Linesも最初に言えよと思ってムカついたが、それでも「Studioはやらない」と率直に言ったのでまだマシ。そういうことならそういうことを言ってくれれば「ああ、そういう、今回のがよかったから次回も...みたいなのは可能性ゼロですね」って言えるのにさ。\n\nヤマトはその後見積もりが来るには来たんだが、1週間以上経ったあげくに、あんだけ細かく内容を聞いたくせに「全部で$5,980」というクッソざっくりしたものが届いた。やりたくないならやりたくないって言えよな。\n\nもう1社、日本人がアメリカで立ち上げたっぽいところにも見積もり依頼を送ったんだが、そこからは「毎日毎日作業で休む暇もありません。今日も引っ越しでした。見積もりはもう少しお待ちください」という内容のポエム調の返事が来た。来たものの、それから2週間経っても何も起こらなかったので催促のメールを入れてみたところ、夜中に返信が来ていて「8月中はいっぱいいっぱいで9月になれば少し余裕が出るのですが私どもも小さな会社で精一杯...」というなんとも病んだ感じの返信が来たので、これは信頼できないということで、無事をお祈りするメールを入れた。\n\n## 日本通運に決定\n\nヤマトから1週間後に日通の見積もりを受けた。やはりFaceTimeで見せて回るスタイル。ただヤマトのときとは違い、大雑把というか大体の量を把握する程度のものだった。大雑把というと聞こえが悪いが、この段階で細かくコートが何枚とか数えても実際の見積もりに影響を与えるとは思えないので、日通のやり方の方が普通というか当たり前の感じがした。だって結局は箱がいくつ、重さがどれくらい、全体の容積と重さは、ってやって値段を決めるんだから、コートが3枚なのか10枚なのかなんて数えても意味がないはず。ヤマトがやってきたことは本当によくわからん。\n\n日通は見積もりの翌日に、何を入れる箱がいくつで全部で何箱なのでこれ、という結構詳細な見積もりが来た。ヤマトより$1,000以上安い。まあ絶対額を考えたら高いけど、安くできる選択肢があまり考えられないのと、2、3追加質問を入れたときのスムーズかつ的確な返信をみて、日通さんにお願いしようということにした。\n\n$3,000以上の前金を銀行小切手で送り、申し込みをする。すぐに梱包資材の配達日程が設定され、1週間後に段ボール、ガムテ、梱包用のプチプチの巻物などが配達された。日本人女性とヒスパニック系の配達マンの2人組。こういう仕事をしている日本人もこちらで生きているんだなあ。日本人がリードしているチームなので、部屋に荷物を入れるときなんかもデフォルトで靴を脱いでくれるし、やりとりも全部日本語なので、ふわっとしたことを聞きたいときにめんどくさくない。\n\n## 荷造り\n\nまだ3週間あるのに梱包資材が届いてしまったものの、荷造り作業は1週間前くらいからようやく始めた。あまり多くないので2回の週末でほとんど片付けた。\n\n荷造りでやっておいてよかったことは、それなりに細かいmanifestを作って持っておくこと。箱に番号を振って「食器」とかざっくり書くんだが、その番号に具体的に何が入っているかをメモっておく。後で箱を開けるときに役立った。\n\nもう一つやっておいて良かった、というかもう少しやっておくべきだったのが、引っ越し先でどうしても必要になるであろう小さいあれこれをUPSで送っておくこと。タオルとシーツとちょっとした服を一箱に詰めて確か$50くらいで送ったのだが、もう一箱くらい送っておくべきだった。この箱は引っ越し先に着いてから三日後に届いたので役立ったし、もっと送っておくべきものがあった。\n\nやっておくべきだったのにやらなくて、出荷当日に少し手間取ったのが、日通の書式に合わせたmanifestを書くこと。書式には謎の記号を書く欄、内容物の種類に丸をつける欄（食器、雑貨、洋服、など）、それにその個数を書く欄があった。この個数の欄だが、例えばトースターを入れて、トースターの中にスプーンやフォークや箸などを入れる、みたいなことをすると思うんだが、内容物欄の家電と食器に丸をつけた上に「トースターが1つで箸とスプーンとフォークが全部で20本だから21」とか書くのが意味不明だったので、個数欄は空白にしておいた。しかし出荷当日に、その意味不明なことをやらなければならない、しかも詳細にやらなければならなかったことが判明して、適当な数字で埋める羽目になった。本が何冊はまだしも、書類のファイル数が何冊とか、箱を閉めてしまってわからないので困った。結果的に箱がロストするようなことはなかったので何も問題にはならなかったが、そういう事故が起きたときに真面目に書いてあるのとないのとでは揉め方が違うのだろう。\n\n## AptDecoすげえ\n\n家具はほとんど持っていかないことにした。家具といってもあるのはカウチ、カラーボックス的な棚、クイーンサイズのベッドフレームとマットレス、48インチテレビ、ダイニングテーブルとチェア2脚、それと今年に入って買ったばかりの電動昇降デスク。どれも輸送を頼むとそれだけで数百ドル上乗せされるのに、買うと送料を入れてもそこまでの値段はしないものばかり。カウチとダイニングセットは使えるけどもう古いので処分。カラーボックス的な棚も、そもそも不要になるかもしれないので処分。ベッドフレームはAmazon.comで数十ドルだし2ヶ月後に届いても意味がないので、マットレス共々処分。Flexispotの電動昇降デスクは最後まで悩んだんだが、これもやはり新しく買う方が安くつくので処分することにした。テレビは2016年のBraviaで古いし画面にも傷があって悩んだんだが、日通さんにテレビを持って行ったらどれくらいかかるか聞いてみたらサイズと重さ的にプラス$100と即答されたので、これは持っていくことにした。\n\n処分するといってもゴミ箱に捨てることもできないので、まずは売ることを考えた。家具を売るサービスを検索すると出てきたのが[AptDeco](https://www.aptdeco.com/)。mercariみたいな要領で家具を出品して、売れたら集荷から配送までをやってくれる。もちろんその分の経費を取られる（SellerとBuyerのどちらが払うか、または折半かの3つのオプションから選べる）ので、売り上げなんかは微々たるものなのだが、捨てるつもりのものなので簡単に処分できるならそれで良い。これからの4週間でなくなってしまっても困らないもの、カウチとベッドフレームとFlexispotを出品してみた。最低額が$100なので、$100に設定し、こちらの取り分は$15とかそんな感じ。\n\n一番古くて色も褪せていて売れっこないと思っていたカウチが一番最初に売れたのには驚いた。出品して3日目に、$75にしてくれないかとメッセージが来てAptDecoの仕組みのせいでそれはできないので、自分で引き取りに来てくれるなら無料で渡すよと返信した相手がいて、結果的に交渉は成立しなかったんだが、その人曰く表面の布は捨てて中の羽毛の部分を再利用して新しいソファを作るらしい。この人との交渉が頓挫して、やっぱりそりゃ売れないよなと思っていたらその翌週に突然売れた。\n\nNYCのアパートでは家具の搬出入や引越しのときは、エレベーターを予約すること、そしてその作業者が保険に入っていることを示す書類（CoI）の提出をアパート側が求めてくる。一度引っ越しをしたのでこの件を知っていたため、アパートのWebサイトに行ってみると案の定、エレベーターの予約をするとCoIがないと本予約にはならない旨の通知が出た。AptDecoはNYでビジネスをしているので当然これをわかっていて、売れたときに届くメールに書いてある連絡先にCoIが欲しいとメールを送ると、専用のWebフォームへのリンクが届き、そこに必要事項を入力すれば折り返し数日でCoIが届くようになっていた。\n\n出荷当日、AptDecoの委託先だと思われる3人組がやってきて、あっという間にソファを梱包して持っていった。このときこのアパートで家具を搬出する動線が判明して、その途中に大きな家具を捨ててある場所があることもわかった。あとでこの場所は必ずしもそういう場所ではないかもしれないことがわかったんだが、まあ良い。\n\n出荷してから3日後くらいにAptDecoから入金があった。出荷してくれた連中に$20のチップを渡したせいで$5の赤字。$5で処分できたと思えばよし。\n\nFlexiSpotのデスクもカウチの3日後には売れてしまった。こちらは見た目もほぼ新品同様なのだが、そもそも$200という価格設定にしたおいたので新品を$220くらいで買える以上売れるわけがないと思っていたんだが、売れてしまった。もう少し引っ越し日が近づいたら$100に値下げして売り切ろうと思っていたのに。$200でも配送料を全部こちらもちにしたので、売り上げは$30。これはもったいなかったんだけど、運んだら$200では済まないので仕方ない。\n\nエレベーターの予約やCoIなどの一連の手続きを経て、数日後に引き取り、その数日後に入金。AptDecoすげえ。値段を安くしたというのはもちろんあるが、こんなにあっという間に売れるとは思わなかった。2週間以上、晩御飯後にソファでくつろいでテレビを見ることができなくてちょっと辛かった。\n\n## OfferupはXX\n\nダイニングテーブルとチェア、それにベッドフレームはAptDecoでは売れなかったので、Offerupというサービスに掲載した。これは少し綺麗めに作った Craigslistで、Offerupは出荷とか配送とか支払いとかは一切やってくれない。まあ無料で持って行ってくれればいいのだが、無料と書いて変なのに来られても困るので、最初は$50とかで出してみようとした。\n\n出してみようとして何度か写真をあげて説明を書いてSubmitして見るのだが、常に「Guideline Violaion」とやらでRejectされる。なんでかわからなくてサポートに問い合わせてみたら、数日後にメールで「mistakeがあったのでこちらで登録しました」という返事が来て実際に商品がアップされていた。その後もテレビをあげてみたり、フロアランプをあげてみたりしたんだが、どれも毎回Rejectされ、サポートに問い合わせると「mistakeなのでこちらで登録しました」となる。なんだこれ\n\nOfferupでベッドフレームが欲しいが車に入るかどうかわからないという人がメッセージを送ってきたので、正確な大きさを測って返信したら「やっぱり配送までしてくれるのを見つけたのでごめんなさい」された。さらに引っ越しの1週間前にこのベッドフレームが欲しいという人が現れて、土曜日の午後に取りに来られるか聞いたら「Perfect」。やったぜ処分できた！と思って土曜日。解体して運びやすい状態にして待っているとメッセージが来て「ちょっと早く行けそうだけど大丈夫？」イエス大丈夫です。「どういう方法で支払えばいい？」現金がいいけどどうしてもっていうならVenmoかCashappでもいいよ。\n\nそしてそれっきり。これは一体なんだったんだろう。ただのいたずらで休日を無駄に過ごさせてやったぜって話なのか、なんか住んでるところを特定してなんかしようとしていたのか、まったくわからないが、その後音沙汰がなかった。夕方には見切りをつけてベッドフレームを組み立て直した。\n\n結局ベッドフレームも含め、他のものは売れなかったので、アパートの置いておけそうな場所において捨てていくことになった。\n\nそれとOfferupには後日談があって、引っ越して3週間経ったころ突然「あなたのアカウントでCommunity Guideline違反が見つかったので、アカウントを削除しました」というメールが来た。訳分からんし、Androidアプリが何でもかんでもUIスレッドでやってるような動作をしてたし、開いているだけでスクロールも何もしていないのに電話がどんどん熱くなっていく中で無限ループでもしているのかと思うようなXXアプリだったので、2度と使うつもりもなかったちょうど良かったですさよならOfferup。何がCommunity Guideline違反だよ一昨日来やがれっての\n\n梱包も終わり、処分すべきものも処分した、または目処が立った。あとは引っ越し当日を迎えるだけだ。\n\n[引っ越し当日](/blog/moving-5-20220904)へ続く"},{"frontmatter":{"slug":"/blog/moving-3-20220813","date":"Sat, 13 Aug 2022 22:16:05 GMT","title":"カリフォルニアの引っ越し先を決めた","epoch":"1660428964","excerpt":"カリフォルニアでどこに住むか決めました。"},"markdownBody":"\n[前回](/blog/moving-2-20220807)からの続き。\n\n## Hermosa Beach or Irvine\n\n起きてみたらまだ昼だった。この時点でだいぶ熱っぽく頭がガンガン痛かったのだが、気合いを入れてどのアパートに応募するか考えることにした。\n\nこの時点では、一番最初に見たHermosa Beachのアパートに気持ちが傾いていた。トーランスにもビーチにも近くて便利そうだけど街自体は小さくて静かな感じで雰囲気が良かった。Redondo Beachまで行けばシーフードレストランも豊富だし、行かなくてもHermosa Beachにも海沿いに店がちらほらある。アパート自体も小さな中庭にプールがあって、見た感じ住人もパリピって感じではなかったし。LAの中心にも近いし。\n\nふと思ってGoogle Mapsでアパートのレビューを見てみると、何件か「敷地内の駐車場で車上荒らしにあった」という星1つのレビューがある。またまたぁと思いながらも[Crime Map](https://spotcrime.com/)で見てみると確かに、2022年以降ですらすでに何件か報告がある。[Hermosa Beach PDの週間Crime Logs](https://www.hermosabeach.gov/our-government/police-department/weekly-crime-log)でもその報告は裏付けられた。マジかよ、そうは感じなかったけど結構そういう輩もうろついているのか。\n\nもう一度思い出そう。引っ越したい理由は、そういうことをなにも気にせずふらっと出歩くような生活をしたい、そのためなら便利とか文化とかはなくてもいい、そういうことだったはずだ。LAの中心に近いなんてことはむしろマイナス要素だ。\n\n同様にIrvineのアパート近辺もCrime Mapで見てみる。ゼロではないけど数と種類が全然違う。もちろん田舎だからだし、田舎なのにゼロじゃないならますます夜にふらっと出歩いたりできないじゃんとも思うが、Irvineのアパートは出歩かなくても敷地の中にあるカフェでビールも飲めるしだだっ広いので敷地の中で散歩するだけで相当疲れるのでそれで良いのだ。\n\n## アプリケーション（申し込み手続き）\n\n8月5日からの入居で良いという点とメモった家賃をもう一度確認するために、担当者に（日曜日だったので）メールを送ってみた。そしたらいかにも手元のiPhoneで急いで返事しましたみたいなメールが速攻で返ってきて、こちらのテンションも上がってしまい、申し込み手続きに入ってしまった。\n\nNYで行った2軒のアパートの申し込み時には、最初の月の家賃だセキュリティデポジットだというお金は銀行小切手（Cashiers Check）で用意させられ、雇用契約と給与の額を会社のCEOのサイン入りで要求され、さらにChracter Referenceのために会社の上司と友人の2人から推薦状を書いてもらって、ようやく審査に入り、2週間くらいしてやっとYesの返事が来るということだった。この友人からの推薦状というやつが、友人のいない身にはとても高いハードルだった。ああ誰に頼もうかなあと思いながら、推薦状以外で用意できるものをとりあえず用意しておいた。\n\nところが、このアパートの申し込み手続きはすべて、専用のWebサイトで完結した。まずは基本情報を入力してSSNを渡すと信用調査が入り、あっさり申し込みが受け付けられ、セキュリティデポジットも最小額でOKという結果が、なんとものの数分で返ってきた。なにこれ簡単。もちろんそれなりのスコアを持っていればこそだけれども、NYではクレジットスコアが780くらいある状態で応募しても推薦状だのなんだのを要求されたし、そもそもスコアを見られた形跡がなかった。それはそれでcomplianceのためなのかもしれないけども。\n\n入居に関する諸手続きもすべてWebサイトで、書類はDocuSignで署名する。セキュリティデポジット、初月の日割り家賃、Renters Insuranceなどのお金関係もすべてWebでクレジットカード払いで完了。カリフォルニア最高です（このアパートだけなんですかね？！）。\n\nというわけで5週間先に入居するアパートの契約手続きがオンラインであっという間に完了した。\n\n## カリフォルニアでやられた\n\n月曜日。妻と2人して朝から熱っぽくて喉が痛い。熱を測ると36度台後半。まだ大丈夫だったので仕事をする。喉が痛くて話ができないので、ミーティングでは自分だけ筆談。\n\n火曜日。前日寝る前にベンザブロックを飲んだら少し喉の痛みが引いたんだが、熱はさらに上がってひどくなったので米国政府からもらった抗原検査キットで検査してみたが、結果は陰性。うーんCOVID-19じゃないのか？しかし辛いので休みをもらって一日中寝る。\n\n水曜日。朝起きたらだいぶ戻ってきた感じだったので、ミーティングもないし、そのまま仕事。しかし夕方にはまただいぶ辛くなる。火曜日の夜にもう1回ベンザブロックを飲んだんだが、今回は喉の痛みが引かなかった。\n\n木曜日。さらにもう少し戻ってきた感じだったのでだましだまし仕事をする。\n\n金曜日。まあまあ治ったというか、病み上がり感満載な雰囲気になる。熱は下がったし、まあまあこんなもんか。\n\n検査キットの結果は陰性だったので、COVID-19ではなかったのかもしれないが、その後テレビなどでみるBA.1の典型的症状といわれているものに症状がそっくりだったので、やっぱりそうだったのかも。内見ツアーの間なのか飛行機内なのかわからないが、そこそこ辛かった。\n\nその後しばらく経つが、息切れだとかの後遺症はないように思う。\n\n[引越し業者選定](/blog/moving-4-20220831)へ続く"},{"frontmatter":{"slug":"/blog/moving-2-20220807","date":"Sun, 07 Aug 2022 21:34:15 GMT","title":"カリフォルニアで引っ越し先を探した","epoch":"1659908051","excerpt":"カリフォルニアへ出かけてアパートの内見ツアーをしてきました。"},"markdownBody":"\n[前回](/blog/moving-1-20220731)からの続き。\n\n## ニューアーク空港からロスアンゼルス空港へ\n\n木曜日、昼過ぎまで仕事をしてからニューアーク空港へ向かう。家からだと川を2つ渡ることになってUberだと辛そうなので、マンハッタンのハドソン川近くまで地下鉄で行ってからUberに乗ったんだが、結局ハドソン川渡るのに40分くらいかかった。ようやくトンネルを抜けたところで急にガソリンスタンドに入られて、「ちょっと待ってて」。15分くらい車内で待たされた。トイレを我慢できなかったらしい。「この街じゃトイレを探すのは大変なのわかるだろ？」いやわかるけど、出発時刻まで60分くらいに迫っていたので焦った。\n\nニューアーク空港から乗るのは初めてなので、セキュリティとかどれくらい時間がかかるのかビクビクしていたんだが、まあまあそこそこの時間で通過...と思ったらカバンがスクリーニングに引っかかる。引っかかっている人が何人もいて待たされる。待たされたあげく、カバンに入っていた文庫本を取り出して中身をぱらぱらして終わり。はあああああああああ？？？？！！！\n\nJetBlueのEWR - LAX便は結局1時間以上遅れて搭乗になった。しかし到着は予定通り。機長曰くこの時期は風がいいらしい。JetBlueは座席が狭すぎなくてよい。トレジョのチョコチップパンとかポテチとか持っていったんだが、そこまで食べなかった。\n\nLAXについてバスでHertzへ。無料登録しただけだがGoldメンバーなので、列に並んで手続きをすることなく、Goldメンバー用のスポットに停まっている車に勝手に乗り込んで出発できる。出口で免許とクレジットカードを見せて出発。LAXからハモサビーチのホテルへ夜の運転である。Google Mapsのナビでなんとかついたけどフリーウェイ怖い。Hopperで予約していたホテルにチェックイン。疲れたのでシャワーしてすぐ寝た。\n\n## Hermosa Beach で内見\n\n朝、時差が3時間あるので早めに目が覚めてしまう。チェックアウトしてハモサビーチ周辺をうろうろして、時間になったので最初のアパートへ。2人ともメールや電話を登録して、アメニティや空いてる部屋などを見せてもらい、今は空いてないけど8月に開くのはあそこだよーなどと教えてもらう。周囲は静かな住宅街っぽい。住んでいるのは若めの人が多そうだったので、案内してくれている人に「パリピが深夜にプールサイドでウェイウェイしない？」と聞いて見たところ、11pm curfew のルールがあるのでそれはないよ、とのこと。Curfewっていうか11時すぎたらQuiet hour的なことなんだろう。\n\n部屋の中では、壁に耳をつけて隣の音がどれくらいするのかチェックしてみる。無音。結構びっくりした。これまでに住んだニューヨーク市の2軒は両方とも壁からボァンボァンと音が響くし、隣に人がいなくても耳をくっつけると下の階なのか上の階なのかの音がするんだが、ここは無音だった。こりゃあいいぞ。\n\nそれともう1つ知ってよかったのが、Webサイトに「Hardwood floor」って書いてあってもベッドルームはカーペット敷きであることが一般的だということ。本当に全部フローリングなのは1階の部屋だけで2階以上の部屋のベッドルームはカーペットが普通らしい。この後行った他のアパートでもほとんどそうだった。2階以上の部屋で全部フローリングの部屋があったのは1軒だけだったと思う。\n\nApplicationに関する説明や今なら諸費用50%オフなどの話を聞いて失礼する。街もこじんまりしてていい感じだし、内容もまあまあ気に入った。\n\nさて内見できる物件はこれだけなので、トーランスのミツワに偵察に行きがてらランチをした。韓国ホットドッグの店が入っていて、そこが「賢い医師生活」でお馴染みのあのサンドイッチを出していたのでそれを食べる。まあまあ。ミツワの物価調査もしたが、まあ、そんなに変わらないのかな。本当はパロスベルデスあたりのアパートも見たかったのだがSMSにも電話にも返事がないので、仕方なく外見だけを見に行ってみる。が、山の上で結構遠くて運転に疲れただけだった。\n\nこれ以上やることもないので、少し早いがアーバインへ出発することに。しかしフリーウェイに乗る場所を何度もミスしてUターンしまくる。疲れる。遠い。疲れる。あーあー疲れたなーと思っていたころにOracleのビルが見えてアーバインに着いた。\n\n## Irvine で内見その1\n\nまずはAvalon Irvine。予定時刻近くに現地へ行き、インターホンで予約ずみで内見しにきたと行って中に入れてもらい、「Future Residents」の駐車場へ停める。Leasing Officeへ入って、改めて間取りや予算感を伝えて説明を聞くと、まずはLatchというアプリを落とせという。このアプリでゲートや部屋の鍵を解錠できるらしい。登録すると部屋を2つ指定されるので、自分でその部屋へ向かう。COVID-19以降、こういうセルフツアーが主流らしい。\n\nこのLatchってアプリなんだが、Bluetoothで鍵の近くにいるかどうかが判断され、その上でネットで解錠許可をもらっているらしく、アパート内の電波がよくないところでは鍵を開けない。そういう仕組みだろうと分かったので、まずは電話を近づけてBluetoothでの「ハンドシェイク」をさせて「解錠中...」ってなったら通路の奥へ行って電波を拾って、ってやったら開いた。なんじゃこりゃって話なんだけど、自分の部屋なら自分の部屋のWifiが届くだろうから問題ないんだろう。\n\n部屋は3階なのに全部フローリングだし、家電がSamsungの新しいやつだし、よい。壁に耳をつけてもやはり無音。ベランダへ出てみてもやたら静かで鳥の声しか聞こえない。よい。Avalonは規模がでかいのでプールも2つあるしBBQエリアもたくさんあるしとにかく人が多い感じがするけども、まあまあよいのでは？道を渡ったすぐ先にH-martがあって普段の買い物は歩いていけるし。\n\nセルフツアーなのでそのまま出て次のアパートへ。次のアパートはほぼ隣みたいな場所で、立地はよい。部屋は。。。あまり記憶がないな。もう疲れていたのでどうでもよくなりつつあった。前に見たAvalonを超えてくる何かがないとねえ。\n\nこの日ラストの物件は少し離れた場所にあった。行ってみると、道を渡った反対側はオフィス。といっても高層ビルではなくありがちな平屋のオフィスビルである。ということは夜は人がいないのかも。ここは敷地はそこまで広くないんだが、プールが屋上にあってちょうど日が沈むくらいの時間に行ったので、景色がすごかった。いやこれリゾートホテルでしょ、って感じ。部屋もまあまあ、ただ8月ごろに空く予定の部屋は西向きの4階角部屋で、道路のうるささ次第ではどうかな？という感じだった。一応その部屋の写真を外から撮っておいて内見終了。\n\n疲れ切ってアーバインのホテルにチェックイン。当たり前の話なんだが、今日あったLeasing Officeの人々はやたら人当たりがよかったんだけど、このホテルのチェックインをしてくれたスタッフがクソでめちゃ萎える。912とか書いてある鍵を渡されて「ウニャウニャウニャウニャ third floor」って言うから「huh? 9th floor right?」とか聞き返したら「ウニャウニャウニャウニャ third floor」「It's 912 but it's on the third floor?」「yes」仕方なく3階に行ってみたけど当然3階には3で始まる部屋しかない。9階に行ったら部屋があった。なんなんだアイツ、気分悪いな。3階に何があったんだろうか。\n\n夕飯を食べに出かける気にもならなかったので、Uber eatsをホテルへ配達してもらう。韓国風ジャージャー麺と餃子。ホテルの売店でビールを買ったが栓抜きがなくて、カッコつけて鍵で開けようとして指が血だらけになったので仕方なくフロントへ行って開けてもらう。このときフロントにはさっきの人はもういなくて、対応してくれた2人ともとてもよい感じだった。なんだったんだアイツは。\n\n## Irvine で内見2日目\n\n朝、水がなくて喉がカラカラ。このせいだったのかわからないけどあとでやばいことになった。\n\n朝イチでホテル近くの物件へ。やはり免許証を渡して鍵を貸してもらい、自分で見てくるスタイル。うーん、悪くないけどやっぱりAvalon以上のものはない。\n\nここから先は、Irvineを牛耳っているIrvine Companyの物件5連発。Irvine Companyの内見ツアーは、アプリで完結することになっている。あらかじめ希望を伝えて申し込んでおくと、当日にアプリで内見ツアーがUnlockされて、いくつか物件を見られるようになる、という仕組み...のはずだった。\n\nまずはTurtle Rockという場所のアパート。行く途中の道路沿いにやたら素敵な一軒家が並んでいておハイソな雰囲気がする。いやここは田舎のベッドタウンなんでハイソではないだろうけども。しかしTurtle Rockに着いてもLeasing Officeに誰もいない。アプリはUnlockされているっぽいが、Leasing OfficeがStartになっているのにそこに入れない。Gated Communityではないので、脇の道から入って「Start」はスキップしてアパート1へ向かう。\n\nアパート1は2ベッドの部屋で今まさにDeep Cleaning中という感じだった。全部カーペットなのでちょっとパス、って感じ。外に出ると内装工事の人が来て怪訝そうに見てくるので、「内見しただけなので気にせずどうぞ」と言ったんだが、やはり怪訝そうだった。しかしそれよりも問題なのは、2件見られるはずだったのに1件しか登録されていないこと。なのでこれで終了である。なんだこれ。Leasing Officeへ戻ったがやはり誰もいないので、部屋もよくないしいいや、ってことで次へ向かう。\n\n次の物件はIrvine Spectrum Centerっていうでかいモールのそばにある。ここはTurtle Rockよりも遥かに敷地が広くて人が多かった。Leasing Officeに人はいたが、アプリでStartすると勝手に行けとばかりにアパート1への案内が始まったのでそれに沿ってアパート1へ向かう...。アパート1へ行くにはまずホニャララという名前のゲートに行き、そこでアプリに書いてあるコードを入力して鍵を開けて中に入る、と書いてあるのだがそのゲートを開けてくれた人がいたのでそのままスルッと入ってしまう。そこからアプリの地図に沿って進んでいるつもりなんだが、どうにもわかりづらい。結局出てはいけないドアを出てしまい、そのドアは外からは開かないので詰み。\n\nこのドアが開かないと外に出られないじゃん！とパニックになり、アプリからヘルプセンターへ電話して事情を説明する。「閉じ込められましたぁ！出してくださぁい」「いや、そんなはずない、閉じ込めるなんて不可能だ。噴水のある場所？んーその噴水の場所から東へ行けばスタバがあるでしょ？」東？。。。あ。普通に道があって外に出られたw　「すいません出られましたやり直します」「良い1日を」恥ずかしい。\n\nもう1回やり直して今度は自分でゲートを開け、ステップを1つ1つクリアしていくことで少しわかりやすくなった。部屋にもたどり着いたが、やはり床がカーペットで、ううーーーん。敷地が広くて人が多い。うるさいって感じではないけども、なんかここで生活するって感覚が湧かなかったなあ。\n\n## 本命の内見\n\n次の内見時間まで40分くらいあったのでSpectrum Centerでランチ。とはいえ30分もないので、カフェでパン。Spectrum CenterにはHello Kitty Cafeという謎カフェもあるんだが、サンリオがやってるのかなあ。\n\nSpectrum Center近くのもう1軒へ向かう。妻はここが本命で、理由は新築というかここ数年にできた物件だから。Irvineの街は徐々に徐々に開発されていてTurtle Rockあたりはそこそこ古い（80年代？）の建物なんだが、ここは新しい。Leasing Officeも天井が3階分くらいあって広い。しかし人がいない。中でウロウロしているとやっと担当者が現れて、「まずはモデルルームを見てきたら？」とOfficeの奥にあるモデルルームを指される。はぁ、と行ってみるものの、モデルルームはモデルルームなのでものの数分で戻ってくると担当者はいない。\n\nしばらくして爽やかボーイが現れ、「担当者はもうすぐ来るからね（にっこり）」惚れてまうやろ。その担当者は、なんか知らんけどランチタイムだったらしく、もぐもぐしながら何度か奥の部屋とロビーを行ったり来たりして、それからようやく「OK、じゃあ話しましょう」とオフィスに通される。爽やかボーイも別の内見の人を担当していた。\n\nすでに知っているような基本的な説明を受けてから、こちらであらかじめ調べておいた部屋番号をいくつか言ってみる。あー、そこは空いてない。あー、えっあ、その部屋は水漏れが起きてしばらく入れない（新築なのに？！）、など一通り却下された後、部屋タイプ的にここが空いているから今見てきて、と言われ、鍵を渡されて見にいく。確かに部屋は綺麗で広さも十分。その部屋の場所は希望の場所ではなかったが、オフィスに戻って聞いてみると、こちらが希望している部屋は8月5日以降10日間ならいつでも入居できますよ、と言われてびっくりする。\n\nWebサイトではその部屋はすでに入れることになっていたので、1ヶ月分住まないで家賃を払う羽目になるのかうーん、と思っていたんだけど8月5日なら願ったり叶ったりじゃん！なにそれもうここでよくない？と思いながら物件を後にする。\n\nあと2軒、Great Parkに近い方のコミュニティにも行った。正直この時点で疲れまくっていてやる気がほとんどない。小さめのAvellaというコミュニティは空いている部屋がいまいちだった。もう1つのPortola Courtは、建物にできたツバメの巣から、道路に糞が死ぬほど落ちていた。疲れていてもはやどうでも良くなっていた。さらにここは担当者がオフィスにおらず、別の人が仕方なくという感じで（しかしすごく丁寧に）対応してくれて部屋の鍵をもらって中を見たんだが、全然だめでもう帰ろうと思ったところに、その担当者から電話がかかってきて、しかもなんかしつこくあの部屋はどうだこれはどうだって言ってくるので、いやーもういいですーって反応をしたら「なにが望みなの？言ってちょうだい！」みたいな感じになってきてますますうざい。仕方なく最後にもう1つ部屋を外から眺めていたら、真っ赤なマスタングがブォンブォンいいながらその部屋の窓の下から出て行ったのを見て、こりゃダメだ、ということでさようならする。\n\nここまででようやくすべての内見を終了した。疲れた。\n\n## NYへ帰る\n\n22時のフライトまではまだ時間があるので、アーバインを後にして車でレドンドビーチへ戻る。ビーチ沿いにシーフードレストランがあったのを見ていたので、そこまで行って晩御飯にシーフードプラッターをいただく。ビールを飲めないのが残念だったが、そもそも結構肌寒くて、外の席を頼んだんだけどちょっと後悔した。食事は美味しかったし、思ったより安かった。良いなー。レドンドビーチ良いなー。\n\nガソリンを入れて（確か$80くらいした気がする）レンタカーを返して、空港内でようやくビールを飲み、搭乗。隣の席にガタイのでかいやつが座って肘掛けを占領するので辛かった。全然寝られず。\n\n朝7時にJFKに着陸。タクシーで帰ってすぐに寝る。疲れた。\n\n[申し込み手続き](/blog/moving-3-20220813)へ続く\n"},{"frontmatter":{"slug":"/blog/moving-1-20220731","date":"Sun, 31 Jul 2022 19:13:05 GMT","title":"カリフォルニアへ引っ越そうかなと思った","epoch":"1659294821","excerpt":"カリフォルニアへ引っ越すことにして、場所を決めて内見ツアーを組んでみました。"},"markdownBody":"\n## 引っ越すことにした\n\n[転職してフルリモート勤務になり](/blog/job-change-20220516/)ニューヨーク市に住み続ける理由がなくなったので、転職活動中から考えていた引っ越しをいよいよ実現することにした。フルリモートといってもいわゆるLower 48ということで、アラスカやハワイはナシ。じゃあどこへ行くか。\n\nもちろん真っ先に考えたのはサンフランシスコで、友人もいるしLower 48内ならNYCに次いで土地勘がある場所だし（そんなに知ってるわけじゃないんだけど）、ソフトウェアエンジニアなら考えるでしょそりゃ。Apartments.comなんかで見てみると、家賃はNYCと比べてあまり変わらない感じ。ただそのあまり変わらないというのが、なんというか、うーん。\n\n他に治安とそれなりの東アジア人コミュニティてなことを漠然と考えると、シアトル、ポートランドあたりを思い浮かべてみた。さっそくZillowあたりでざっくり賃貸物件を探してみると、NYCよりはやはりだいぶ安い。土地勘が全然ないのであまり安いところはやめたほうが良いと思ったのだが、[ポートランドについてはtypesterさんのブログ](https://unknownplace.org/blog/)を読み返してこの辺ならいいのかな？と思ったあたりを見てみてもやはりNYCよりはだいぶ安い。というか、NYCでStudioに払う金額で2ベッドになる感じ。シアトルについてもベルビューあたりまでなんとなく調べてみたがやはり同じような感じだ。\n\nだがしかし、現地在住らしき日本人（だと思われる人）たちのブログやYouTube動画を見るにつけ、どうしても気になるのが夏以外の天気。年中曇りで日がささないせいでDepressionになるとか。うーん、残り少ない人生を家賃が安いとかいう理由でそんなふうに過ごしていいものだろうか。\n\nじゃあむしろいわゆるベイエリア行っちゃうか？とサニーベール、クパチーノ、ロスガトスあたりも検索してみる。まあ確かに住めそうな賃貸アパートがないわけじゃない。天気も良いし、ソフトウェアエンジニアなら考えるでしょやっぱ。んーでもなあ、ここに住んで自分はともかく妻は楽しめるだろうか、と考えるとなんか違う気がする。\n\n妻に「西海岸へ引っ越したい。西海岸限定だとしたらどこに行きたい？」と聞いてみたら即答で「ロス」。えええ？ロス？あの[Straight Outta Compton](https://www.imdb.com/title/tt1398426/)のロス？[Killing in the name](https://www.youtube.com/watch?v=bWXazVhlyxQ)のロス？と思わず詰めてしまったのだが、考えてみたらそれって80年代90年代の話か。最後にロスに行ったのはTech Ed 96の時だから25年前だ。今のロスアンゼルスはそうでもないのかも？\n\n## 憧れのレドンドビーチ\n\nZillow以外にApartments.comなんかでロスアンゼルスの家賃を見てみる。サンタモニカやビバリーヒルズは当然高いんだが、それでもNYCと比較したら「え、住めるじゃん」って金額だ。とはいえ少し安くなるところはないのかと、やはり日本語ブログやYouTubeを漁って見てみたところ、Silver Lakeってところが「西のWilliamsburg」らしい。Williamsburgは気に入って住んでいるので、これは気になる。物件は数が少ないものの家賃自体は住めそうな範囲の金額だ。ここ、いいのでは？\n\nさらに漠然と検索を続けていると、ロスアンゼルス空港の南側のトーランスという場所に日本人が固まって住んでいるらしいことがわかった。「ロスアンゼルス」ではない気がするが、「日々平穏に暮らしたい」という妻の要望はむしろこちらの方が叶えられるのではないか。ミツワもあるし。車が必要だけどまあそこはどうにか。\n\nっていうかちょっと待って。トーランスって[Developmentorがあったあのトーランス](https://www.showmelocal.com/profile.aspx?bid=13273063)？行きたかったけどついに行けなかったあの[Guerilla COMをやっていたDevelopmentorの所在地](https://web.archive.org/web/19990909153246/http://www.develop.com/dm/Course.asp?id=1)じゃん！俄然トーランスに気持ちが傾き、さらにHotpads.comなども動員してアパート探しをしてみた。そしたらなんと、トーランスって**あの**レドンドビーチの隣街じゃん！ということにも気づいてしまった。[あのお方が住んでいたあのRedondo Beach](https://books.google.com/books?id=kfRWvKSePmAC&lpg=PR23&ots=oafZceeIco&dq=redondo%20beach%20%22essential%20com%22&hl=ja&pg=PR23#v=onepage&q=redondo%20beach%20%22essential%20com%22&f=false)じゃん！俄然テンションが上がって検索の網を広げて見たところ、レドンドビーチでも普通に住めそうな物件がいくつも出ていた。俺、あのレドンドビーチに住んじゃうのかも？\n\nレドンドビーチとトーランスは車があればいくらでも行ったり来たりできる距離だし、治安的にも東アジア人的にもよさげ。妻の知人も「トーランスなら日本語だけでも住めるかも、くらいのところ」ということだそうで、この周辺でまじめに探すことにした。\n\nまじめに探すといっても気軽に出かけていって見て回ることはできないので、もっぱらネットで賃貸アパートを検索できるサイトを毎日毎日眺めるくらい。毎日見ていても物件がそこまで動くわけじゃないし、まして申し込むこともできないわけだが、同じ場所を見続けているとなんとなく家賃相場がわかるし、それ以外の要素、例えばガス水道電気やゴミ出しなんかに必要な金を誰が負担するのが普通なのか、みたいなことがふわっとわかってくる。NYCで住んだ最初のアパートはガスと水道は大家さん持ちだったが、2軒目の今住んでいるところはガスもこちらもち。でもゴミ捨てにお金を取られるなんて話は聞いたことがない。だが、探している場所のアパートの説明ではゴミはrenterなどと書いてあるところが結構あって、へえーそうなんだ、みたいな。\n\nまじめに、しかし漠然とトーランス、レドンドビーチ、ハモサビーチあたりの物件を検索していると、[日本のスターツ](https://kaigai.starts.co.jp/la/house_rent_apart)がここ周辺の物件を扱っていることがわかった。日本から来る駐在さん向けにオンラインで内見ができるらしく、日本からではないけどここに頼めれば、実際に行かずにアパートを見つけられるかも。手数料がかかっても、こっちから飛んでいって数泊してってしたら同じようなお金がかかるので、無駄じゃなさそう。\n\n## アーバイン\n\nスターツのWebサイトで物件を見ていると、「アーバイン・コスタメサ」という地域が出てくる。どういう場所かなあとなんとなく調べてみると、アナハイムの少し南にある計画都市で「全米トップクラスの治安の良さ」らしい。大谷翔平が住んでるらしいという噂はどうでもいいんだが、日本人や東アジア人が多くいて、ミツワだK-martだがいっぱいある。そしてこの地のアパートメント・コンプレックスはどれもこれもやれプールだBBQエリアだとリゾートホテルのようなアメニティがついていて、それでいて家賃の金額はトーランスで探していたような範囲に収まっている。\n\nもちろんクソど田舎のベッドタウンで人工的に作られた計画都市の中にある狭い1ベッドでその金額かよ？って言われるとそりゃそのとおりなんだけど、絶対的な金額の範囲に収まっていればあとは周辺の治安とか住んでいて安心とか、そういうことを重視して引っ越すことにしたんだから、相対的な価値については目をつぶる。目をつぶるとなんだかこっちの方がトーランスよりよく見えてきた。アーバインの街を作って牛耳っているIrvine CompanyのWebサイトでアパートの写真や動画をやたら綺麗に作ってあるので、なおさらトーランスの物件たちがなんとなく暗くてみすぼらしく見えてしまったりして。\n\n## 弾丸内見ツアー\n\n8月中旬に現在のアパートの契約が満了となる。アパートを決めて、申し込んで、書類や小切手を準備して、もしかしたら却下されて、っていう一連の流れを想像すると、7月中旬には決定したい。NYC - LAX のフライトを調べて、6月末の週末に弾丸ツアーを敢行することにした。6月末なら入社して1ヶ月経っているし（関係ないけどなんとなく気分で）ということで金曜日を休みにして、木曜の夜のフライトでLAXへ飛び、金曜日と土曜日に内見をしまくって、土曜日の夜の便でNYCに帰る（日曜日の朝着）という日程を組んだ。内見はギリにならないと連絡しても意味がないので、1週間前になってから、8月にAvailableになると書いてあるアパートを中心に連絡を入れてみた。\n\n...入れてみた、んだが、Webで内見を予約できる1軒以外、レドンドビーチとハモサビーチの物件からは連絡が来なかった。飛ぶ前々日にそんな調子だったので、焦ってアーバインにあるWebで内見を予約できる5軒に急遽予約を入れ、結局ハモサビーチのアパート1軒とアーバインのアパート8軒を見ることになった。こう書いてみるとなんじゃそりゃって感じなんだが、この時点では2人ともアーバインの方がいいかなあと思い始めていたので、まあそういうことでいいか、もし空振りだったら帰ってからスターツに連絡しよう、ということにしていた。\n\n[内見ツアー当日](/blog/moving-2-20220807)へ続く。"},{"frontmatter":{"slug":"/blog/job-change-20220516","date":"Mon, 16 May 2022 04:00:00 GMT","title":"転職した","epoch":"1652673600","excerpt":"ソフトウェアエンジニアとして再出発します。"},"markdownBody":"\n## そうだ転職しよう\n\nこの会社に入ってもうすぐ5年。5年同じ仕事をしていればそろそろ飽きも来るというものだが、今の会社にはAndroid Engineerとして入ったものの、そのアプリが2019年末でサービスをやめてからは、ReactJSでWebアプリ、Objective CでSketchプラグイン、AndroidアプリやiOSアプリ、たまにFlutterもやるなど、同じ仕事を毎日やっていたわけではなかったので、飽きたというのはちょっと違う。\n\nそもそも今の会社に入ったときの転職活動のときに思っていた、このままだと[「何でもできる＝何もちゃんとできない」エンジニアってことになってしまうという懸念](/blog/2017-08-08_Achievement-unlocked----------H-1B---------1-2--488f6217c832/)が再来してしまった。アメリカ合衆国内での職探しはどうしてもJob Descriptionにきっちりフィットする履歴書を持っていないとダメな気がしていて、何でも人並みにできますのでその仕事ももちろんできます、という売り込み方は通用しない印象がある。\n\nそれならAndroidのアプリをシャットダウンしたタイミングでAndroidエンジニアの職探しをすればよかった。当時の同僚エンジニア2人は2人ともSquare出身で、紹介ネタもありそうだったし。しかし当時は[H-1Bがすでに切れていてI-140ベースの延長期間中で](/blog/green-card-2018-2021-11-1/)、会社を移るのは無理ゲーだった。\n\nその後[ようやくグリーンカードをいただけて](/blog/green-card-2018-2021-11-2/)、そこから半年くらいは待ったほうがいいよという各所の助言を得て、2022年には転職活動を始めてみることにした。\n\n## 転職活動にあたって\n\n今回の転職活動にあたって、当初職探しの条件に設定したのは以下の3点。\n\n1. フルリモート、または西海岸の仕事\n2. Androidアプリのエンジニア職\n3. 給料をあげる\n\n### 1. フルリモート、または西海岸の仕事\n\nトランプ、BLM、パンデミック、(Stop) Asian Hate、バイデン、クオモといろいろあるニューヨークライフだが、あまりテレビニュースで見るようなひどいことには巻き込まれていなかったので、どこか他人事感を持っていた。しかし2022年になって、いわゆるコロナ禍が終わりに近づいてきたせいか、周囲の家賃相場がアホかというほど上昇していくのを見るにつけ、いいかげん現状の給料ではここには住み続けられないと気づき始めた。それならということでもう少し家賃の安いところを探してみると、ここに住むのは治安的な意味で無理ってところばかり。無理じゃない場所は高い。当たり前。ハドソン川を渡れば少しは安くなるけど、会社はそろそろハイブリッドに変わりつつあって、通勤が面倒になる。というわけでこのままだと給料をあげるしかない。現状で給料をあげるには転職しかない。8月（今のアパートの契約切れ）までに転職だ。そして、転職するなら何もニューヨーク市に住み続ける必要もないんだ。だったらちょっと風景を変えてみよう。というわけで、西海岸へ引っ越すことを視野に入れることにした。\n\n### 2. Androidエンジニア\n\nJob Descriptionにフィットするような履歴書を書けるようになるためのポジションということで、自分のスキルと興味を棚卸しすると、やっぱりAndroidエンジニアが一番それっぽいんじゃないかと思った。試しにちょいと探してみると、それなりに給料が上がりそうな募集も結構ある。なのでそれで行こうと思った。\n\n### 3. 給料をあげる\n\nニューヨーク市から出ることで家賃が下がるなら、給料は現状維持でもいいのかもしれない。したがってこの点は柔軟に、下がらなければ良いってことで。そしてこれを実現するために、複数社からオファーをもらうことを目指す。\n\nこの3点を念頭になんとなく職探しを始めてみてすぐに、これらの条件にマッチしそうで、めちゃおもしろそうなことをやっていて、日本との繋がりもある会社があったことを思い出してその会社のホームページを見に行ったらなんとモバイルアプリのエンジニアを募集していた。速攻で応募してみたのが1月のことだった。この会社からは結局3月頭にお断りされてしまってとても残念だったのだが、一社応募しちゃったんだしということで俄然ヤル気が湧いてきて、LinkedInの内容を整理し、職務経歴書を書き直し、Hired.comに登録してプロフィールを公開して、まじめに転職活動を始めたのが2月。\n\n## 転職活動の内容\n\n前回の転職活動での反省を踏まえて、今回はCVの内容をAndroidアプリ開発に関わることに絞って書き、それ以外の「何でもできるんですよ」みたいなアピールをしないようにした。それと、普段から公開していた履歴書には大学卒業以来のすべての経歴を書いていたのだが、これだと年齢差別にあいかねないので、直近数社のものだけにした。大学の卒業年度とかも消した。そもそもそういうのは採用プロセス中に聞いてはいけないのだし。\n\n転職活動の準備として行ったのは、Leetcodeのeasyやmediumをやることと、HackerRankの問題を上から順番にやること。それとdeveloper.android.comで最近のAndroidアプリの書き方をあらためておさらいし、Flickrの写真を一覧するアプリとか、Google Authenticator的なTOTPをやるアプリ（QRコードをスキャンするとか）をそのやり方で作ってみることくらい。あとはインタビューを受ける会社のJob Descriptionを見て、それに合わせて自分の職歴をしゃべれるようにまとめることはインタビューの前にやっておいた。\n\nHired.comで審査を経てプロフィールが公開されると、さっそく数社からインタビューリクエストが来た。どれも希望する給与を満たすAndroidエンジニアのポジション。これは幸先がいいぞ。ここから6ヶ月あれば1社くらいには滑り込めるのではないか。\n\n振り返ると、まじめに始めてから1ヶ月程度の期間で、リクルーターの電話スクリーニング、Hiring Managerとの面談と進んだのが10社くらい。その後コーディング面接の時間までスケジュールできたのが5社。就業時間中にはやらないようにしたので、ランチタイムの1時間と夕方以降だけでスケジュールしたのだが、多くの会社が太平洋時間にいるせいでうまく行った。もっともこちらは通常業務を終えてから日によっては2コマもインタビューを入れたりして、だいぶ疲れた。\n\nコーディング面接で、いわゆるLeetcodeだったのは2社。そのうち1社はマージソートを書かされた。今どきソートとか書かせねーだろとかヤマをはって完全に裏目った。最終的には書けたんだけど、それで40分使っちゃったので予定されていた2問目には進めず。この会社はその2週間後に連絡が来て、なんとお祈りではなく次のステップをと言われたのだが、すでにオファーをもらったあとだったので断った。\n\n### Coderpadのバグ？を踏む\n\nLeetcode的なやつのもう1社はフィンテック？な会社で、簡単なクレジットカード番号のパーサーを書くところから始まった。定石にしたがって、入力の長さチェックとか数値以外が入る可能性があるのかとかそういう質問をし、「いやそれは気にしなくていいからとりあえず書いて」と言われたので、テストケースにあらかじめ挙げられているものをパースできるコードを書いて、CoderpadのRun Codeを押す。問題なく3つのテストケースをPassした。そしたら向こうは不思議がって、あれ？あれ？ちょっと待てよとかいいながらassert(false)的なテストケースを向こうで追加してRun Codeした。すると今度はさっき通ったテストも含む全部のケースがFailした。は？なんで？テストケースを追加したらさっき通ったやつもFailしたのなんで？相手はなぜか満足そうに「これは思った通りの結果だ。どこがおかしいかわかる？」え？\n\nいやどこもおかしくないんだけど、といいながらこちらでRun Codeしたらやはり全部Fail。さっきは通ったのに、テストを追加したら今度は全部Failしたことになる。意味がわからなくてprintlnを挟んでみたりして実行するんだが、Fail。いやまじでわからない。追加されたテストを消して元に戻してもやっぱりfailするって何？\n\n本当にわからなかったので焦ってブラウザの戻るボタンを押してしまい、あわてて元のページへ戻って、書いたコートが消えてないか確認してみてびっくり。なんとさっきは一番下の行で見えていなかった、最後のreturn文を書き直した分が消えていた。元々`return null`が書いてあったのを、最初のRun Codeの直前に`return map[issuer]`的なコードに書き直したのに、`return null`に戻っていた。最初にテストをpassしたときには書いてあったのに、実行してpassしたのを見て「あれ？」とか言っていたのは、向こうのCoderpadのエディタにはその最後の書き換えが反映されてなくて、それなのにテストがpassしたのでおかしいと思った、それで向こうでテストケースを追加してRun Codeしたせいで、向こうの見ているものが最新になり、こちらの画面はリロードするまで内容が変わらなかった、ということだったようだ。通信環境のせいかもしれないが（相手は音質も画質も悪かった）、Coderpadのバグだと思う。I swear I wrote this line; you saw the tests passed the first timeとかなんとかいったが、とにかくこれのせいで時間を取りすぎて肝心の「このダメコードをどう直すか」みたいな部分へ進まず、「じゃあ時間がないから何か質問ある？」ha、ダメだこりゃ意味ねーわと思って「特にないです」「じゃあさよなら」で終了した。\n\nこの会社は1週間経っても連絡がなかったので、こちらから「先に進むつもりはありません」と送ったら「候補者の意思でプロセスを打ち切りました」みたいな自動メールが来た。\n\nこの後もう1社Coderpadを使う会社があったのだが、そこではいちいち「この行、今書いたの見えてる？」「最後のreturn hogeって見えてるよね？じゃあ実行するよ」とかってやった。Coderpadを使うときは気をつけよう。\n\n### Androidクイズでつまずく\n\nある会社の面接ではAndroidクイズを出された。1問目はAndroid Studioのレイアウトエディタのデザイン画面のスクショを見せられて、それを作る方法を口頭で言わされる。ConstraintLayoutで、Text1はstartをparentにして次のText2はstartをtoEndOfでtext1にして...とか。2つ目のデザインではLinearLayoutでlayoutWeightで、とか言ったらうちはLinearLayoutは使いませんとか言われて、はあ、しかしこれをConstraintLayoutで実現する方法は覚えていないです。やれば数分でできるだろうと思いますが、今は覚えてません、みたいな返事をした。\n\n次の質問は「Describe the difference between ViewModelOwner and This」。Google Docに書いてある文で、大文字小文字も原文ママである。なんの文脈もない、この一文だけ。今どきこういうのを聞かれるとしたらやっぱり「Activityとかでflowをcollectするコードを書け」みたいな、launchWhenStartedじゃなくてrepeatOnLifeCycleを使おうね、みたいな話を聞くんだろうなと思って、LiveDataは最近使ってないしもう使わんでもええやろ的なヤマをはって裏目った。ViewModelOwnerって大文字で始めてるから、あれ、これってクラスだよねそれとThisの違い？Thisってなに？もしかして自分の知らない何かなの？単に先頭が大文字になっちゃっただけでしょ？とか頭の中大混乱。今思えば、「これ大文字に意味あるの？」って質問すればよかった。なんかこの面接ではクイズが唐突に始まったので、これはウォームアップなんだと思って、いわゆるコーディング面接がその後に続くんだろうと思い込んでいたので、コーディング面接での定石が頭からすっ飛んでしまっていた。クイズだから、なんかパッと即答してどんどん進まないと行けないような錯覚に陥ってしまっていた。\n\nいやFragment内でthisでobserveするとviewが消えてもfragmentが生きててさあ、みたいなことを答えた。そういう程度の知識はあったけど、あれ、これってonViewCreatedの話だったよな、あれ？ActivityでもViewModelOwnerってクラスで何かできるの？知らないよそんなの、ってパニクってしまった。\n\nそして最後の問題「2つのActivity間でデータを共有する方法を答えなさい」。何を答えればいいのかわからない。1つ前の問題ですでにパニクっていたので、ここでもえ？え？となってしまい、えーと例えばファイルやデータベースを使うとか、あーいや、Intentで送ってonActivityResultで返してもらうっていうレベルの話ですか？みたいなことを言ったら相手は困惑顔で、「えーと、OK。SingletonをInjectすればよいですね。Singletonはわかりますか？Dagger2を使ったことがあると履歴書に書いてありますが？」まじかよ。その質問で正解がそれだけってことはないだろ。\n\nこのインタビューの最後には、「あなたはこれらの質問に正しく答えられなかったので、Seniorのポジションで進めるのは難しいと思います。でもあなたには多くの経験があるようですので、1つ下のレベルのポジションで進めるとしたら興味はありますか？」と聞かれた。いや、うぅぅぅ、このクイズに即答できないとSeniorじゃないの？そうなのか...まあでもコーディング面接をまだ続けられるなら練習にはなるし、いやもう少し自分を証明できる機会をもらえるのでは？とか思って、ぜひお願いしますと答えたが結局1週間後にお祈りされた。SingletonをInjectするシニアエンジニアを雇ってがんばってくれよチクショー。\n\n### その他\n\nもう1社はそこそこ実践的なものでLeetCodeではまったくない。Google Doc上で擬似気味なコードを書いた。この段階は通って次のvirtual on-siteのスケジューリングへ進んだんだが、他のオファーを受けたのでお断りの連絡を入れた。\n\nコーディング面接の前に宿題を出された会社も1社あった。このポジションはプラットフォーム横断的なことをする内容で、宿題もフロントエンド（UIデザイン含む）、API設計と実装、モバイルSDK（ライブラリ）開発の3つから1つ選んで、まあ2、3時間でやってください、というもの。これだと週末にできるのでとてもよい。\n\n最初API設計と実装のプロジェクトを始めて、expressでTypeScriptとNode.jsとOpenSearchでさくっと実装したんだが、地図上のある点に近い登録情報を検索して出すみたいな内容をOpenSearchを使ってやってしまって、これじゃOpenSearchのQuery DSLを知っているだけでできてしまうので面白くないと思い、モバイルSDKの方に鞍替えしてみた。まあこれも結構あっさりできたし、DIで外部レイヤーを抽象してテストを書いてみたいなことをやったので、そこそこ自信を持って提出した。だがしかし、それから音沙汰なしでGhostされた。宿題を提出させてGhostかあ。Hiring Managerとの最初のスクリーニングでは好感度高い感じだったんだけどな。無視されるほどひどいコードを書いたとは思えないんだけど、Ghostなので何もわからない。オファーをもらってしまったのでこちらから連絡するのも癪だし、結局なんのフィードバックも得られなかった。\n\n## そしてもう1社\n\nコーディング面接まで進んだ中の最後の1社は、こちらから応募した会社だった。そうしたら応募したポジションとは異なるポジションはどうですかという連絡がきて、とりあえず話を聞いてみることにしたのだった。その時点ですでに電話スクリーニングだけで10社くらい、上記のコーディング面接もいくつか設定済みで、さらにその次の週末からまる2週間以上日本へ行く予定を抱えていたため、最初のHiring Managerとのインタビューでその旨を伝えたところ「じゃあそれまでにオファー出せるように面接を入れようか？」と言われた。さらに「それじゃあ一連の面接の中のシステムデザインのところは俺がやるから、今からやろうか？」このとき午後6時半。夕飯を作ってくれていた妻に断って、それをやってみた。\n\n内容はその会社の製品の内容を簡略化したシステムで、外部API連携をどう作るか、API呼び出しの回数に制約があるが普通に作ったらそれを超えてしまうけどもどうするか、外部APIは遅いこともあるが、UXを悪くしないために何ができるか、自社内にキャッシュのDBを作る？じゃあそのスキーマは、それにアクセスするSQLは？など。Google Drawで絵を描きながらやったのだが、何か答えるたびに厳しいツッコミがきて、正直これは通らなかったなと思っていた。面接終わりに「あなたはモバイルエンジニアなんだよね？」と聞かれたのでますます「あ、これはダメだったか」と思ったんだが、翌日には早速Hacker Rankの宿題と、本当ならHacker Rankの試験の後にスケジュールされるはずの面接3本の予約フォームが送られてきて、すごいスピードでプロセスが進み始めた。\n\n金曜日にまずAndroidチームのエンジニアとコーディング面接。これもLeetcodeではなく、渡されたお題に対してinterfaceを定義してdata classを定義したら、そのdata classにまつわる内容が変更されたときどうする？data classにフィールド追加、またはMap<>でやっちゃう？でもキーにとりうる文字列はどこかで定義しておきたいかな、などと話す。さらに別の場所で似たような問題が起きたらどうする？ああその要件ならMap<>よりも別のdata classを定義して別のメソッドも定義する方が安全だと思う、など。AndroidクイズではなくてAPIを呼ぶコードを実際に書いて、それを運用した経験があるよね？ってなことを確認した感じだった。\n\n土曜日にHacker Rankの試験をやる。75分の設定で、60分はコーディング15分は書き問題。それなりに業務に即した内容で、コーディングの方は60分で20個くらいあったテストケースのうち2つをpassできなかった。焦りまくって15分の方の書き問題を超スピードでこなしたが、ときすでに遅し。\n\n宿題を全部passできなかったのでお断りされるかと思ったけど、そのまま月曜日にもう一度コーディング面接。今度はバックエンド開発的な内容で、キャッシュをパージするタイミングはどうするかとか、呼び出し相手によってAPIや結果の形式が違うから、外部API呼び出しの部分はアダプター化してそこだけ別に更新できるようにしようとか、まあそういう提案をして納得してもらったような感じ。\n\n月曜日はもう1つ、TPMとのBehavioralな面接。これはまあ、常識的にそりゃそうだよねえというような返答をしていって終始和やかに終わる。「判断に必要なデータが足りていない状態で何かを実装しなきゃならないとしたらどうしますか」みたいな。\n\n火曜日にリクルーターから連絡が来て、エライ人との最終面接が木曜日の朝に設定された。エライ人はどちらかというと会社の状態の説明や、入ろうとしているチームに会社が期待していることなどを話し、こちらからは2、3定型な質問をして、おしまい。金曜日に、本当に出発前にオファーレターが届いた。\n\n面接してくれたメンバー全員がいい感じだったのと、どの人にも「そこで働いていていいことなんですか」と聞いたんだが、みんなとてもよい感じの返事をしてくれていてよかったのだが...。\n\n## オファー、そして...\n\n怒涛の手続きを経てオファーまで一気に進んだこの会社だと、当初掲げた条件3つのうち1つを満たさない。つまり、給与は上がるしフルリモートで西海岸への引越しはむしろ歓迎されるのだが、Androidエンジニアではない（ただし手出しする機会はありそう）。給料をあげようという目標のために、今回の転職活動ではオファーを複数もらってそれから考えるということをやりたかったのだが、ここ以外の他の会社の状況はどう考えても日本に行って戻ってきてから面接を再開することになる。その頃にはこのオファーは期限切れである。\n\n数時間考えたのだが、オファーを複数もらうというのはそれ自体が目標なわけじゃないし、掲示された金額はこちらの言い値がベースで、それにストックオプション少々、健康保険も本人分はプレミアムまで会社負担ということでトータルでかなりの増額になる。給与をあげるという目標は達成されたと言ってよい。Androidエンジニアではなく、相変わらず広く浅く手を出す仕事になりそうなんだが、この会社の製品自体はモバイルアプリなので、カルマをうまく貯められれば（そしてやりたければ）社内異動もできるかもしれない。どうしてもAndroidエンジニアじゃないといけないのかといえば、別にそんなこともないんだし。\n\nというわけで、現職の上司を日本へ行く前の金曜日にZoomで呼び出して、その旨を告げてひどくがっかりされた。とてもとてもお世話になったので申し訳ない気持ちでいっぱいだ。そして日本に到着した翌々日の早朝、時差ぼけで起きてしまったので朝4時にオファーレターを改めてじっくり読んでサインした。\n\n日本から帰ってから具体的に面接日時を決めようとしていたリクルーター数名には、お断りするメールを送った。ここでさすがというかなんというか、大手で余裕がある会社のリクルーターほど「おめでとう、今回は残念だけどまた関わる日も来るだろうからまたそのときに」的なメールを返信してくるのである。好感度爆上がりなのである。めんどくさいから送らないことが多いだろうこういうのが後々効いてくるんじゃないかなあと思ったりした。\n\n## 転職活動に関する余談\n\n今回転職活動をしてみて一番おもしろかった（いやおもしろくない）のは、Hired.comでプロフィールが公開されてからすぐ、爆発的にスパムメールが増えたこと。週に数通程度だった（のでスパムフォルダは何もせずに放置していた）のが、1日に50通来るようになった。メールアドレスは自分のWebサイト上で公開していたのだが、以前はそんなに来ていなかったのに、それがHired.comに登録した途端に爆発した。何が起きているんでしょうね。\n\nもう一つおもしろかったのは、Hired.comでプロフィールを公開してすぐに、突撃リクルーターメールも爆発的に増えたこと。Hired.comでインタビューリクエストを送ってくる会社もあるのだが、なぜかそれは使わずにメールアドレスだけを抜いて直接メールをしてくるリクルーターがたくさんいることがわかった。これの多くがスパム送りになるので、スパムフォルダを毎日チェックして整理する羽目になった。\n\nまた、Hired.comには空き状況を示すカレンダーの機能があるのだが、多くのインタビューリクエストはそんなのはお構いなしで、Calendlyを使っていた。Hired.comのカレンダーで一元管理できない以上使う理由がゼロなので、結局自分もGoogleカレンダーで管理することになり、Hired.comのカレンダーでは空きがまったくない状態にせざるを得ない。律儀にHiredを使うユーザーほど損というか面倒になってしまうので、プロダクトの根幹に関わる問題な気がする。\n\n## 反省\n\n今回の転職の反省点。結局コーディング面接まで進んだ会社が5社しかなかった。本当はもっとたくさん受けるつもりで、期間も3ヶ月くらいはやるつもりでいたんだが。しかしその3ヶ月の中のどこでリクルーターとのファーストコンタクトは締め切るかは決めておくべきだった。コーディング面接を控えたランチタイムに別の社のリクルーターとの電話をすると身が入らない。もっといいところ、もっといいところ、と思ってなんとなくずるずるとインタビューリクエストを受けまくってしまった結果、大して興味のない会社のリクルーターとの面接では明らかに自分にやる気を感じなくて、相手にも申し訳なかった。\n\nコーディング面接の準備はHacker RankとLeetcodeをただただやっていたのと、developer.android.comで最近のおすすめな書き方を見て実際にやってみる程度のことをしていたのだが、HR/LCはそもそも苦手なのでやはりあまり身が入らない。ほとんどJavaScriptでやっていたのだが、途中からEasyをKotlinでやってみるとかしていたおかげでCoderpadにKotlinで書かされたときに対応できたのはメリットだったかもしれない。でもアルゴリズムとデータ構造が身についたとは言えないな。次に転職するときはマージソートを練習しておこう（たぶんやらない）。\n\nリクルーターやエンジニアでないHiring Managerとの電話面接では、相手のJob Descriptionに合わせて自分の経歴を微妙に変えてしゃべるようにしていて、それは事前に調べてメモっておいたので、どの会社とでもまあまあうまく喋れたと思う。1社だけ、Series Aの調達を今まさにやってますっていうスタートアップに対して、西海岸に引っ越すつもりで、引っ越した途端に仕事がなくなったとか辛いから「で、Runwayどれくらいあるの？」って聞いたら、リスクを取りたくない人だと思われたらしくお祈りされたことがあったのだが、まああれは仕方ない。\n\n振り返ると、最初にこちらから応募して、7−8人と面接をして、どれもそれなりにうまく行ったと思ったのに3月にお断りされてしまった会社が一番悔やまれる。どこでダメな印象を与えたのかわかっていないんだが、たぶん言い方の問題でこっちの本心とは違う受け取り方をされたんだろうと思う。あれはなんとも悔しい結果だった。\n\nこれ以降は、何かに答えるときに取りようによっては悪く思われそうなことがあった場合は、どういう答えを期待しているのか聞いてから答えるようにした。例えば「現職でのデザイナーとのやりとりでうまくいかなかったことはありますか？どういう風に対処しましたか？」みたいなやつ。現職でやりとりするデザイナーはみな凄腕でうまくいかなかったことなどないのだが、「そんなことはなかった」と答えてしまうと耐性や免疫がないと思われて敬遠されるかもしれない。かといって全然問題なかった話をさも大問題だったかのように説明するのも嫌だ。そこで、「パッと思い当たらないんだけど、今デザイナーとエンジニアの関係で何か困っているようなことがあるのですか？」と質問者に聞いてしまった。これで、関係に困っているのではなく、ジュニアなデザイナーしかいないのでシニアなエンジニアはジュニアなデザイナーのこともメンターして欲しい、みたいなことだったことがわかる（こともある）ので、こういう場合はうまくいかなかったことではなく、うまくいった（最初からうまくいかせた）ときに何に気をつけたのかを話してしまえばよい。\n\nAndroidエンジニアを業務でやっていないのにAndroidエンジニアで転職したいということで、[OSSのAndroidアプリの地味なバグを地味に直す作業](https://github.com/signalapp/Signal-Android/commits/main?author=fumiakiy)も続けてきたのだが、その点を話してちゃんと評価してくれたらしきコメントをくれたのは1社だけだった。自分のプロジェクトでもない限り、やはり業務でやっている人じゃないと即戦力とはみなされづらいのかもしれない。それに結局は定型のコーディングテストをパスしないと、あの程度のコミットの内容ではスキルもよくわからないんだろうし。\n\nリクルーターからたくさん連絡をもらったのだが、前回の転職時と同様に結局はこちらから応募した会社に行くことになった。ただし前回よりもはるかに多くの会社にこちらから応募したのだが、面接まで進めず、Ghostだったり最初の書類でお断りされたりすることが多々あった。リクルーターはやはりそれなりにこちらの書類を見た上で先に進めそうな人だからコンタクトしてきているので、積極採用中らしき会社なのに向こうから来ない場合はこちらから行ってもダメなのかもしれない。オファーを受けることになった会社も、実はHiring Managerの方でHired.com上でこちらを見つけてくれて、声をかけるつもりでその前に自社の採用データで名前を調べて見たら、なんと前日にこちらから別のポジションに応募していたことがわかってびっくりしたと言っていたので、実質向こうから声をかけられたようなものだ。自分程度の経歴では、こちらから応募しても多数のライバルに埋もれてしまって無駄なんだろうなと気づかされた。次回はもっと声をかけられるように仕事をがんばろう。\n\n## One Room Disco\n\n新しいのは会社だけではなく、住む場所も新しくするつもりで、西海岸、具体的にはロスアンゼルス近郊で探してみることにしている。\n\nニューヨーク市に住んでいて良かったなあと思っていた点は、世界一レベルの文化施設（美術館とか博物館とか）がまとまっていて、でかい公園もたくさんあって、そしてそれらに地下鉄でお気軽に行けるということだった。多様な人々が狭い島にぎゅうぎゅう詰めで生きていて、狭い地下鉄に詰め込まれながら日常を過ごしていることからくる安心感にあった。しかし、何を起点にそうなっていったのか定かではないし元々幻想だったのかもしれないが、とにかく今の地下鉄には安心して乗ることはできないし、人にお勧めすることもできない。女性がベンチに座って電車を待っていたら人糞を顔に投げつけられる地下鉄とかムリ。大して遅くもない夜にアジア人女性が自分の住むアパートの廊下で後ろから刺されて死ぬような街では、一人で出歩けない。そりゃ地下鉄に乗らずにシェア自転車で出かければいいし、夜は外に出なきゃいいし、そもそもそんなのは全米のどの街でも大して変わらない、むしろニューヨーク市ははるかにマシな方だということも知っている。だけど人糞事件で（そしてその容疑者が何度も逮捕されては保釈金なしで釈放されていたらしいことを知って）自分の中の何かが切れてしまったのは事実で、だったら、どうせどこでも同じなら、風景を変えてみるのもいいんじゃないかと思った。家賃高いし。\n\nそれなりの治安、家賃安そう、リベラルな空気、東アジア人の多さ、などから思いつくのはシアトルやポートランド。しかし聞けば聞くほど、夏が終わると次の春まで晴れ間がないというのはちょっとイヤだなあ。じゃあやっぱりサンフランシスコかベイエリアか。しかし家賃は高い割にNYCに比べると何もないよなあ。\n\n西海岸で何でもあって大きな都市といえばロスアンゼルス。チラッとapartments.comをみてみると、家賃はNYCよりは安い。治安が心配ではあるが、前回ロスに行った90年代に比べれば改善されているような印象をうける。給料も上がったしフルリモートなおかげで、辺鄙なところに住んでも問題ないのだから、治安優先で探せばなんとかなるのでは？まずは週末弾丸ツアーでもして巡ってみようと思う。しかし航空券高いな。あーカリフォルニアなら車も買わないと。あーガソリン代も高いな。うーん、給料足りないかな。\n\nそういうわけで5月から新しい職場でまたがんばります。新しい場所でうまくやっていけるかな。\n"},{"frontmatter":{"slug":"/blog/meross-smart-wall-switch-1","date":"Mon, 17 Jan 2022 20:24:09 GMT","title":"壁に埋め込まれている電気のスイッチをHomekit対応のものに入れ替えた","epoch":"1642451049","excerpt":"スマートホーム的な何かをもう少しやってみるために、壁のスイッチを取り替えてみた。"},"markdownBody":"\n## 序\n\nクロゼットの電灯を点灯するためのスイッチを、諸般の事情で取り替えてみた。諸般の事情とは、暇なので何かやりたい、なぜかクロゼットの電灯はしょっちゅう点けっぱなしになっている、スマートホーム的なアレでどうにかなるのでは、という三段論法（ではない）である。\n\n以前のエントリーでも触れた通り、この手のスマートホーム化にあたって気にしているのは、GoogleだのAmazonだのに接続しないこと。[理想はローカルネットワークで完結して外には出ないし外からも来ないでほしい](/blog/2020-05-23_Sonoff-Basic-R3-------------------f5498b92027b/)。Google AssistantとかAlexaとかは使わないでおきたい。ベッドサイドのランプをアレするのでお世話になったSonoffからも壁に埋め込むスイッチが出ているのだが、これはDIYモードをサポートしておらず、はんだごてを駆使して[Tasmota](https://tasmota.github.io/)あたりを焼かないとならない。それはちょっとめんどくさい。\n\nそこでHomekitである。Homekit対応のデバイス同士の通信はローカルで完結することになっている。iCloudへの登録は必要なので完全にローカルではないが、Homekitを使えるなら、[Sonoff Basic R3のときに問題になった、Apple Developer Programへのお布施](/blog/20200815-m5stickc-http/)をせずにAppleデバイスから操作ができる。これは妥協できるポイントなのではなかろうか。\n\nちょっと調べてみると、[Merossという会社のSmart wall switchがHomekitに対応していて](https://www.meross.com/product/23/article/)お値段もお安い。こいつでいっちょやってみるかということで、Switchを1つと[Voltage tester](https://www.amazon.com/KAIWEETS-Non-Contact-Electrical-Breakpoint-Tester-VT200/dp/B09BQYV2BR/)を買った。\n\n## 取り付け\n\n左がBefore、右がAfter。\n\n|||\n|---|---|\n| [![ダサいトグルスイッチ](/images/wall-switch-before.png)](/images/wall-switch-before.png)| [![スマートスイッチ](/images/wall-switch-after.png)](/images/wall-switch-after.png) |\n\nまずはVoltage testerに電池を入れて、ちゃんと動作するかを試す。具体的には、壁のコンセントのLineの方に突っ込んで通電を検知すること、Neutralの方に突っ込んで通電していない状態を検知すること、さらにブレーカーパネルでそのコンセントのブレーカーを切って、Lineの方でも通電していない状態を検知すること、また元に戻すと通電を検知すること、を確認した。\n\n次にSmart wall switchを開封した。中にはスイッチ本体と化粧パネル以外に、工事中にケーブルに貼って識別しやすくするのであろうステッカーと、ケーブルを接続するスクリューキャップも入っていた。良心的。説明書はネットにも上がっているので事前に読んでおいた。\n\n![内容物](/images/smart-switch-contents.png)\n\n準備ができたのでまずはブレーカーを落としてスイッチへ電気を流さないようにする。壁のスイッチからパネルを外してスイッチを取り出す。この状態でブレーカーで電気を入れて、Voltage testerでLoadとLineを調べる。スイッチをOffにした状態で電気が来ている側がLineで、スイッチをOffにしていると電気は来ないが、Onにすると電気が来る方がLoad。今使っているトグルスイッチにはその手の表示がなく、ワイヤーもカラーコードされていないので（両方とも黒だった）、よく見かける「[普通は上がLoadで下がLine](https://orro.zendesk.com/hc/en-us/articles/360019870294-If-my-Line-and-Load-wires-are-the-same-color-how-do-I-know-which-is-which-)」という説を鵜呑みにせず、ちゃんとVoltage testerで調べる。何度かスイッチをOn/Offしたりブレーカーを上げ下げしたりして、Lineに赤、Loadに白の印をつける（付いてきたステッカーはなんかもったいなくて使わなかったw）。\n\n![電気が来てる](/images/voltage-tester.png)\n\n調べ終わったらスクリューからワイヤーを外す。次に、中のスイッチボックスから現時点では使われていなくて素通ししている、ニュートラルのケーブルを取り出す。実はこれもSmart wall switchを買う前にすでにここにあることを確認してあった。というのもSmart wall switchの多くはこのニュートラル配線がないと使えないものもあるからだ。今回買ったものも「Neutral required」とそこかしこに書いてあるので、先に確認してから買わないと。さすがにニュートラルは白いワイヤーだった。よかった。\n\n|||\n|---|---|\n| [![ケーブル識別後](/images/cables-identified.png)](/images/cables-identified.png)| [![スイッチ取り外し](/images/old-switch-removed.png)](/images/old-switch-removed.png) |\n\nあとはSmart wall switchから出ている4本のケーブルを壁から出ている4種類のワイヤーに連結するだけ。このSmart wall switchはケーブルも少し剥いてあったりして良心的。緑(Gnd)を緑とからめてスクリューキャップにねじ込んでネジネジして、引っ張って抜けないことを確認する。白いニュートラルは、付いているスクリューキャップを外して、巻き込まれている電線を少し戻して、Smart wall switchから出ている白いケーブルを巻き込んで再度スクリューキャップをネジネジする。\n\nSmart wall switchには「Lin(黒)」と「Lout(茶)」というケーブルが出ているので、LinをLineと、LoutをLoadと、ネジネジしてつなぐ。このあとスイッチボックスの中にぎゅうぎゅうに押し込むので、押し込んでいる途中で抜けないように引っ張って確認する。\n\n![ケーブル接続完了](/images/cables-connected.png)\n\nこの状態でブレーカーをあげて電気を通し、スイッチを押してみてクロゼットの電灯のOn/Offを確認する。緊張の一瞬。問題なくうまく行った。再度ブレーカーを下げて電気を切り、なるべくうまいことケーブルとSmart wall switch本体をスイッチボックスに押し込む。あとはねじ止めしてパネルをはめ込めば完成。\n\n## セットアップ\n\nHomekitでアクセサリとして登録するために、まずiPadを2.4GhzのWifiにつなぐ。うちにはApple TVやHomepodはないので、iPadをHomekitのハブにする設定も行った。それからSmart wall switch本体に書いてあるHomekit接続用のコードを入力する。最初なんだか失敗して焦ったが、同じことをもう一度やったら登録できた。あとはHomeアプリでタップすれば電灯をOn/Offできる。\n\nAndroid用にはMerossのアプリがあって、これを使うとHomekitではできない機能（On後指定された時間がたったら自動的にOffにするとか）を使えるようになるのだが、ユーザー登録が必要で、「ローカルで完結」のポリシーに反する。反するが、ファームウェアのアップデートやなんかにも必要になるっぽいので、仕方なく捨てAndroidタブレットに捨てメールアドレスでアカウントを作った。\n\n## まとめ\n\n事前にある程度まで調べてから買ったこともあって、取り付けやセットアップは概ね問題なくできた。\n\nしかし実は本命はクロゼットの電灯ではなく別のことにあるので、さっそく同じSmart wall switchをもう1つ購入した。続く。"},{"frontmatter":{"slug":"/blog/green-card-2018-2021-11-2","date":"Sun, 21 Nov 2021 21:20:41 GMT","title":"米国永住権（グリーンカード）取得顛末記 <2018-2021>","epoch":"1637529641","excerpt":"ごく普通の日本人ソフトウェアエンジニアが就労ビザで米国に渡って8年、とうとう永住権を取得するまでの長くて読み応えのない感想文です。","ogImage":"/images/gc.jpg"},"markdownBody":"\n## 最初にお断り\n\nこの文章は自分で後で振り返って懐かしむために書いた、永住権取得顛末の覚書です。長くて読みづらいです。短めなまとめは[米国永住権（グリーンカード）を取得した <2018-2021>](/blog/green-card-2018-2021-11-1)に書きました。\n\n## 始まりの章\n\n2018年6月1日。会社でFounding Partnerの1人に呼び出され、1:1をした。H-1Bビザの残り期限を考えて、今後も米国で暮らし続ける気があるなら永住権の申請をした方がよいという助言を弁護士から受けたということで、その意思確認をしてくれた。2017年の8月から働き始めた会社だったので、なんというか1年経ったら恐る恐る話を切り出してみようかなあと思っていた矢先に会社の方から来てくれたので、とても嬉しいサプライズだった。\n\nもちろんイエスよろしくお願いしますと返答して28日後、法律事務所のパラリーガルからPERMに関する質問書が届く。速攻で返事を出す。...。\n\n8月10日、パラリーガルから質問書への返答を催促するメールが届く。なんと、元のメールへのReply-toにはパラリーガルやCCされていた他の法律事務所関係者だけが一切入っておらず、会社でCCされていた人だけに返信されていたことが判明する。To欄を確認しなかったこちらのミスとはいえ、何このシステム。まずここで丸々1ヶ月無駄にした。\n\n8月17日、前社のCEOにお願いして、Employment Verification Letterにサインをしてもらう。これまでも何度か、その時点での「前社」の社長にビザ関係の書類へのサインをお願いすることがあった。これを読んでいる皆さんの中でこれからH-1Bビザを取ったりグリーンカードを取ろうと思っている人がいたら、会社をやめるときはなるべく円満にした方がよい。\n\nそして何も音沙汰なく2ヶ月が経った10月22日、パラリーガルからメールが来て「95 days windows starts this week」。PERMの手続きが始まる。24日にはニューヨーク州のJob Bankで募集が掲載されていることを確認できた。\n\n年をまたいで2019年2月22日、PERM提出の連絡。2月25日に受領確認。弁護士の話では、PERMの結論がくるのは6月ごろだろうということだった。\n\n## PERM完了、I-140の章\n\n2019年6月5日、会社にETA 9089の承認通知が届く。打診から1年。これでやっとグリーンカードへの手順が始まる。6月7日、パラリーガルからI-140の文書を作成するためのシステムへのアクセスコードが届く。Inszoomという名前の、入力しづらく、入力ミスをしやすく、入力ミスしたことを発見しづらいXXXXXXXなシステム。これに何度か足をすくわれることになる。\n\nとにかく速攻ですべてをその日のうちに入力して提出する。提出した後で、I-485は出さないのか聞いてみたところ、「The I-140 is the second step and the I-485 is the third step of the green card. While you can submit concurrently, we have found that it is better to submit separately.」という、他では聞いたことがない説明をされた。他の日本人ソフトウェアエンジニアの方々の記録を読むと、大体皆さん同時申請しているように見えるんだが、会社が契約している法律事務所だし、どうしようもない。\n\n2019年7月3日、I-140の申請を受領した旨の通知を受け取る。\n\n同日にI-485の手続きも始まる。このときになって、出生証明と婚姻証明が必要であることを知らされる。日本人は両方とも戸籍謄本で代替できるのだが、英語に訳す必要がある。急遽日本にいる家族に連絡して市区役所から取り寄せてもらう。さすが日本の役所はこちらに比べてはるかに仕事が早く、申請を（家族が日本国内で）速達で出して2、3日で返信がきたので、それをさらにEMSで送ってもらう。この件は調べておこうと思えば調べておけたので、自分が悪かった...のかもしれないが、I-485を出すことになるのは昨年の時点でわかっていたのだから、手続きのプロたるパラリーガルさんが先に教えてくれればいいじゃないかとも思う。自分の場合、離婚歴もあるので、その日時と証明も必要になった。\n\n日本からの書類入手のドタバタの渦中でさらに追い討ちをかける連絡が来たのが7月11日。グリーンカードの申請が8月以降バックログ送りになることが政府から発表されたので、なんとしてでも7月末までに提出したい。書類を揃えろ、という話。これまでのんびりしていたのはこちらではなくそちらなんですが、とキレたところでそれをしないと不利益を被るのはこちらだけなので、キレの悪い何かをグッと飲み込む。\n\n2019年7月12日、I-140が無事に通る。Classification sought == E31 == EB-3。\n\n## InszoomというXXシステム\n\n7月15日。パラリーガルから、日本からの書類がまだ来ていなくてもいいからデータの入力を始めろというメールが来る。これまでのやりとりからこのパラリーガルに不信感を抱きはじめていたこともあり、「それをすると、すべてのデータを入力完了できていない状態でシステムのSubmitボタンを押すことになる。このシステムはSubmitしたらそれ以降データを追加更新することができないので、欠けているデータは別途送り、書類はDropboxで送ることになる。つまり情報が一箇所にまとまっていない状態になるのだが、それでもそれをやるべきなのか。」と確認。それに対する返事は「Yes please」のtwo wordsのみ。悪い予感は後で現実のものとなる。\n\nInszoomというこのシステムでは、書類の入力項目をセクションごとに入力して次へ、次のセクションを入力してまた次へ、と進めるようになっているのだが、大きな罠がある。入力できない項目を入力できないまま先へ進み、後で入力内容を見直すときに「View」モードで見直していると、本当は入力しなければならないのに未入力になっている項目は、項目の存在すら表示してくれなくなる。そのため、Viewモードでセクションを次へ、また次へと進んでいくと、未入力項目はないように見えてしまう。自分の名前とか必須であることが自明なものは忘れないだろうが、親の旧姓や親の出生国などの自明とは言い難い項目を飛ばしていると、後で見直してもそれを入力していないことがViewモードではわからない。同じ内容を入力する所が3、4ヶ所ある場合も珍しくないので、1ヶ所抜けていた、ということが起こりやすい。平たくいってXXXXXXXシステムである。\n\n7月16日。とにかくこの時点で入力できる項目は入力し、入力できない項目は空欄でSubmitし、手元にある書類についてはスキャンしてアップロードした。会社にスキャナがあって助かったが、パスポートの全ページをスキャンするのはめんどくさかった。そして、めんどくせーと思いながらだらだらやっていたこの作業も後で問題になる。\n\n余談だが、このとき満洲国の英語表記をググったせいで、一時期YouTubeのレコメンに満洲国関連の動画がたくさん出てきて勉強になった。\n\n## Crunch time\n\n同日中にパラリーガルから、両親の出生地などの「a lot of information」が抜けているという連絡が来る。抜けていた情報について、項目ごとに別々のテキストファイルにして、Dropboxのフォルダへ入れ、そのリンクを送る。するとパラリーガルから「フォルダって何？使い方がわからない」という返事。ZIPにしてDropboxに入れ直そうとした直後に「ああわかったわかった」と連絡。ため息というか怒りというか。\n\n7月17日、パラリーガルから両親の情報が抜けていると再度連絡がある。が、その情報はすでに送ってあって、向こうが見落としていただけだった。初めてじゃないだろうに、なんだかやけに慌てていてこちらへの指示も要領を得ないものが多くてイライラする。\n\n同日、また連絡があり、パスポートに入国のスタンプがないという指摘。これはこちらのミスで、何冊かあるパスポートのファイルのうち最新のものではないものを送ってしまっていたことが判明する。7月末までに！と急に言われてこちらも慌てている上にめんどくせーと思いながら作業していたことが裏目に出た。\n\nそしてこの時点でパラリーガルは完全にキレてしまった。まずメールで「話したいからいいときに電話してくれ」と送ってきて、それを見て電話をかけようと思った次の瞬間に電話が鳴り、向こうがかけてきた。電話口での彼女は怒り心頭で、こちらがいかにnot being careful enoughで、今はcrunch timeであり、フォームのすべてのフィールドへ入力しなければsubmitできないのにa lot of informationが入っていない、を何度も言い方を変えてがなり立てていた。\n\n上記したとおり、すべてのフィールドへ入力できないことは指摘済みだし、careful enoughでないのはお互いさまだし、crunch timeなのは誰のせいでもない（もっとも、何も進まずに2ヶ月経ったりしていたのはどっちのせいだったのか、って話はあるけども）ので、一方的にがなり立ててきたその態度にはかなり腹もたったのだが、そこでこれらを冷静に指摘して「はい論破」とか言ったところで問題は何も解決しない。あまりの（的外れな）剣幕に途中から逆に面白くなってきてしまったこともあって、何も反応せずに無音で、やっと黙るまで待っていた。黙ったところで、Inszoomはもう一度入力できる状態にはできないのか聞いたところ、向こうもそれが言いたかったらしく、向こうで再オープンしてやり直すことになった。結果的に一から入力し直しになったが、まあ仕方ない。この再入力の過程でようやく、Viewではなく常にEditを選択すべきだというInszoomのキモを理解した。Viewでは入力しなかったフィールドは表示されないし、必須入力かどうかの区別もないに等しい（これはシステムのせいというよりは書式のせいだが）。\n\nとどめなのかなんなのか、こちらのI-94がWebで確認できないので、そっちで確認してInszoomへアップロードしろと言ってきたが、これもパスポート番号と日付を知っていてWebで見られないことはないので、めんどくさいのかやり方を知らないのか、なんかの制裁のつもりなのか、とにかくこのパラリーガルはヤバイ、という結論に達した。\n\nしかしヤバかろうがなんだろうが、後2週間で書類をすべて整えて、原本を送るべきものはニューヨークからカリフォルニア（にある法律事務所）へ送らなければならないのである。前半の何も起こらない期間と中盤のこのドタバタ。こういうのを均等に分散できないのが一番嫌なことなんだが、誰に文句を言っても仕方ないこの弱い立場。\n\n7月18日、Inszoomにすべての項目を入力し、電子書類もすべてInszoomにアップロードしてsubmitする。Dropboxは使わない。とにかくこのパラリーガルの使えなさ加減に合わせるしかない。しかしこれでもまだ罠は次々と待ち構えているのだった。\n\n\n## しょっぱすぎる塩対応\n\n7月19日、パラリーガルから提出書類のドラフトがPDFで届く。見てびっくり。ある種の番号がそれを入れるところではない項目に入っていたり、名前ではない項目に名前が入っていたり、スキップしていいあらゆる場所にN/Aが入っていたりと、内容がひどい。こちらに送ってくる前に一度確認、などということはしないのだな、とため息。\n\nさらにおかしなことに、I-131のドラフトが完全に空白になっていた。上記の細かい誤りを箇条書きですべて指摘し、合わせてI-131について聞くつもりで「I-13**0**が空白なんだけど」とメールで送ってところ、返事が「huh? You don't need to submit I-130. Are you even looking at the right email?」いや、I-13**0**はこちらの間違いだよそりゃ。だけどさ、I-13**0**は提出しっこないんだよ、EB（雇用に基づく申請。I-130は親戚関係に基づくグリーンカードに関する書類）なんだから。普通のプロフェッショナルからのこの状況での返信として期待されるのは「I-130はこの件には無関係だからたぶんI-131のことだと思うけど、今見てみたら確かにI-131が空白ですね。もう1回送り直します」ですよね。\n\n改めてこちらから「すみません、私のタイポでした。I-131のことです。」と返信をすると、今度は手動で出したらしいPDFを添付してきて「Can you see this?」とだけ。パラリーガルとしてどうかはともかく、この手の輩は人間として嫌いだ。こちらのタイポと、そっちの空白のドラフトを確認しろといって送ってくることと、どっちが「すみません」に値するミスだったんだ？\n\n7月19日は金曜日だったので、午後いっぱいと土曜日の午前中をかけて文書の内容をじっくり確認し、おかしな項目をすべて洗い出して、これでもかというくらいどのページのどこの項目がどうおかしいかを箇条書きにし、テキストファイルとして添付してメールで送ったのが土曜日の午後。\n\n## 突然のクソ翻訳\n\n出生、離婚、婚姻はすべて日本で行われているので証明書類は当然日本語で書かれている。これらは提出するときに英訳を添付しなければならない。\n\n領事館のホームページへ行くと、「グリーンカードの申請などで必要となる場合用の」英文の婚姻証明や出生証明を発行してくれると書いてあるので、これを取りに領事館へ出向いた。必要書類の確認のなかで、英訳を領事館からもらってくるから少し時間がかかるよ、とパラリーガルに連絡してあった。もちろん返事はなかったが。そうして領事館で書類を出してもらい、それをスキャンして提出書類の一部に含めて送ってあった。\n\n7月22日、パラリーガルが突如として戸籍謄本の英訳と称するものを送ってきた。中身を確認しろという。ここでも「領事館のサインと印章が入っている翻訳書類をすでに送ってあるだろうが」という返信をしたかったのだが、そのメールを送って返事が1日こなかったりすると致命的に思えた。もう言い合いをする時間はない。罵声を心の中で撒き散らしつつ、翻訳に目を通す。\n\nこの翻訳が盛大に誤っているのは当たり前なのだ。戸籍謄本には両親の名前に読み仮名がないので、普通でない読み方をする漢字を、まして明らかにネイティブ日本人ではない人がアルファベットにするのは無理なのだ。このやり方が今までうまく行っていたとは信じられないので、日本人を扱ったことがないのだろうとここでようやく気づいた。この法律事務所は今の会社の立ち上げより前からFounding Partnerの1人が懇意にしていて使っているらしいのでそんなわけはないと思いたいのだが、そう思わざるを得ない。\n\n罵声を堪えに堪えて父母の名前のアルファベットを訂正して送る。するとそれに対する返信として、こんなのが来る。\n\n「Page 2とPage 3は同じだから翻訳しません」。戸籍謄本は１ページしかない。\n\n意味不明なのだが、こちらは意識が高いのでこう返信する。\n\n「I am pretty sure what you are talking about are our marriage cert and the birth certs. The document certifies both of the facts, so we don't need to translate the same document twice. We just need to submit the same document for three different purposes which may have been confusing for you. That was precisely why I prepared translations of all of the documents signed by the consulate and had submitted them via Inszoom」。\n\nこれに対するパラリーガルからの返信。\n\n「Translator insists that document 2 and 3 don't have to be translated. Do you disagree?」\n\nお前、俺の返信読んでないよな。読んでないんだろ？俺が提出した書類が何だったのか把握してないんだよな？同じ文書を2回翻訳する必要はないが、同じ文書を3種類の目的で利用することになるのだ、って書いてあるだろ？いやあ、まいった。毎日毎日どうしてこんな思いをしなければならないのか。ミソスープでフェイスをウォッシュしてからカムツーミーアゲインしろよ。こういうことも想像できるから別々の書面になる領事館発行の翻訳を出したんだよ。XXXXXXXXがぁ。\n\nこちらからは上記とほぼ同じ内容（ミソスープのじゃなくて、こちらから送ったメール文のこと）を再度返信。これに対してはもはや返信が来なかった。無視。無視！すげえ。\n\nこれは後々になって知ったことなのだが、領事館の英訳による証明はオリジナルである戸籍謄本の抜粋を訳したものと見なされて、出生や婚姻の証明として機能しないらしい。領事館では、彼らは使えると思っているが実際には使えない書類を有料で発行していることになる。それはそれとして、パラリーガルさん。それをするから少し時間がかかるよってメールに対して、「それは無駄だからオリジナルだけ送ってこい」となぜ言ってくれなかったのか。今になって思うが、メールの出し方返信の仕方にすげえ細かいルールをつけてきていたのは、メールを日常的に読み落としている人だという意味だったのだろう。パラリーガルってそんなんでもできる仕事なんだ。\n\n## medical exam\n\nまだ用意できていない提出書類がもう1つあって、それがI-693、いわゆる健康診断。必要なワクチンを接種しているかをチェックする他、一般的な健康診断をする。それをして書類に記入できる医師は決まっていて、civil surgeonと呼ばれ、そこで書類を記入してもらわないといけない。\n\n7月18日の時点で、civil surgeonでmedical examを予約しておけと指示された。こちらはこれについてそこそこの知識があって、medical examの結果は1年有効だが1年以内に面接になる保証がないことは知っているので、「今すぐ？」と聞いておいたのだが、答えは「yes, go ahead」。7月23日の予約が取れた。\n\nワクチンの接種履歴が必要で、日本人の場合は母子手帳ということになるのだが、当然原本は実家にある。これも7月18日の時点で急遽親に連絡して、EMSで送ってもらっていて、なんと間に合ったのである。もちろん内容の翻訳は自分でするしかない。妻が翻訳をしつつ、このmedical examで必要になると思われる医療用語の対訳表を作ってくれていた。これがマジで役に立った。看護師にいろいろ聞かれたのだが、この表がなかったらわからなかったというか毎度毎度Google translateすることになっていてめんどくさかっただろう。\n\nただまあ結果としては、ワクチンはあらためて接種することになった。それと血液検査が必要で、クリニックで血液を採取してラボに送り、結果が返ってきてから改めて医師が書類に記入するので、その場では書類は出ない。1週間後にこちらから電話して状況を確認することになった。\n\n## 必要書類を法律事務所へ送りだす\n\n7月末日期限でカリフォルニアから書類をUSCISオフィスに送る必要があり、書類にはニューヨークにいる自分たちの署名が必要である以上、7月23日という日はほぼほぼギリギリの締め切り日といっていいが、パラリーガルからは最終的な書類をいつこちらに送ってくるのかの連絡は一切ない。ただなんとなく今日中（7/23）に文書がきそうな気がしていたので、medical examを受けたその足で妻をオフィスに連れて行き、もし文書が届いたら印刷して内容を確認して署名してFedExで発送するという作業を終えることにした。これは我ながらめちゃくちゃgood callだった。\n\n549pmにようやく、しかし予想通り、書類がメールで届く。カリフォルニアでは3時のおやつの前くらいのイメージなんだろう。こっちがニューヨークにいるということは知ってはいるが、知ったこっちゃないのだろう。別にバックログ扱いになってしまったって受け取る報酬が減るわけじゃないんだし。いい商売ですね。\n\n会社のオフィスマネージャーに少し残業をお願いして、書類を印刷し、深呼吸しながら最終確認をして、署名をし、FedExの封筒に封をして、オフィスマネージャーがover night扱いで（$200近くするのだ！）発送してくれた。640pm。\n\nオフィスを出てはたと気づく。写真を入れ忘れた！決められたサイズの写真を同封しなければならなくて、カバンに入れて持って行ったのに、封筒にいれるのを忘れた！仕方なくFedExに行って自前で写真だけをover nightで送った。はあー、慌てるとこういうことになるのである。慌てたのは自分のせいではあるが、ここまでの道のりを考えると、こんなギリギリになってしまっているのは自分のせいじゃない、と思いたくもなる。\n\n救いはFedExで処理してくれた人がエラいフレンドリーで心温まったこと。8pm閉店で730pmくらいに入店したので、もうやる気ない感じなんだろうなあと思って負けないように心を強く持って入っていったんだが、すごい親切で拍子抜けしてなんかほっとしてしまった。ストックホルムだけども、洞窟に閉じ込められて息苦しいみたいな状況からのあの対応は本当に、突然外に出られてきれいな空気を吸えたような気分だった。\n\n## 書類は期限までに提出されたのか？\n\n7月25日、FedExのサイトで荷物が配達済みであることを確認して、1つだけ後日提出で残っていた書類について、翻訳をどうするかメールで確認する。パラリーガルは、「Dropboxで送れ」。送った。書類の提出云々について何も報告なし。\n\n7月26日（金曜日）、何も連絡なし。\n\n7月29日（月曜日）医者に電話。まだ結果が来ていないので明日かけ直すようにとのこと。しかし午後になって向こうから電話が来て、結果が届いたのでオフィスに来て欲しい、あと妻のA-numberが欠けているけどいいのか、と。5pmのアポを取る。\n\n同日、パラリーガルにどうなっているのかメールで聞いてみる。するとなんと、out of officeの自動返信が届く。唖然。仕方なくパラリーガルのボスである弁護士にA-numberの件と、この状況でOOOってなんなのどうなってんの、とメールで聞いてみる。ちょっとしてから返信が来て、A-numberはまだないのでナシでOK。OOOの件、あとそもそも文書は期限までに提出されたのかについては返事なし。\n\n医者のオフィスでMMRワクチンを打って、medical examの結果を入手。この先生とオフィスの看護師や事務の人もみんな親切ないい感じでよかった。BrooklynはWilliamsburgのNY Family DocsのDr. Muracaです。\n\n7月30日、何も連絡なし。\n\n7月31日、何も連絡なし。帰宅後に再度弁護士にメールで、文書は提出したのか、あとこのmedical examの封筒はどうするのか聞く。返事は「Yes we did」。medical examの封筒は送ってよこせということで、またFedExで送ることになった。\n\n## そしてミスはまだまだ続く\n\n提出した以上あとは向こうの処理が始まるのを待つだけ...と思っていた8月20日、I-797C Notice of Actionが届く。自分のI-485、I-131、I-765は受領。priority dateはFeb 25 2019、received Jul 29 2019。しかし妻のapplicationはいずれもrejected。理由は「Application Typeの記載がない」。弁護士に即メールで確認。弁護士にもそれは届いており、彼女がいうにはきちんと記載がされている（チェックボックスにチェックを入れるだけ）ので、「re-file」するだけだが、それをできるのは10月1日以降になる、ということだった。\n\n正直ここまでの一連のやりとりから、あっちのミスであってもそれをまったく認める気配がないことがわかっているので、これも何が本当だったのかわからないが、とにかく10月1日という日付を早める手段がない以上、泣き寝入りである。あんだけ急いで急いでここまで来て、そのチェックボックスとやらのせいで意味がなかったのである。refileすればいいとかいう一言で済むんだこれ。結果に責任を負わない上に過程についてもずいぶんプロらしくない仕事っぷりですが、ずいぶんお気楽なお仕事ですね。\n\n## 手続き開始\n\n8月27日、申請者の指紋を取る手続きの呼び出し状を受け取る。\n\n9月4日、呼び出し通りに、マンハッタンのUSCIS事務所まで出向く。携帯持ち込み禁止と書いてあるので持っていかなかったのだが、実際にはみんな待ち時間に携帯をいじっている。1pmのアポで1235pmに着いたのだが、10分くらいですぐに受け付けられてさっさと終わった。\n\n待っているとき隣に座っていた中国系と思われるおばあちゃんに話しかけられて、手に持っている書類の種類が違うことを聞いているような感じだったので、「中国語はわからないけど、あなたは市民権の申請で私は永住権の申請だから書類が違うのではないでしょうか」と英語で言ってみたんだけど、中国人じゃないならいいや、って感じで会話は終わってしまった。\n\n9月30日、**初めて弁護士の方から連絡が来て**、妻の書類の再提出分を発送した旨の連絡があった。ここで**初めて**弁護士の方からこういう連絡が来たのには理由がある。後述。\n\n10月21日、自分の分のI-131とI-765のapproval noticeが届く。\n\n10月22日、USCISのWebサイトで自分のI-485のステータスを確認したところ、「Ready to schedule an interview」になっていた。\n\n10月23日、自分の分のEADカードが届く。\n\n10月26日、妻の分の書類の受領通知到着。\n\n11月2日、妻の指紋採取の呼び出し状。11月13日。\n\n11月13日、妻の指紋採取完了。\n\n\n## H-1B更新\n\n12月11日、会社と弁護士が協議したらしく、この時点で自分のH-1Bの期限が2019年2月までであることを憂慮して、EADは出たものの、念のためH-1Bの更新をすることになった。このとき初めて知ったのだが、I-140が通っていてI-485を待っている間は、同じ会社がスポンサーとなってH-1Bを、6年を超えて延長できる、らしい（IANAL）。\n\n12月27日、弁護士から妻のH-4のためのI-539とG-28が届く。内容を確認すると、1ヶ所補足情報を書かなければならないところが抜けていたので指摘する（こういう抜けってどこでも普通にあることなんですかね）。すぐに修正版が届いたので確認し、FedExで印刷して発送する。弁護士には1月2日までに届くはずと連絡しておく。年末年始は大して休まないこの国万歳である。\n\n毎年年末年始は日本に戻っていたのだが、妻のAPが通っておらず、I-94は延長されているもののビザが有効なのかどうかよくわからないこの状況で再入国できなかった場合に困ったことになるので、出国は見送った。2020年になった。\n\n1月2日、会社あてに自分のH-1Bの書類が届く。内容を確認した。\n\n1月24日、会社あてにH-1Bの申請受領通知が届く。\n\n1月25日、妻のH-4の申請受領通知が自宅に届く。この通知の内容に誤りがあり、COB（Country of birth）がなぜかIndiaになっていた。弁護士に連絡するとUSCISが直すから放っておけとのこと。これもどっちがミスしているのかわからない。\n\n同日に妻の指紋採取の呼び出し状が届く。ついこないだ取ったばかりなのになんで？だが、グリーンカードのための指紋とH-4の指紋は別物で、H-4申請者は毎回指紋採取に呼び出されるらしい。これ、その後バイデン政権になって法律が変わったという話も聞いたのだがよくわからない。\n\n2月4日、妻の指紋採取完了。\n\nこのH-1B更新手続きは、2019年4月23日にapproveされ、4月29日に通知書が弁護士に届いた。\n\nなお妻のH-4は6月6日にapproveされた。\n\n## 手続き中断\n\n1月8日、妻のI-131とI-765がapproved。\n\n2月25日の時点でWebサイトによると2人とも「ready to schedule an interview」となっていて、ここからが長いとはいえ...と少し楽観的になってきていた。しかしその矢先の3月18日、USCISは対面の面接をすべて停止した。当初の期限は4月1日となっていたが、ご承知の通りそんな楽観的すぎる設定はまったく現実的ではなかった。\n\n4月2日、Webサイトを再度チェックしてみると、「We canceled the interview scheduled for your Form I-485」の文字が。多分実際にはスケジュールされていなかっただろうと思うけども、がっかりする。\n\n## パラリーガルのこと\n\nところで、手続き開始当初から担当してくれていたパラリーガルの人。前述の通りなんとも折り合いが悪くて、こちらの慌てからくるミスもあったにせよ、「いや、そういう素人たる我々がやらかすいろんなことを正しく導くのがあなたの仕事なのでは」と思ったし、あちらはあちらで同じようなケアレスミスをやらかすし、しかもこちらに対してキレ散らかしてくるのがどうも嫌だった。\n\nある日、会社でのFounding Partnerの1人との1:1でこの法律事務所の話になり、別にいいんだけどさあ、もう少しこうなってくれててもいいよねえ ha ha ha というノリで上記のような話を伝えたところ、「なんだそれ、詳しく説明してくれ」と身を乗り出される。\n\nいや、例えばこういうことがあって、I-130はこっちのタイポだし、違う方のパスポートのスキャンを送ったのもこっちのミスなんだけど、それに対してキレなくてもよくて、これこれがいつまでに必要でそのためにはこういう作業をこの日までにしてくれないと困る、というように言ってくれればいいなあと思うんだけど、パラリーガルさんはそういう内容をわざわざ全部大文字で太字、または赤字、または下線、またはこの全部をふんだんに使って送ってきてなんか怒鳴られてる感があるし、実際にこないだ電話で怒鳴られたんだよね。なんか最初からさ、メールはすべてこちらのものにReplyで送ってこいって言ってきて、あるときそれまでの流れとは違う主題のことを聞きたかったのでこちらからメールを送ったらReplyじゃないのを送ってくるな！って赤字で太字で大文字で返信がきたりしたしさあ、いやなんか変なルールだよねえ、そのくせ自分はReplyだったり新しくスレッドを作ったりするんだよ、なんだかねえ、と説明した。\n\n顔を見ながら話しているのでその変わりっぷりのすごいことにちょっと引くくらいだったんだが、話を聞いていたFounding Partnerはだんだんと顔を赤くして怒りをあらわにしていった。「うちの会社で一番大事にしていることは、クライアントとの間でのmutual respectで、それをしてくれないところとは仕事をしないというのが、設立時のFounding Partner同士の約束だった。それは業務と直接関係ないこういうことでの外部取引先にも当てはまる。話を聞く限り、そのパラリーガルの態度は受け入れられない。たまたま上司である先方の弁護士とミーティングが設定されているので、今の話を裏付けるようなメールを含めて、時系列でまとめた文書を作ってくれ」と。彼はいつも温厚で会社のお父さん的立場で外からの攻撃から会社や社員を守ってくれている感がある人で、こんなに怒っているのは後にも先にもこのときしか見たことがない。本当に引くというか、こっちのノリとのギャップもあってウルウルしてしまった。\n\nその後、そのパラリーガルからの連絡は2度となくなり、しばらくの間は上司たる弁護士からの直接の連絡が来るようになった。Founding Partnerからも、「いろいろ話したし、この時点で担当者を変えるデメリットも考慮したが、結論としては彼女はもうお前を担当しない。それでいいよな」と言われ、はい、ありがとうございます。あなたに一生ついていきます。と返事をした。\n\nそういうわけでそれ以降は突然、弁護士本人から今までにはなかったような「向こうからの報連相」が来るようになったのだった。しばらくの間だけだったけども。たぶん小うるさい客認定されたんだろうと思う。\n\n## EAD更新手続き開始\n\n6月18日、EADの期限が10月なので更新手続きが始まる。\n\n6月25日、I-131とG-28に署名する。パスポート写真が必要ということで、6月29日にCVSで撮影してFedExで送る。\n\n7月7日、EAD/APの書類を提出した旨、以前とは違うパラリーガルから連絡が来る。\n\n7月22日、EAD/APの申請受領の連絡。\n\nその後何も起きないまま1年が過ぎるとはその時は想像していなかったのであった。\n\n## H-1B更新その2\n\n12月1日、ここまでEADもグリーンカードも何も連絡がないので、H-1Bが2月に切れたら働けなくなるのでどうにかしませんかと、会社と弁護士にメール。会社側は即更新手続きに入ることに同意してくれて本当にありがたい。弁護士からこないだと同じ書類が送られてくる。\n\n12月2日、H-1BとH-4の書類を両方とも入力してsubmitする。ここまでくるとInszoomにも慣れたものである。\n\n2020年末。今度は本当にAPがない、ビザの状況も相変わらずよくわからない、それにまあパンデミックだし、ってことで2年連続年末年始はステイホーム。\n\n1月7日、妻のH-4の申請のため、自分の給与明細が必要ということで送る。\n\n1月14日、H-1B申請\n\n1月19日、H-1B申請受領通知\n\n1月21日、H-1B 更新 approved\n\n2月21日、前述の通りH-4は指紋が必要なので呼び出しがくる。\n\n3月8日、妻の指紋採取完了\n\n5月26日。5月も終ろうかという日、申請受領から2ヶ月半たってようやく妻のH-4 approved。まあ日々の生活に影響はない（I-485申請待ちの状態であれば不法滞在にはならない）けども、この処理の長さからして他の書類の処理はどうなるのであろうかと。\n\n今でも疑問なのが、この延長申請の承認通知を読むと、I-94が更新されたのであってビザが更新されたわけではないように読める気がすること。この時点でEADと同時申請しているAdvanced Paroleがまだpendingなので、国外に出たら再入国できなさそうな気がして仕方ないのだ。不法滞在ではないだけで、いったん出たらもう入れないことになるような。以前にAPで再入国することのリスク評価を聞いてみたときに「不安ならやめれば？」と言われて「その返事なら司法試験通ってなくてもできるよねえ」と思って以来、そういうのをこの弁護士に聞くのはめんどくさいだけってことになっていたし、どうせCOVID-19で国外には出られないこともあって、このI-140ベースで更新されているH-1B/H-4は再入国時に使えるビザの有効期限が更新されているという意味なのかどうか、結局わかっていない。\n\n## そして手続き再開\n\n7月14日、2人のI-485に関する Request for evidence RFE が来る。自分についてはmedical examの提出と、会社の社名が変わっているためそれに関する問合せ。妻についてはmedical examの提出と、婚姻が偽装でないことを示す証拠を可能な限り用意しろという内容。\n\nすぐに用意できるものとして、\n\n- 2014年以降2020年までの納税をjointで行っているのでその書類\n- 保険証。両者の名前が入っているので、妻がdependentであることの傍証になるかもしれない\n- bank statement。それぞれ別の銀行だが住所が同じなので同じ場所に住んでいることの傍証になるかもしれない\n\nを掲示したが、弁護士はそれらにプラスして、「2人のことをよく知る人物の署名が入った宣誓供述書（affidavit）」を求めてきた。サンプルも送られてきたのだが、ネットで調べるとサンプルの内容よりもはるかに細かく書いてあるものが多い。結婚後の数年以上に渡って2人を両方ともよく知っていて、こういうのを気軽に頼める友人などいないので、一通は会社で一番妻を知っているであろうオフィスマネージャーにお願いし、もう一通は英語ペラペラでニューヨークにも来たことがあり、日本でも妻と一緒に会ったことが何度もある大学時代の友人に頼んだ。大学時代の友人の方は書類を印刷して署名してスキャンするという作業をなかなかやりづらい環境であっただろうに、きっちり翌日にやってくれて助かった。持つべきは友人である。\n\n余談だがこっちではアパートを借りるときにもこの手の「知り合いからの推薦状」を求めてくることがあり、こういうのを気軽に頼める友人がいないこの状況は本当に悩ましい。会社の人に頼めばみんなやってくれると思うけど、なんか会社の人に頼むのは違うような気がしていつも逡巡する。結局他にいなくて頼んでしまうんだけど。\n\n## medical exam again\n\nI-485と一緒に提出しないといけないmedical examの書類すなわちI-693は有効期限が1年間なので、前回数百ドル払って受診して得た書類は無駄になってしまった。まあ弁護士的には1年以上面接の呼び出しが来ないことは予想外だったのだろう。こればっかりは誰を責めるわけにもいかない。\n\n7月15日。前回と同じcivil surgeonに電話してアポを取ってみると、7/29と言われる。しかし、今回のRFEには8/9までに提出しろという期限（そこまでに提出しないとグリーンカードの申請を取り下げたとみなされる）が切られており、上記の通り受診してから1週間くらいして書類が準備できるので、7/29に受診だと厳しい。それを伝えると先方（医師ではなく事務担当の電話口の人ね）も心得たもので「それじゃ無理だね、うーん、ちょっと先生に聞いてみて午後に電話します」。\n\n午後4時まで待ってみたが電話が来ないので、こちらからかける。同じ人が出て、「あーハイハイ、ちょっと今聞いてくる」...、しばらくして、「2年前に受けた人だからデータがあるしということで、20日に電話で問診します。それなら7月末までには書類ができるからいいでしょ」はい。大丈夫です。\n\n7月20日、電話がかかってくる。個人認証的なやりとりをして、その後健康に問題はないか、ワクチンは...あー前回全部接種したのね、じゃあ大丈夫、よしok。「ところでさ、今年は日本のゴルフ界すごいね。松山とあとアマの女子も勝ったよね」え？唐突にゴルフの話？「あ、はい、あーゴルフお好きなんですね、ええ、日本でも盛り上がってました。やっぱマスターズは特別ですからね」とか話を合わせる。\n\n続けて「じゃあ血液検査のリクエストを入れたから、ラボに行って検査してきて。そして結果が来たら書類を作って、こっちから連絡するから。今日行けば月曜日にはできると思うよ」。\n\n2年前は（今思えば）血液採取自体は病院でやって、それを病院がラボに送って結果をもらって、とやっていたので、血液検査のラボから請求が来てなんじゃこりゃって驚いた。しかし今回は自分でラボに行って血を取るところからやってこいと、また違うことになって、え？え？ど、どこに行くの？行くだけでいいのアポ取るの？え？結果は自分でもらって来いってこと？え？え？としどろもどろになってしまった。\n\n結論としては医師の側から提携先のラボへオンラインで自分の個人データとなんの検査かの依頼が飛んでいて、そのラボのWebでアポを取り、出向いて名前と生年月日を言えば、血を取られて（あと尿検査もあった）、終了。検査の結果はオンラインで医師のもとに送られることになる。\n\nこのラボのオフィスが近くに2ヶ所あって、歩いて行ける方のWebを見てみたら今日は予約スロットが1つしか空いてない。あとは明後日に1つだけ。でも説明を読むとwalk inでも行けるって書いてあって、朝10時以降が空いているとまで書いてある。なので、10時すぎに歩いて行ってみた。しかし、結果は「walk inはやってない」「Webでやってるって書いてあるじゃん」「今の状況ではwalk inは受けられないんだ。Webは更新してないんだろうな」あるあるだね、あるある。sigh。\n\n家に帰って、近くのもう1ヶ所の方をWebで見てみるとその日の13時からの枠が2つ空いていた。予約を入れてCiti Bikeに乗って現地へ出かけた。今度は受付はスムーズだったのだが、血液だけではなく尿検査も必要であることをここで言われて、しかも前回トイレに行ってから30分は経ってないとダメだと。基本出かける前にはトイレに行く習慣をつけているので（そこいらへんにトイレはないこの街では必須の習慣）、30分オフィスで待ってから尿を出す必要があった。まあ30分後に出たのでよかったのだが、時間は多少無駄にはなった。\n\n7月26日。medical examの書類は予定通り月曜日にできた。連絡が来たのでクリニックへ出向き、身長体重、血圧と血中酸素濃度を測り、その後2年ぶりに会う医師と問診。今回はオリンピックか？と思ったら案の定オリンピック、に出る松山選手の話になった。しかしその会話は前回同様二言三言で終わるのであった。\n\n思うにあの雑談は、こちらが英語で会話ができるのかどうか、あとなんらかの精神的な障害を負っていないかどうかを確認する手段だったのではないんだろうか。本当にただのゴルフ好きなんだろうか。よくわからないが、2年経っても変わらずいい先生といいスタッフだった。\n\nI-693の書類を入手して、その足でFedExのover night便でカリフォルニアの法律事務所へ発送したのだった。法律事務所では他の書類と合わせて提出物を作成したら再度ブルックリンへ送るのだから無駄なことこの上ないのであるが、仕方ない。\n\n7/29日。書類が届いた旨の連絡が来た。その他の証拠文書はDropboxでリンクを送ってある。宣誓供述書のお願いに快く、すばやく対応してくれた友に感謝。\n\n## 塩対応は続くよどこまでも\n\n7月29日の連絡が来た時点で、もうここまで来たらあとは米国からWelcomeかGoodbyeのどちらかを言われるだけであろうと思っていた。ここまでお読みいただいた方の中には、まだ面接があるだろうと思っている方も多いと思うが、RFEが来た時点での弁護士からのメールに曰く「このRFEはgood newsで、I can tell that the officer is going to waive the interview」とあったのだ。この際面接があろうがなかろうがどっちでもよかったのだが、まあこのご時世（2021年8月現在、COVID-19デルタ株蔓延中、銃撃事件や地下鉄内での暴力事件多発中）にマンハッタンまで出かけるのはいやだし、なければない方がよいのだろう、とこの時点では思っていた。\n\nその後法律事務所から何も連絡がなく、USCISのWebのステータスもInterview Cancelledから変更がないまま2週間が経過。どうせあの事務所のことだから8月9日の期限ギリに間に合うように提出していて、その期限になってしばらくしてから処理がされるんだろうから、まあ8月末に結果が出れば早い方かなあとか思っていた。\n\n8月13日金曜日。弁護士からメールが来る。「このご時世なので、あなたの分についても60日間の期限延長が許されました。さて、ドキュメントがまだ足りません。RFEに書いてある例の中で、他に提出できる書類を出してください。とにかく2014年にまでさかのぼって2人が婚姻状態にあることを示す必要があります」。え？え？え？え？え？いや、足りないのなら足りないことは7月29日にわかってたでしょ？提出期限が延長されたのはいいけどさ、どうして7月29日の時点（から1週間以内とか）でそれをこっちに言ってこないわけ？\n\nそんなわけないと思って、RFEに返答したらさらなるRFEが来たんだと思って何度もメールを読み返したが、どう読んでもそうではない。提出していないのだ。いや提出していない理由は内容が足りないからなんだろうけど、だったらなぜ早くそれを言ってくれないんだろう。あーここまで来て、これでもまだこういうパンチを食らうのか。今度は本当に終わったはずとまた期待レベルを上げてしまい、蜘蛛の糸はあっさりプッチンと切られた。\n\nもっと書類を、例えば2014年以前にjointで開設した銀行口座や、2014年からずっとdependantである健康保険の証明、それと結婚式の写真はどうか、などと言われても、ないものはない。2014年から毎年更新されている健康保険証（2人の名前入り）のプラスティックカードを全部取っておいてあったのでそれを並べた写真を撮ってみるが、カード自体には別に2014年から使っていると書いてあるわけではないし、健康保険のWebサイトに行ってみても2014年からcoverageがあることの証明をダウンロードできる様子もない。\n\n大体EBでI-485を申請している人たちの記事を読んでも、面接での婚姻の証明につまづいたという話は見ないし、面接が通ればすぐさま承認される感じなので、面接してくれた方がよかった気がしてくる。とかブツブツ文句を言ったところで意味がないので、健康保険証カードの写真、唯一あった結婚記念食事会の集合写真（の写真）、2015年に妻が診療を受けたときのEOB（少なくとも2015年時点でその健康保険を持っていた証明にはなるかと思って）の3点をDropboxに入れて送る。\n\n8月16日月曜日。これから30日後にまた「あとこれとこれを出せ」とか言われて、60日の延長をフルに使われるのは本当に願い下げなので、「他にできることがあったら今教えてくれ。30日経ってから、まだこれとこれができたのに、って思いたくない」というメールを送った。弁護士からは「wedding photoがあればideal」だと返信があり、例によってこの返信はDropboxの中身をまだみていなくて親族の集合写真を送ったことを認知していないのか、それともいわゆる結婚式の写真が欲しいという意味なのか判断がつかない。「family photoはDropboxに入れた。tuxedo and dressのphotoのことを言っているんだったらそういう写真は撮っていない」と、意識の高い返信を送る。返事は「Ok -thanks」。いや、忙しいんでしょうね、きっと。すいませんねかまってちゃんみたいで。\n\n8月17日。弁護士から「We are all set to file the response」というメールが来る。最後に現住所を再確認させてくれ、そこにgreen cardが届くから、という楽天的な内容。現住所をconfirmした。今度こそは本当に結論が出るだろうか。まだ期待してはいけないだろうか。\n\n## Crunch time again\n\n9月3日、Labor Dayを控えた金曜日。緊急全社ミーティングが招集された。内容は、会社が結構financially strugglingでコストカットが必要な状況にあること、人件費が最も高いコストであることから、おそらくはヘッドカウントを減らさざるを得ないという状態であることが告げられる。自分が働いている立場は、この会社では未来への投資といえば聞こえはいいが売り上げに直結していない部署であることは間違いなく、減らすならここでしょ、と会社の誰もが思っている場所なので、戦々恐々である。この段階でレイオフされたら、EBなGCの申請は一体どうなるんだろうか。どうなるんだっていうかEmployment BasedのEmploymentがなくなるんだから取り下げになるに決まってるのである。あー奇跡が起きて明日承認されないかしら。\n\n9月13日月曜日。週例の全社ミーティングにて数人がレイオフされたことを知る。今現在行っているプロジェクトのメンバーも含まれているし、そもそも小さい会社なのでみんな知っているし、なんというか悲しい。自分はレイオフされなかったのだが、正直レイオフされた人たちも残った人たちも、なんで？って感想だったんじゃないかなあと思う。なんといってもコストセンターで売り上げを出していない部門で、他のプロジェクトをヘルプしに行くこともほとんどない自分のようなやつが真っ先に対象になるんではないかと。しかしならなかった。半分くらいは安堵したが半分くらいはなんというか罪悪感のようなものが残る。\n\n16日の木曜日、自宅のすぐ近くのビアガーデン的な場所で送別会をすることになって、罪悪感を抱えて参加する。想像よりははるかに明るく前向きな雰囲気だったが、それもどこまでが本当に前向きなことなのかはわからない。「Fumiakiのグリーンカードの手続きはどうなってんの？」と唐突に聞かれて、「多分final stretchにいると思う」と答えたんだが、この唐突な質問も自分には「なんでお前は残っているんだ。GCが必要な、コストだけが余計にかかるお前が」と聞こえてしまう。いや、そんな暗い雰囲気は一切なかったし、そもそもここのメンバーはみんな、他人と自分の不幸の度合いを比べるような人間じゃないのはわかってるんだけども。\n\nそうして、9月は過ぎて行った。8月19日前後に提出したんだから9月19日前後には結果が出るんじゃないのかなあ、という期待はもちろん裏切られた。裏切られたといっても、こちらが勝手にした期待なんだから誰も裏切り行為を働いたわけではない。\n\n## ニュースはある朝突然に\n\n9月29日。なんとなく毎日チェックしているUSCISのWebサイトを今日もチェックした。表示されるのは毎日決まってInterview CancelledというH1なのはわかってるけど、\n\nあ\n\n「Case Was Approved」\n\nえ。マジか。番号をチェックしてもう一度入れる。「Case Was Approved」。EADの申請の番号を入れてみる。「Case Closed Benefit Received By Other Means」。APの申請の番号を入れてみる。「Case Closed Benefit Received By Other Means」。\n\n俺のI-485は承認されたみたい。\n\nいやいや、カードが届くまでは油断しないぞ。カードが届かないとか届いたカードの写真がどう見ても自分じゃないとかあるかもしれないじゃないか。\n\n妻の方はまだ「Interview Cancelled」のままなのだし。\n\n自分のカードは10月3日に届いた。自分の写真が貼ってあった。\n\n## 第四コーナー\n\n9月30日。弁護士からメールで、あなたのGreen Cardは承認されましたという連絡が来る（知ってた）。加えて、妻の分はまだ保留中で、USCISの担当官から留守電が入っていて、処理にはある書類が必要だということだったのでそれらはFedExで送った。27日に配達されたことは確認しているが、留守電には連絡先の情報が入っていなかったのでこちらから連絡できない。留守電ではUSCISのオフィスが入っているビルへ行って、担当官に宛てて書類をことづけろと言っているが、それをしたいですか？と。\n\nどうも内容が読み取りづらいので、「つまり、書類が届いてから1週間くらいは様子を見てあげるか、それとも今すぐ処理して欲しいから届いているはずの書類をもう一度持っていきたいか、って聞いてるの？だったら今から1週間くらいは待つうちに入らないから待ってみるつもりだけど」と返信した。返事は「I agree. Let's give her another week.」来週には結論が出るかなあ。\n\n1週間経った10月6日。結局何も起こっていないので、弁護士へメールをする。返信に162ページのドキュメントが添付されてきて、「これをUSCISのField Officeへ持っていってOfficer Xxxxへ渡してきて」「162ページ全部？？」「最初の10ページだけ」はぁ。なんで後の往復のやり取りをしないでいいように最初のメールの中で最初の10ページを印刷して持っていけって書いてくれないんだろう。\n\n「USCISのField Officeへ持っていってOfficer Xxxxへ渡す」といっても、相手のフルネーム、性別、オフィスのある場所すらわからない。オフィスが入っているビルはわかるが、階数も部屋番号もわからない。この国のお役所で、こんな状況で文書を持って行って受け取ってもらえるもんだろうか。うだうだ言っていても仕方ないから行ってみるけども。\n\n10月7日木曜日、朝からCiti Bikeを飛ばしてWilliamsburg Bridgeを渡ってダウンタウンのビルへ。ビルに入る前に空港のような検査場があって靴も脱いでチェック。入ったところで、中はただのオフィスビルである。警備のおっちゃんにみんな何かを聞いているので自分も聞いてみるが「名前だけじゃ何もわからんよ。何の用？グリーンカードの？うーんわかんないな」。はぁ。\n\nしばらくエレベーターホールで何かのサインを探して、「USCIS Information 3rd Floor」の板を発見。3階に行ってみる。Informationに入ろうとしたら警備のおっちゃんに止められて、「この書類をDeliverにきた。Brooklyn field office」「8階へ行け」イエッサー。\n\n8階の入り口でまた同じことを告げ、「わからんから中で並んでブースの人に言ってみ」。そしてブースの人と絶望的なやりとりをする。\n\n「弁護士がOfficer Xxxxから留守電を受けて、この文書を持ってこいと言われたので私が持ってきました」\n「Xxxxじゃわからない。オフィス番号とか電話番号とか」\n「何もわからない。留守電にそういう情報はなかった。男か女かもわからない」\n「Xxxxはここに2人いる。男か女かどっち」\n「いやだからわからない。留守電を取ったのは私じゃないので。Receipt Numberとかでどうにかわからないものでしょうか」\n\nここでようやく手元の端末をかしゃかしゃやってみてくれて、「封筒の表にA-numberを書いて。邪魔だからその横のブースで」。\n\n「ペンを貸してください」というと、隣の何もやっていない風な別の係員に「ペンを貸してあげて」と言ってくれた。その係員は、「あ゛ぁ？」というと、ナマケモノもびっくりの速度で振り返り、そのままの速度で引き出しをあけ、そのままの速度でペンを探し、手渡してくれた。「ペンを貸してあげて」から1分。マジで。1分。\n\n封筒にA-numberとReceipt numberと名前を書いて、丁重にペンをお返しし、もう一度隣のブースへ...行こうとしたら既に別の人の処理をしていたので後ろで待つ。他には誰も待っていなくて助かった。\n\n前の人の処理が終わったところで突然さっきのナマケモノがフランス語でめちゃ明るい早口でその人と会話を始めた。知り合いだったのか。そんなに快活な声を出せる人だったのか。てっきりすべての動作に10秒ずつかかるんだと思っていたよ。そりゃあ同胞に対しては優しくするよねえ。同胞でもなんでもない俺のような東洋人に快活にペンを貸す必要なんか1インチもないよね。ははっ\n\n封筒を受け取った係官はホチキスで封筒を止めると「You are good」「Oh, ok, thank you so much for taking care of it」「You are welcome」。\n\nというわけで、文書はBrooklyn field officeには届いた。だが、弁護士から送ったFedExだってBrooklyn field officeには届いているのだ。違いといえば、A-numberを表に書いたかどうかくらいのもんだ。さて、Officer Xxxxのデスクまであの茶封筒は届くのだろうか。家に帰って弁護士に上記の顛末をメールで報告し、弁護士からは「こっちも本当に何の情報もなかった。正式なRFEを出してくれればよかったのにと思っていた」との返事をいただく。なるほど。\n\n## 最後の直線\n\n10月21日。弁護士からメールが来る。前回のアクションから2週間経過しても何も起こっていないということで、弁護士の方から再度FedExでレターを送ってみたいが、前回オフィスで書類を渡したときに何らかの領収記録をもらったかということと、州のCongressional liaisonに陳情して本件を先に進めるように要請してもらうWebフォームをsubmitしたいが、了承してもらえるか、と聞かれる。\n\nReceiptの類は一切もらっていないこと、Congressional liaisonへの陳情はぜひお願いしますという返信をした。ちなみにこのliaisonはこれを書いている2021年10月時点で上院院内総務であるChuck Schumerである。議員のオフィスがUSCISに電話した場合は翌日、メールした場合は30日以内に何らかの回答があるらしい*1。何らかの回答があるというだけで、手続きが早くなったりするわけではない。上院院内総務であるということも関係ないであろう。\n\n*1 https://www.uscis.gov/sites/default/files/document/guides/Congressional-Inquiries-Refresher.pdf の11ページ\n\n最後の直線は東京競馬場より長い。\n\n11月5日。弁護士からメールが来る。Schumer上院議員への陳情の文章を書いたので、妻がサインをしたものをスキャンして送り返せと。文章に書いてあるのは、自分の分の申請が承認されてからこれまでに起こったことを説明して、担当官はcaseをlostしたのではないかとafraidしております、という内容。急いでサインしてスキャンして送り返す。順番に処理していますのでお待ちくださいという型通りの返答が30日後に来るのだろうなと予想している。\n\n最後の直線にある坂道は中山競馬場より勾配が厳しい。\n\n11月12日午前11時。今日も今日とて日課であるUSCISのWebサイトへ妻の分のReceipt Numberを入力してSubmitし、「Interview Cancelled」のままであることを確認する。午後になって、ミーティングの前で少し時間があったので冷やかしに再度USCISのWebサイトで同じことをする。サイトを開いて番号をブラウザの候補から選択してSubmitして書いてある字面を見てCommand-Wを押すまでの一連の流れを指が覚えているので、ものの数秒で完了する...\n\n「New Card Is Being Produced」\n\nえ？番号を間違えたか？こんな状態見たことあったっけ？\n\n再度番号を確認して入力する。「New Card Is Being Produced」。そしてGmailに新着がある。パラリーガルから。「AOS approved」本当に承認されたらしい。Chuck Schumerすげえ（多分関係ない）。\n\n妻のカードはその後11月21日に無事届いた。こうして私たちの3年5ヶ月に渡る永住権取得のプロセスは完了した。\n\n## ゴールそしてスタート\n\nグリーンカード取得プロセスは自分たちの状態を認証してもらうお願いであって、それを得るために自分たちで何かを努力するようなものではない。それを得るために何かをがんばることができない。強いて言えば会社をクビにならないように、また会社が傾かないように、日々の仕事をまじめにやる、ということだけ。だからこそ気長に、何かが起きなくて当たり前、何かが起こってくれたらラッキーくらいのつもりで日々を過ごすのが、精神的に追い詰められないコツなんだろう。でもそこは人間だもの、周囲を見ては「なんでうちだけこんなに時間がかかるんだ」、何かの対応をちょっとしくじっては「なんでこの弁護士はこうなんだ」となってしまう。辛い。辛かった。でもそれももう終わりだ。\n\nありがとうアメリカ合衆国。ありがとうニューヨーク州。ありがとうニューヨーク市。ありがとう弁護士さんとパラリーガルさん。ありがとう会社のみんな。ありがとう前職のみんな。ありがとうレターを描いてくれた友人と会社の同僚。ありがとうChuck Schumer上院議員（のオフィスの人）。\n\nFin"},{"frontmatter":{"slug":"/blog/green-card-2018-2021-11-1","date":"Sun, 21 Nov 2021 21:18:31 GMT","title":"米国永住権（グリーンカード）を取得した <2018-2021>","epoch":"1637529511","excerpt":"ごく普通の日本人ソフトウェアエンジニアが就労ビザで米国に渡って8年、とうとう永住権を取得しました。","ogImage":"/images/gc.jpg"},"markdownBody":"\n先日I-485がapproveされ、とうとうグリーンカードが手元に届いた。アメリカで働き始めて8年、申請プロセスが始まってから3年、やっと。\n\nもっと長い間待っている人がいることは知っているが、それでもやっぱり、はあぁ、やっと。長かった。\n\n先人たちにならい、後に続く人々のために記録を残しておこうと思う。\n\n## 何度も見返した先人たちの記録\n* [2018/2019 米国永住権を取得した](https://hmsk.hatenablog.com/entry/2019/07/29/193529)\n* [米国グリーンカードInterview-体験談](https://yambe2002.hatenablog.com/entry/2019/09/06/061416)\n* [シリコンバレーで働いて永住権を取得するまで <2016-2019年版>](https://medium.com/@ryo1kato/%E3%82%B7%E3%83%AA%E3%82%B3%E3%83%B3%E3%83%90%E3%83%AC%E3%83%BC%E3%81%A7%E5%83%8D%E3%81%84%E3%81%A6%E6%B0%B8%E4%BD%8F%E6%A8%A9%E3%82%92%E5%8F%96%E5%BE%97%E3%81%99%E3%82%8B%E3%81%BE%E3%81%A7-2016-2019%E5%B9%B4%E7%89%88-4d2fbf9c07ac)\n* [How I Got My Green Card](https://blog.keikooda.net/2017/11/04/how-i-got-my-greencard/)\n* [グリーンカード](https://suztomo.hatenablog.com/entry/2018/06/25/084028)\n\nそれと、プロセスの後半で心の健康を保つのに一番役に立ったサイト、[greencardly](http://www.greencardly.com/)。Field Officeごとの日付データを眺めると、自分のものだけが遅れているわけではないことはわかる。週一くらいで見ていると、だんだん自分のものに日付が近づいてきて、そろそろかなあと思ったときに本当にRFEが来た。\n\n## 手続きのタイムライン\n\n以下に時系列をまとめる。何も起きなくて不安な期間を表現するために1ヶ月を1行にした表にしてみた。こうやってみると淡々と手続きが進んだように見えるかもしれないが、実態はもちろんローラーコースターライドだった。それらの感情的な部分や感想文的な備忘録は、後で見返して懐かしむために別途[米国永住権（グリーンカード）取得顛末記 <2018-2021>](/blog/green-card-2018-2021-11-2)としてダラダラと書き殴った。最後の最後で、妻の分の申請が自分のものが承認されてから1ヶ月半後にようやく承認されたのも、そんなことになった人を他に見たことがなかったので、肝を冷やした。\n\n||就労ビザ|永住権|\n|---|---|---||\n|2013/04|L-1Aビザで入国。ニューヨーク市で働き始める。この時点でH-1Bの抽選も通過していた。||\n|2013/10|一度帰国してH-1Bビザに切り替え||\n|2014/04|妻がH-4で入国||\n|2016/10|H-1Bビザを更新||\n|2017/08|[H-1BビザをTransferして転職](/blog/2017-08-08_Achievement-unlocked----------H-1B---------1-2--488f6217c832/)||\n||（ここから1ヶ月1行）||\n|2018/06| |GCへの切り替え手続き開始|\n|2018/07|||\n|2018/08|||\n|2018/09|||\n|2018/10| |NYS Job Bankに自分の職の募集が掲載されていることを確認。|\n|2018/11|||\n|2018/12|||\n|2019/01|||\n|2019/02| |prevailing wage determination入手[PERM申請準備完了](linebreak)|\n|2019/03|||\n|2019/04|||\n|2019/05|||\n|2019/06| |ETA Form 9089承認[I-140申請手続き開始](linebreak)|\n|2019/07| |I-140承認[I-485、I-131、I-765提出](linebreak)|\n|2019/08| |自分の分のI-485、I-131、I-765申請受領通知[妻の分はRejected](linebreak)|\n|2019/09| |USCISに指紋を渡す|\n|2019/10| |妻の分の再申請提出[自分の分のI-131とI-765の承認](linebreak)[自分のI-485が10/9時点でReady to schedule an interviewであることを確認](linebreak)[自分の分のEADカード到着](linebreak)[妻の分のI-485、I-131、I-765申請受領通知](linebreak)|\n|2019/11| |妻、USCISに指紋を渡す|\n|2019/12|H-1Bの延長手続きを開始||\n|2020/01| |妻のEADカード到着[H-4だった妻はここでようやくSSNが割り当てられた。](linebreak)|\n|2020/02|H-4延長のため再度USCISへ出向いて指紋を渡す|USCISのWebサイトにて妻のI-485が2/25時点でReady to schedule an interviewであることを確認||\n|2020/03| |USCISが対面の面接などの業務を短くとも4/1まで停止することを発表|\n|2020/04| |USCISのWebサイトにて、2人のI-485が\"we cancelled the interview scheduled for your Form I-485\"になったことを確認|\n|2020/05|H-1Bの延長手続き(I-129)の承認通知受領。2021/02末まで。||\n|2020/06|H-4の承認通知受領|EAD/APの更新手続き開始|\n|2020/07|||\n|2020/08|||\n|2020/09|||\n|2020/10|||\n|2020/11|||\n|2020/12|||\n|2021/01|H-1B延長申請提出[H-1B延長申請受領通知](linebreak)[H-1B延長承認](linebreak)||\n|2021/02|H-4のため、またしてもUSCISのオフィスへ出向く必要がある旨の通知を受領||\n|2021/03|妻、USCISへ出向いて指紋を渡す（通算3回目）||\n|2021/04|||\n|2021/05|||\n|2021/06|H-4延長承認。期限はもちろん半年後の2月末まで。||\n|2021/07| |2人のI-485に関するRequest for evidence(RFE)が届く。|\n|2021/08| |RFE返信（と思われる）|\n|2021/09| |USCISのWebサイトにて、自分のI-485がCase Was Approvedになったことを確認。妻はまだ。|\n|2021/10| |自分の分のカードが届いた。妻はまだ保留中のまま。|\n|2021/11| |州選出の上院議員のオフィスからUSCISへ妻の件を照会してもらう。[妻のI-485がNew Card Is Being Producedになる。](linebreak)[妻のカードが届いた。](linebreak)|\n\n## 何かアドバイス的なこと\n\n先人たちのアドバイスはすべてその通りなので、他の方々の記事も大いに参考にしていただいた上で。\n\n雇用ベースのグリーンカードの申請をしようかと思っていて、結婚しているパートナーの分も合わせて取得しようと思われている方、結婚してから以降のお二人の婚姻状態をUS国内で証明できるような行動をいますぐ始めることをおすすめします。婚姻状態の証明といっても、日本の戸籍謄本とその翻訳のことではないです。外国の政府の印章がついている文書になど1セントの価値もありません。\n\n具体的には（IANAL）、USの銀行に共同名義の口座を持つ、部屋を借りるとき2人の名前が載っている賃貸契約書を作る、確定申告はJointで行う、健康保険のdependentであるならそれを示す書類をずっと取っておく、などです。これらだけではないですし、これらの有効性も確実ではありませんが、一方でこれらはグリーンカード以外のお役所の申請時にも役立つはずです。特にパートナーがH-4である場合、SSNを持てないせいもあって銀行や賃貸などの書類を全部パートナー（H-1Bの方）の名義にしがちな気がしますが、お2人が生計を一つにしていることを証明できるようにしておくと便利だと思います。結婚式の写真や、結婚後の期間が短い方は結婚以前の交際中の時期からの写真も見繕っておくとよいと言われていますが、私たちの場合は結婚式の家族全体の集合写真を提出しただけで交際中の写真は出していません。\n\n我が家の場合、私が米国にビザで来たのが2013年4月、妻がH-4で来たのが2014年4月でした。RFEで要求された「よい（bona fide）」婚姻状態を示す文書はすべて（弁護士によれば）2014年1月にさかのぼれなければ無効というような扱いでした。2014年時点ですぐにできたはず（なのにしなかった）ことといえば健康保険の状態変更に関する文書を捨てずに取っておくことや共同名義で銀行口座を開くことくらいしか思い当たりませんが、それをしておけば、グリーンカードに限らず[運転免許証を取るときなどにも役立ったはず](/blog/2020-01-11_--------------45d1865c8b3a/)で、知らなかったことが悔やまれます。\n\nその他、あんな書類やこんな書類がなくて困った、日本の親族を巻き込んだ特急対応が必要だったなどのことは、まとまってはいないですが、[米国永住権（グリーンカード）取得顛末記 <2018-2021>](/blog/green-card-2018-2021-11-2)に書きました。\n\n## 短い方の感想文\n\nこれを読んでいる人の中には、今このときに不安の真っ只中という方もいると思います。その不安は出した申請をUSCISが承認してくれない限り静まることはないでしょう。一連のプロセスの中で、ポンポンと迅速に手続きが進む瞬間があって、そこで期待値を上げてしまって、そこからの長い無風状態でかえって不安を増大させてしまう。あるあるです。人間だもの。\n\n自分ではコントロールできないことが、こちらの期待を大幅に下回る感じでしか行われないです。理不尽なことが多々あります。先人たちの多くが書いているとおり、それに対抗する方法は「期待しない」ことしかありません。 「Prepare for the worst, and hope for the best」という言葉もありますが、ここでは以下のQuoteの方がしっくりきます。\n\n> Hope. It is the quintessential human delusion, simultaneously the source of your greatest strength, and greatest weakness\n>\n> -- The Architect of The Matrix\n\nしかし、他人に期待するのはやめましょうで終われるならいいのですが、就労ビザや雇用による永住権の申請については、スポンサーたる会社との関係も重要です。一部の「PERM終わってれば転職し放題ヒャッホウ」な凄腕の方々を除いて、会社が申請期間中に雇用を継続してくれることを、それこそ数年に渡って期待せざるを得ないです(*1)。\n\n自分の場合、2018年という移民全体への風当たりが強い時期に申請手続きが始まって、COVID-19のパンデミックでUSCISが文字通り仕事をしなくなってEAD/APも更新されなくなり、承認済みのI-140に基づいてH-1Bを毎年更新してもらってどうにか過ごす必要がありました。その度にかかる弁護士費用や諸々の手続きは会社の負担になるので、それに見合う成果を上げているのかどうか不安でした。そういう不安を1:1などで口にするたびに「クビなんてことは起こらない、大丈夫」と言い続けてくれた上司たちや会社全体にとても感謝しています。グリーンカードをゲットしたらすぐ転職するってのが普通なようにも見えますが、心情的にそんなことはしづらいくらい恩を感じています。\n\n> *1 PERMが通っていれば、転職先の会社がスポンサーになってくれる限り、会社を変えても手続きが一からやり直しになるわけではないというのは事実でしょうが、EADも更新されずH-1Bの期限も切れている状態の、ラダーの下の方の人をスポンサーする会社がいくつもあるとは思えないです。\n"},{"frontmatter":{"slug":"/blog/2021-10-21-dmv-road-test-astoria-heights-2","date":"Sat, 23 Oct 2021 14:59:52 GMT","title":"ニューヨークで運転免許を取得した","epoch":"1635001192","excerpt":"ニューヨーク州の運転免許を取得できた話"},"markdownBody":"\n[前回](/blog/2021-08-27-dmv-road-test-astoria-heights-1)からの続き。\n\n### 再教習\n\nAstoria Heightsでの試験を8月27日に予約した（してもらった）のだが、日時は10月21日 午後1時。2ヶ月空いてしまった。国際免許もとうに切れていて日本にも戻れないし、運転の練習はできないまま2ヶ月を過ごす。いやまあ会社の人とか誰かに頼めば練習とかさせてもらえたかもしれないけど、[前回](/blog/2021-08-27-dmv-road-test-astoria-heights-1)にも書いた通り、練習不足で危なっかしい運転をしているわけではないんだこっちは。待ってろNew Jersey、It's my life。\n\n10月20日。前と同じくCiti Bikeに乗って待ち合わせ場所へ向かう。前回と同じ教官と、同じプリウスに乗って練習開始。少し離れて交通量が減った場所で一旦止める。教官「で、前回は何が減点されていましたか？」\n\n「それがですねえ...とにかく全部、でした。右折も左折も、縦列駐車も3点ターンも、その他fail to observe、speed、などあらゆる点にチェックが入っていて、かえって参考になりませんでして...」\n\n「その後練習されたんですね」「いえ、車に乗っていません」「え、ああそうですか。じゃあ試験官が試験中どんな様子だったか覚えていますか？」\n\nここで前回に書いた内容を話す。「自分を贔屓目に見ているのはわかっていますし、絶対に何かミスをしていると思いますが、最後ブレーキを踏まれたところだけは本当に、そんなことになる状況ではなかったと思っています。」\n\n「うーん、ここまで来た感じで気になったのはスピードが遅いことくらいで、右折と左折もしましたが問題を感じませんでした。うーん」と、何を練習してもらおうかねえという感じになってしまう。だって問題なく運転できているんだから。問題はスピードが遅いことだっていうんだから。20マイルでSlow downって怒鳴られたあれは何だったのか。\n\n練習としては、最初のときと同様に縦列駐車と3点ターンをまずはおさらい。おさらいと言っても縦列駐車はやっぱり成功率60%みたいな感じで、狭いところ、坂になっているところ、いろんな場面でやらせてもらった。最後に教官の発案で狭いけど目抜き通りでガヤついている道へ行って、判断の練習をしましょうということになった。場所を正確に覚えていないのだが、Astoria Heightsからはだいぶ離れた片側一車線、両側に店が並び、バスも通る道へ。人はひっきりなしに道路へ飛び出してくるし信号はあってないようなもの。Outdoor diningの小屋が道をますます狭くしている中を、それなりに進む。\n\n最終的な教官の助言は「たぶんだけど、右に寄っているのが怖かったんじゃないかな。右側を常に1メートル空けておくことを意識して、試験官を怖がらせないようにすればいいと思う。試験に合格するだろう運転をしていると思えるので、相性が悪かったと思うしかない。そういうことってあるんですよ」。\n\nそもそもキープライトだし、片側一車線の道路で無意味にセンターラインに寄るのは、対向車線から飛び出て来られて運転者である自分に被害が出るリスクが高まるから、無意識に避けている。ただ、知らん運転者の運転でびくついているところにもってきて自分の真横に空間がないと、確かに不安になるだろうとは思った。運転免許試験の教官はこの方しか知らないのだが、この方は説明も的を射ているし、こういう何というか情緒的な話も納得できるように説明してくれる感じで、非常に好感度が高い。[Fuji Driving School](https://www.fujidriving.com/)でAstoria Heightsで試験をするとこの方に当たると思いますが、おすすめできます。ありがたかった。ありがとうございます。\n\n### 天使降臨\n\n翌21日。はあ、嫌な思いをわざわざしに行く日だ、と朝から気が重い。昨日から休暇をもらっているので、会社の連中にもまた落ちたことについてどう話そうかと考えてますます気が重い。\n\n11時半に待ち合わせで11時ごろ到着し、30分ほどcalm downする。落ちたら$1000ドブに捨てるんだなあとか考えてますます落ち込んでいたら、目の前を幼稚園児が15人くらい引率されてやってきた。ああこの辺はこういう場所なのかあと思ってぼーっと見ていたら、中にいた一人の子がこちらを見上げ、可愛らしい満面の笑みで「Hello」と手を振ってきた。うわなんだこれ、天使か、天使って実在するのか、と思った。こちらも慌てて「ハロー、はうあーゆー」と手を振りかえした。別の子もそれを見て「Hello」「ハロー」。なんか引率の先生はブスッとしていたが、天使たちはそのまま通り過ぎて行った。\n\n### 直前練習\n\nこの日も直前練習。縦列駐車に何度か失敗し、アドバイスをいただき、全体としては「合格できる技量は持っていますからあとは落ち着いて」。\n\n「それと、前回と同じ試験官に当たったときは拒否できますから。講習修了証にIDが書いてあるので向こうから聞いてきますから。同じ人でもう一度やる必要はないですからね。」\n\nへえそうなんだ。まあでも人が違ってもどうせ同じ対応されるんでしょうね、どうせ落ちますよ。待ってろNew Jersey、I'll be there for you。\n\n最後に右左折を繰り返して60分弱の練習を終え、運転を交代して試験会場へ、12時半過ぎに到着したところたぶん試験官は昼食休憩でおらず、前に4台ほど待っている状態。持っていったバーをかじって水を飲む。「右の間隔を空ける」「アクションする前にobserveする」をひたすら頭の中で繰り返す。\n\n### 試験本番\n\n1時過ぎ。順番が回ってくる。前回の試験官は見当たらず、違う人になった。「はいじゃああなたは運転席に乗って」付き添いの教官も今回はわかっていて、助手席の側を拭く。試験官が乗り込んできて、「名前と生年月日をどうぞ」「はい今日のテストは右折、左折、縦列駐車、3点ターンをします」「準備ができたらスタートしてください」\n\nこの時点ですでに雰囲気が全然違った。まず「これはお前だな？」とか言ってタブレットに映っている写真を見せてきたりしない。窓を全開にしろとも言わない。何というか、ピリピリ感がない。こちらの気の持ちようも全然違ったんだろうから客観的では全くないが、それなりに緊張していたけどそれをさらに助長するようなピリピリした雰囲気は、この試験官からは感じなかった。\n\n発進、してすぐに前方に止まっている車の横で縦列駐車。後ろから車が来ていたのでそれをやり過ごして駐車。問題なし。発進。Stop。右折。次の道で右折、と言われたところで、真横のバイクレーンをランナーが走ってきた。優先道路からそうでない道への右折だが、ランナーをやり過ごすために停止。やり過ごしてから右折。pull overして3点ターン。開始して反対車線に首を突っ込んだところで、こちら車線へ車が来る。ちょっと迷って、反対車線にギリギリまで首を突っ込んで通してあげる。ここで試験官に「You don't have to do that. They will stop if they can't go.」と言われる。\n\nもうこちらは避ける意思を示したので、向こうは通り過ぎる。すると後ろにもう1台きていたが、向こうは止まったので今度はバックして3点ターンを終了する。試験官はここで「まあcourtesyを示すのは悪いことじゃないけどね」。出て左折して、左折して、左折して「あの黒いバンの後ろに止めて」終了。あれ、なんか早過ぎないか？あれやっぱまずかったのか？と思ったが、また名刺大のカードを渡されて「午後6時以降にここを見てください」「Thank you so much」「You are welcome」で終わった。\n\n教官が来たので助手席へ移動して帰る。「どうでしたか」「なんか終わるの早過ぎませんか？」「いや？そんなことはないと思いますけど」3点ターンのときの出来事を説明し「それならうーんまあ問題ないでしょう。それだけなら取られても-10点だし」「それ以外は今度こそ本当に何もなかったと思います。結果はわかりませんけど」駅で降りて、チップを渡して別れる。\n\nとにかく今回の試験官はやりやすかった。3点ターンのときも、それでにわかに雲行きが怪しくなるという感じはまったくなく、その後も普通に余裕を持って左折とか、前方に車線を塞いでいる車がいるときに「You can go」とか言ってくれた。考えてみると、指示が早いのが大きい。曲がるだいぶ前に曲がると言ってくれるし、曲がった先で3点ターンをするのもあそこの車で、とだいぶ前に言ってくれる。そりゃそうで、こっちは知らない道を自分が行きたい場所でも何でもない場所へ運転させられているわけで、次に何をするかあれくらいの余裕を持って指示してくれなければ対応しようがない。前回の試験官の「はい左折、おいスピード落とせよ、もう通り過ぎたよ」ってあれ、あんなの対応できるわけない。あそこで左折したかったのは俺じゃないんだから。今回の試験官はとにかく敵意みたいなものを感じないし、余裕を持って対応してくれたし、なんかセンターライン寄りに走っておくみたいな謎配慮は全然必要なかった（そもそもそんな狭い道じゃないし）。相性...か。\n\n\n### 結果発表\n\n家に帰ってシャワーをして昼寝して午後6時になったのでサイトにアクセスしてみると結果は不合格。やっぱり、と思って確認すると前回の結果だった。しばらく待ってもう一度アクセスすると今度は合格が表示された。右折のwideで5点引かれていた。3点ターンにまつわる減点はなし。サンクコスト回収。New Jerseyに引っ越さなくてよくなった。Keep the faith。\n\nそういうわけで10万円強かけて無事ニューヨーク州の運転免許を取得できた。8月末からの2ヶ月間はずっと嫌な気分を引きずっていたし、あの日からしばらく夢にみたし、ふとしたときにあのシーンを思い出して胸がギュッとなったし、ニューヨークに来て以来最悪の嫌な体験だった。終わりよければとは言うが、あの体験は忘れられそうにない。二度目の試験官は良かったけど、それも普通以上に素晴らしい対応をしてもらったわけじゃなくて、職務を職務としてこなしてくれていただけだと思う。相性、で片付けるには後味が悪すぎる体験だった。"},{"frontmatter":{"slug":"/blog/js-til-2021-09-03","date":"Fri, 03 Sep 2021 14:03:09 GMT","title":"Custom async iterator in JavaScript","epoch":"1630677789","excerpt":"Today I learned how to implement and use an custom async iterator in JavaScript."},"markdownBody":"\nYou can write an async iterator/generator of your own in JavaScript.\n\nThe motivation behind the idea was that\n\n1. I wanted to call AWS.Comprehend.batchDetectEntities and pass 309 items of texts in an array.\n1. When I did the first time, AWS returned \"Throttoling Exception\". It turned out that the current settings allow only 10 items per second and a \"batch\" call is considered as N calls (number of calls in a batch call) not a call for the quota.\n1. So I thought I would split the array of texts into pieces so each piece has 10 items in it, and call the API over and over with 2 seconds interval.\n\nIt would be something like this:\n\n```\nasync function getPiece(data) {\n    const piece = data.splice(0, Math.min(10, data.length))\n    await new Promise((resolve) => setTimeout(resolve, 2000));\n    return piece\n}\n\nconst data = [ ... ]\n(async () => {\n    const results = []\n    const cloned = [...data]\n    while (cloned.length > 0) {\n        const piece = await getPiece(cloned)\n        const result = await AwsApiCall(piece)\n        results.push(result)\n    }\n    console.log(results)\n})()\n```\n\nIt waits 2 seconds and then pulls out the first 10 items from inputs and calls AWS API with the set of 10 items, process the result and see if there are more inputs.\n\nIt works, but I felt itchy because the content of the inputs or `cloned` at a particular moment was ambiguous from the code. The `getPiece` function modifies the content of `cloned` which is not obvious from the main function, but the main function is relying on the fact that the content would eventually become empty.\n\nThere could be many ways to write cleaner code than this. For example, the number of times the loop in the main function should iterate can be pre-calculated in the main function, thus it's not necessary for the main function to rely on the `getPiece` function to manage the content of inputs.\n\nBut I found it easy to use a generator/iterator here. The similar code could be written like this if we use an async generator:\n\n```\nasync function* dataSplitter(data) {\n    const cloned = [...data]\n    while (cloned.length > 0) {\n        const piece = cloned.splice(0, Math.min(10, cloned.length))\n        await new Promise((resolve) => setTimeout(resolve, 2000));\n        yield piece\n    }\n}\n\nconst data = [ ... ]\n(async () => {\n    const results = []\n    for await (const piece of dataSplitter(data)) {\n        const result = await AwsApiCall(piece)\n        results.push(result)\n    }\n    console.log(results)\n})()\n```\n\nThe `dataSplitter` yields 10 items every 2 seconds until there are no more data, and the main function doesn't have to know how it manages the content of the data. All the main function has to do is to call the AWS API for each piece that the generator yields in the `for await of` loop which was also new to me.\n"},{"frontmatter":{"slug":"/blog/2021-08-27-dmv-road-test-astoria-heights-1","date":"Fri, 27 Aug 2021 18:00:52 GMT","title":"ニューヨークで運転免許取得のための路上試験を受けて落ちた","epoch":"1630087252","excerpt":"ニューヨーク州の運転免許を取得するために、路上試験を受けて落ちた話"},"markdownBody":"\n### 路上試験当日\n\n[前回からの続き](/blog/2021-08-26-driving-lessons-in-nyc)。\n\n[Fuji Driving School](https://www.fujidriving.com/)さんで運転の練習プラス路上試験当日の車両貸し出しと付き添いのパッケージをお願いしていると、路上試験当日も60分前後の直前最終練習をさせてもらえる。そのため、DMVで予約済みの試験開始時間の90分前に待ち合わせ時間が設定されている。\n\n他の大手っぽい教習所兼当日付き添いをしてくれる会社のレビューなどを眺めると、試験当日に数人で1台に便乗していくらしく、「試験時間の3時間前に行かなければならなかった」「自分の試験時間になるまで待たされてイラッとした」などの体験談が出てくる。少なくとも自分の場合は、講習をしていただいた教官がそのまま、同じ車で試験当日も来てくれて、自分一人なので直前練習もさせてもらえたし、他の大手っぽいところと比べてバカ高いお値段でもないので、あれらの体験談が今も事実ならFuji Driving Schoolのシステムの方がはるかに良い。ただ、試験会場に行って周りの様子を見た限り、1台に何人も便乗してきてどんどん乗り換えるみたいなことをしている人はいなかった。これは場所の問題かもしれないし日にちのせいかもしれないし、一般化はできない。\n\n\b閑話休題。前回と前々回の失敗を踏まえて、Citi Bikeを降りてから気分が静まるまでの時間を取るために、30分前に着くように家を出る。さすがに昨日の今日なので道を間違えることはなく、スムーズに到着。汗を拭いて気持ちを落ち着かせる。\n\n直前練習でも特に問題はなく、縦列駐車もスムーズにできて、では、ということで試験場へ。試験場へは教官に運転していってもらうため、ここで助手席に移動する。\n\n### 食事とかトイレとか\n\nところで、練習のときも試験のときもそうだが、その時間中は食事もできないしトイレにも行けない。練習のときは食事したければしてもいいんだろうけども、その時間も当然90分の中にカウントされるだろうから、無駄になる。トイレは緊急ならまあどこかのカフェでコーヒーでも買ってトイレを使わせてもらうことができないわけじゃないだろうが、基本そういうことは考慮されていないので、不安がある方は何がしかの対策を打っておいた方がよい。自分はというと、練習も試験も大体午後イチくらいの時間だったので、家を出る前にナッツを水飴とチョコレートで固めたようなバーを2本食べて食事を済ませたことにしておいた。\n\n### 試験本番\n\n自分の順番が回ってきた。試験官にLearner Permitと5時間講習の修了証を渡すと、次に言われたのが「Wipe them please」何を？は？え？となったら、はぁーって感じで「お前は運転席へ乗れ。おい、付き添いのあんた、拭け」。COVID-19のプロトコルらしく、試験官が座る助手席やシートベルトなどをアルコール除菌しろということだったらしい。そういう風に説明してくれよ、って感じだが、あっちに言わせりゃ日に何度も同じことを言いたくないんだろう。こっちは初めてなんだから、という相手の立場でものを考えることはしてくれない。付き添いの教官にとっても初めてのことだったらしく、困惑していた。\n\n助手席に乗り込んできた試験官はまず「窓を全部全開にしてくれ」。次に氏名と生年月日を確認し、手元のタブレットに映る私の顔写真を見せて「これがお前で間違いないな？」。なんというか、何かなりすましとかの問題でもあったのか、見りゃわかるのになんでそんな聞き方でそんなことを聞く必要が？って感じ。\n\n「この試験では右折、左折、縦列駐車、3点ターンをしてもらいます。準備ができたらスタート」\n\n車通りが切れたのでスタート。即右折。Stopサインで右折。その後また右折。この間ずっと、なんか車の調子が悪いなと思っていた。試験官は仕切りに独り言みたいな音量で「Control the vehicle... Go slow, slow...」と言い続けていたが、Slowと言われても先行車も対向車もいない道路で18-19マイルをうろうろしていて、15まで落とすのか？と思いながらStopで止まった後スタートしようとして、ん？ん？スピードの上がり方がやっぱりなんか今までと違う。\n\n右折してさらに右折後、3点ターンを先にやり、次に縦列駐車。特に問題はなかったと思う。次は確か左折で出て、すぐにまた左折しろと言われ、しかし信号があるわけでもない上に道路は舗装工事中でセンターラインもない状態で、どこが左折できる交差点なのかわからない。すると「Slow down! You missed the turn!」いや、今左折したばかりで10マイルくらいしか出ていなかったのですが...。次に左折できる道を探して15マイル程度で進み、左折できる道を見つけたのでウィンカーを出し、対向車が来ているので交差点に入ったあたりで、車を曲げないように気をつけながら止まり...\n\nここで助手席にあるブレーキを思いっきり踏まれた。「Why were you going? Oncoming traffic \"##\"&#\"($?」え？いやだから止まる直前だったでしょ今。もう2とか3マイルにまで下がってたでしょ。え？今何が起きたの？\n\n頭が真っ白で反論することもできず、対向車が過ぎてからそのまま曲がってスタート地点まで戻る...途中の道でpull overさせられ、試験終了。試験官はそそくさと出て行った。\n\n落ちたということはわかって、釈然としないまま付き添いの教官が戻ってくるまでの間ぼーっとしていてはたと気づいた。あの試験官はどういうわけか、スタート直後からずっと助手席のブレーキを踏んでいたんだと思う。しかも間違えてその上に足を置いていたとかいうことではなく（それなら進み方が全然違うからわかるはず）、自分が運転しているような感じで少し踏んだり離したりを繰り返していたように思う。あの車の違和感はそれだ。教官にその話をしてみたら、「あーその感じは多分そうですね」と。\n\nもちろんこれは自分の側の一方的感想なので、試験官氏にとっては何かダメなポイントが、それも最初の方に、たぶんあったのだろう。あったのだと思いたい。ただ、いくら振り返ってみても、あそこでああすべきだった、ここでこうすべきだったという大きな反省点が見つからない。Vehicle controlが、って言われても知らん間にブレーキを踏まれたり離されたりしたのではどうにもならないし、もちろん一度たりとも20マイルすら超えていない。オートマ車の、Dレンジでブレーキを離せば進むアレがまったくなくなったので、Stop後のスタートで妙に踏まなければならなくて違和感を感じていたくらい。\n\n### 結果発表\n\nどういう理由か定かではないが、一説によると試験官の身の安全を守るため、路上試験の合否はその場では教えてくれなくなった。代わりに名刺大のカードを渡され、そこに書いてあるURLに午後6時以降にアクセスして、DMV IDと生年月日でログインして結果を見るという仕組みになっている。\n\nしょぼーんとしながら家に戻り、午後6時を過ぎて一応結果を確認すると不合格。詳細へ進み、どこで減点されたのかを見てみてびっくり。全部。考えうる全部に減点マークが入っていて、練習不足、と。このシステムがどういうものかわからないが、いくらなんでも右折時のwideとspeedはない。それは絶対ない。むしろ優先道路から右折で非優先の方へ侵入するときに速度が下がり過ぎて一時停止したと思われたかどうかで悩んでいたくらいだし。\n\n正直、この日に起きたことについて、2ヶ月経ってこれを書いている今でも消化できていない。アジア人だと何故か落とす試験官の話とか、検索するとチラホラ出てくるが、そんなわけないだろあっちにとっても失いたくない仕事だろうし、と思っていたけど。そういう話にはしたくないし、自分の側に何らかの不手際があったのは確かなんだろうが、どんなに思い返してみても、最初の方から何かやらかしたってことはなかった。フェアな扱いを受けたとはどうしても思えなかった。\n\n### 再挑戦\n\n一晩寝てもやっぱり消化できなくて、それこそ試験の夢を見て、朝早く目が覚めて、またお金を払ってこの嫌な思いをしに行くのか、もうやめようかとも思った。が、ここまでの座学講習$60と教習パッケージ$559がサンクコストとなって思考に影響する。ミスって落ちた、あるいは落ちたにしてもどこを減点されたのかがわかったならともかく、大したミスも思い当たらず、試験官からのフィードバックは「全部ダメ」ということでは、もう一回受けたって同じ目にあうんじゃないかという気がして、あの場にもう一度行くのが嫌で仕方ない。だがしかし$620のサンクコストである。いや、日本へ帰ったら国際免許取ればいいじゃん誰も問題にしてないみたいだし。いやしかし$620払ったんだし。いいや、来年はNew Jerseyに引っ越そう。NJなら路上試験なしで日本の免許から切り替えできるらしい。Livin' on a prayer。\n\nうじうじと考えた結果、もう一回だけやってみることにして、再度Fuji Driving Schoolさんで試験予約、1回練習、当日付き添いをお願いした。$470。本当にもうこれでやめる。\n\n調整いただいた結果、次の試験は10月21日になった。同じAstoria Heightsで。\n\n[ニューヨークで運転免許を取得した](/blog/2021-10-21-dmv-road-test-astoria-heights-2)へ続く。"},{"frontmatter":{"slug":"/blog/2021-08-26-driving-lessons-in-nyc","date":"Thu, 26 Aug 2021 23:34:52 GMT","title":"ニューヨークで運転免許取得のためのレッスンを受けた","epoch":"1630020892","excerpt":"ニューヨーク州で運転免許を取得するために、90分の教習を2回受講した話"},"markdownBody":"\n### 実技試験を受ける前に\n\n[前回からの続き](/blog/2021-06-13_five-hour-course-drivers-license-ny)。日本で普通自動車運転免許を取るには（ペーパー試験に加えて）警察署で一発実技試験を受けるか、教習所で練習して実技試験免除の認証をもらう。ニューヨーク州では仮免を取って5時間講習を受けたらあとはDMVで実技試験を受けるだけ。しかし自分の場合、普段自動車を運転していない上に右側通行での運転経験もほとんどない。さらに試験の様子や合格のためのテクニックも教えてもらえるということもあり、5時間講習を受けたFuji Driving Schoolさんで90分の講習を2回含んだパックにお金を支払っていた。\n\n### 運転教習1回目\n\n2回の教習の日程は、試験日の1週間前と前日にしてもらっていた。試験会場周辺は一度も行ったことのない場所なので、試験が火曜日に設定されたのでその1週間前の火曜日に教習を入れてもらい、その曜日ならではのトラフィックを体感しておきたかった。それと前日に設定しておけばまあいいんじゃないですか？というアドバイスもいただいたので。\n\n試験会場がQueensのEast River寄りの場所（Astoria Heights）だったので、練習もその近辺でさせてもらえるらしい。待ち合わせ場所へは地下鉄やバスを乗り継いで行くのが面倒だったのでCiti Bikeで向かう。事前に入念にGoogle MapsでTurn by turnのdirectionを暗記し、万全の準備で出発...したつもりだったが、やはり途中で道を間違えて予定より10分ほど多く時間がかかったものの、遅刻ではない。湿気が多くて汗を拭くタオルを持って出なかったことを後悔しつつ、待ち合わせ場所のCVSで水を買い、講師の方の車を待つ。\n\n講師の方は人の良さそうなおじさんで、最近の型のプリウスで来た。おそらくこの車で試験も受けるのだろう。この型のプリウスは日本でも何度も乗っているものの、なんとなくサイズ感がつかめない感じが不安だった。なんせ賞味2時間ほどしか乗っていない車で縦列駐車とかするのである。つらい。\n\n手指消毒などの手順を踏んで車に乗り込み、いきなりここから運転である。Astoriaのさらに外れの住宅街へ進み、レッスン開始。とにかく日本人にありがちな落とし穴を何度も丁寧に教えてくれてとてもよかった。詰め込まれる内容が多くて全部を頭に入れられるわけではないが、同じことを何度も繰り返し、全然嫌な感じでなく教えてくれるので助かる。\n\n教習の時間の大半は、縦列駐車に費やされた。右左折や交差点へ侵入するタイミングについても、縦列駐車できる場所を探して移動しつつ行い、しかしすきあらば縦列駐車である。縦列駐車ができないとこの街では免許をもらえないのである。切り返しも1回まで？縁石に当てたらだめ、縁石から離れすぎていてもだめ。試験なんだから当然だが、しかし苦手なものは苦手である。\n\n90分は結構あっという間に過ぎ、次は1週間後、ということでその日は解散となった。またCiti Bikeにまたがって帰宅する。必要以上に交差点の状況に気を配り、今まであまり確認したことがなかったAll WayとそうでないStopサインの違いなどを見ながら。\n\n### 運転教習2回目...の5日前\n\n1回目の教習を受けてから2日後。グリーンカード申請の件で弁護士から突然の連絡が来る。RFEが来たのでmedical examを受けてこい、期限は8月9日だ、と。詳細は別記事に書いたが、日程調整の結果どうしても路上試験の日にmedical examを受けないとならないことになってしまった。時間はmedical examが午前、路上試験は午後2時ということで、詰め込めばできないことはないかな...と一瞬思ったのだが、いやいやこの国でこの手のものが時間通りに行くことなどあり得ないのだから、と安全側に判断を倒し、試験日の変更をお願いした。\n\n後で決まった試験日は8月後半ということで、結果的に1回目の教習からまるまる1ヶ月空いてしまうことになった。しかしグリーンカードの手続きを期限通りに進めることの方が重要なので、仕方ない。別記事に書いた通り、結果としてこの期限は結局延長されたので路上試験を優先しても大丈夫だったのかもしれないのだが。\n\n### 本当に運転教習2回目\n\n1ヶ月まるまる空いて、路上試験前日の2回目講習である。前回と同じ場所で待ち合わせなので再度Citi Bikeで向かう。前回の反省を踏まえて、上り坂が多いのでe-bikeで行こうと思っていたのに近隣のドックにない。仕方ない、前回よりも時間に余裕を持っているしゆっくりこいでいけばいいか、と家を出た直後に携帯の充電がほぼないことに気づき、慌てて家に戻って妻の携帯を持って出る。あわててCiti Bikeにまたがり、慌てふためきながらこいで前回よりもさらに道に迷う。夏の最後の暑い日で汗だくである。どうにかこうにか待ち合わせ時間ぴったりに到着した。ふう。\n\nそんなこんなでアドレナリンが出まくっていたせいか、初手でインストラクターから「ちょっとハンドルが荒いのでもっとゆっくり、スムーズにしてください」と言われる。うーん、まあそこまでギャンギャンとステアリングを回していたわけではなく、ただ二重駐車が両側にあったのを避けつつなるべく自分の車線に戻ろうとしていただけなんだが、まあまあと自分で深呼吸して気持ちを落ち着かせる。\n\nこの日は試験をやっていないようだということで、まずテストのスタート地点へ行ってテストコースになりそうなところをさっと周回した。この辺で縦列駐車をやりがち、この辺はスクールゾーンなので速度超過に気をつけて、など。\n\nその後は前回もぐるぐる回った場所へ行って、縦列駐車の練習。まあなんだろう、15回くらいやってOKが9回、ちょっと離れすぎ3回、NG3回くらいな感じだった。NGの直後はうまく行く傾向があるんだが、なんせ試験では1回しかできないのでこれはもうなんというか、がんばるしかない。\n\n3ポイントターンと普通の右左折、一時停止やAll way stopなどを一通り回り、これは問題ないですねーと言われた。一般論として右折時にワイド、左折時にショートしがちなので本番では曲がり始めに気をつけよう、など。\n\n90分の練習が終わり、いよいよ翌日は本番の試験である。せいぜい15分くらいの運転で70点くらい取れれば（つまり減点を30点以内に抑えれば）よいのである。よいのであるが、これをすると一発で15点減点みたいなのもたくさんあるので、実質的にミスは1回までである。試験官によっては英語が聞きづらいみたいな人もいるらしく、聞き返すとやる気をなくしてあっという間に不合格にされるみたいな話も聞くので、どうせ落ちるよ俺は運というものがついた試しがないんだから、と自分に言い聞かせる。\n\n[試験当日へ続く](/blog/2021-08-27-dmv-road-test-astoria-heights-1)。\n\n"},{"frontmatter":{"slug":"/blog/2021-06-13_five-hour-course-drivers-license-ny","date":"Sun, 13 Jun 2021 22:49:20 GMT","title":"ニューヨークで運転免許取得へ動き出した","epoch":"1623624560","excerpt":"ニューヨーク州で運転免許を取得するための次のフェーズ、5時間講習を受講した話"},"markdownBody":"\n### 5時間講習を受けた\n\n[前回からの続き](/blog/2020-01-11_--------------45d1865c8b3a)。ニューヨーク州で普通自動車の運転免許を取るためには、仮免の交付を受けた後でまずは安全運転のための講習を受けなくてはならない。これを通称5時間講習という。\n\n### 仮免取ってからパンデミック中\n\n今思えばパンデミックで何もできなくなる寸前の2019年末、重い腰を上げて普通自動車の仮免を取った。当時の思惑は第一に財布に入るIDが欲しいということで、それ以外にはまあ今後車で出かける熱が高まったときに免許を取ろうと思うかもなあ、程度だった。\n\nそして2020年。3月からオフィスは閉鎖され、ひたすらWFHの日々である。週末に地下鉄に乗ってマンハッタンに行くことも憚られるニューヨーク市内の蔓延っぷり。元々引きこもり体質ではあるので、自分自身は土日どころか2週間以上アパートのドアから先に足を踏み出さない生活をしていても苦にはなっていなかった気がする（なおアパートはワンルーム）が、とはいえたまに外に出て散歩する程度でずいぶん気分が変わることも発見して、やはりこんな生活は長くは続けられないなあと思いつつ、だからって出かけられないので家にいた、2020年。\n\n[姉妹都市になって60周年を迎えた東京都](https://www.kateigaho.com/travel/74816/)とは大きく違い、ニューヨーク市の蔓延っぷりは酷かったこと、当時の大統領のホームタウンだったことや政治力のある街だったこと、などいろいろあって、2021年に入ってワクチンが承認されたとたん、すごい勢いで接種が行われた。結果、2021年の現大統領の宣言にあった7月4日を待たずにいろんなことが解除され、ほぼ普通の生活をしてよいことになったのが6月なかばのこと。\n\n### 自家用車に乗れる便利さ\n\nしかし実は会社の同僚など周囲を見渡すと、昨年中から結構みなさんお出かけをしていた。さすがこちらの人はメンタルが強いのか弱いのか、我慢できないだけなのか、みなさんリベラルだし科学的な判断を降せる人たちだけども、パンデミックな中でも、「週末は何してた？」「うん、アップステイトでAirBnBで友達とパーティした」みたいな会話が行われる。ドン引きしている自分の方が普通じゃない感じだった。\n\nそこでしかし気づいたのは、車で同居家族と出かけてAirBnBして庭でBBQして帰ってくるみたいな行動は、普段から会っていない人と会うことがほとんどないので、感染リスクも低いよねってこと。これが公共交通機関に乗ってレストランで食事という行動とは全然違う。鍵は車で行くかどうか。\n\n運転免許があったらなー気分が高まる。\n\n### めんどくさいこと\n\n普通は仮免を取ったらすぐに本免へむけて動くんだろうけど、当時は必要性をあまり感じていなかくて、とにかくめんどくさいという気分が上回っていたので自分は何もしていなかった。\n\nめんどくさいと感じていた理由は3点。\n\n1. 本免許を受けるための路上試験を受けるためには、まず座学の安全運転講習を受けなくてはならない。5時間。教室で。\n1. 路上試験の予約が取りづらい。ウンヶ月先まで予約でいっぱいとか。\n1. 路上試験を受ける車は自分で用意しなければならない。なおその車を運転して路上試験会場まで行くには運転免許証が必要。なので、自分以外の運転できる人と、運転していい車を用意しなくてはならない。\n\nこれだけめんどくさいことがあったらめんどくさいでしょう。ってことでめんどくさかった。\n\nが、時は来た。\n\nパンデミック中のどこかのタイミングで、5時間講習がZoomでオンラインでやってよいことになったのである。教室で拘束されるよりは100倍めんどくさくない。\n\nその他2点は変わらないのだけど、最初にしなければならないことが少しだけめんどくさくなくなったせいで、がぜんやっちゃおうかな気分が出てきた。それと、おそらくWFHが1年をすぎて、自分のメンタルも相当やられているというか、旅行に行きたいんだ！いい加減にどっか行きたいんだ！しかしビザの関係で国外には出られないんだ！国内で出かけたかったら車があるのとないのとでは大違いなんだ！1年以上日本に行ってないから国際免許もないし[*1]()！\n\n*1 なお、ニューヨーク州では、[州内に「居住している」人がいわゆる国際免許で車を運転するのは不法行為と認識される可能性がある](https://nytrafficticket.com/may-i-drive-in-new-york-with-an-international-or-foreign-license/)。周囲の日本人のみなさんでこれを気にしている人に一人たりとも会ったことがないのでおそらく運用上問題になったことがないんだろうけども。これはもしかしたら日本人の特権で、見た目がラテン系だったりすると気をつけなければならないことなのかもしれない。\n\nというわけで時が来たので、5時間講習の申し込みから始めることにした。\n\n### 5時間講習をどこで受けるか\n\nオンライン5時間講習はいろんな教習所で開催されていて、価格も中央値も平均値も$50くらい。調べていてわかったのは、5時間講習を受けた教習所で教師ありトレーニングを受けて、路上試験の予約をしてもらって、当日も車と教師に付き添ってもらうというパッケージを買うのが自然ということ。路上試験会場へ行く車と運転者を用意するというめんどくさい点を金で解決し、DMVのサイトで予約というダルい作業も丸投げできるというか、金で買うというか。\n\nで、そういうパッケージには、試験に向けてのアドバイスと練習をしてくれるいわゆる教習所の機能ももちろんあって、全然運転していない自分としてはまあ練習しておきたい。そうなると今度は練習の日程を予約しなければならないわけで、これがダルいってことになる。少し安いところの練習日程表を見ても、結構予約でいっぱいで、これを探して取るのがダルい。\n\n結果、ニューヨーク州で運転免許を取りたい日本人なら誰でも知ってる[Fuji Driving School](https://www.fujidrivingschool.com/)さんでやることにした。講習を日本語で受けたいと思っていたわけでもないんだけど、5時間講習から路上試験予約、で予約できた日時に合わせて（なるべく直前に）2回の練習をしたい、というこちらの要望を伝えるだけであとは全部やってくれて、一度書いた内容を何度も伝え直すこっちのサービスあるあるなダルさは一切なし。ちょっとお高めなんだろうけども、こっちは丸一年分のお出かけ予算がダブついてるんだから、と自分に言い聞かせ、ともすれば「めんどくさいからやっぱりやめた」となりがちな自分の心を自分のお金で殴って、5時間講習を予約した。\n\n### 5時間講習の受験とその後の手続き\n\n5時間講習は土曜日の朝10時から。途中5分休憩を2回とお昼休憩30分1回を挟みつつ、15時には終わった。途中でインターネット回線が切れて焦ったが数分で復旧してことなきを得る。\n\n講習受講前に、すでにメールで講習受講後に返信する内容として、練習するか、路上試験の予約代行をするか、当日の付き添いは、などの内容のアンケートが来ていたので、家の近くの路上試験会場の希望と、日時はそこそこ融通がきくのでなるべく早めに、あと試験日の直近で2回練習したい、できれば試験日と同じ曜日に、という希望を伝えた。上に書いたあるあるで、こっちのサービスって何かとこういう「Aは1でBは1か2、Cは3、Bが1ならDも希望」みたいなのをまとめて伝えると、返信が来て「Aです。Bはどうしますか」という返信が来がちでダルいことが多いんだけど、簡潔に完璧にこちらの希望をこなしていただきました。感謝。これに少し高いかもという値段に見合う価値があると思うかどうかは人それぞれだけど、私はおすすめします。\n\n[Fuji Driving School](https://www.fujidrivingschool.com/)\n\n路上試験は6週間ほど先に決まった。続く。\n\n"},{"frontmatter":{"slug":"/blog/20201122-bt-toggle","date":"Sun, 22 Nov 2020 16:43:23 GMT","title":"Android quick settings tile that [dis]connects a Bluetooth headset","epoch":"1606063403","excerpt":"I wrote a simple Android app in Kotlin for the first time in months for myself to get used to the current Kotlin development again"},"markdownBody":"\n## Motivation\nI stopped writing code for Android and for iOS sometime ago because my job doesn't need them at the moment. I started to feel wary of my not being able to write code for apps as well and as spontaneous as I used to be. I needed to write code in my spare time.\n\n## Contributing code to an open source project\nI think I first heard about [Signal](https://github.com/signalapp) a few years ago but it caught my attention again lately when I read a story or two about the situation in Hong Kong. I went to check it out and found it is being built open source and pull requests are being merged from time to time.\n\nSince then I am looking at its code regularly, both iOS and Android and submitted a handful of pull requests. Some of them are merged which felt good.\n\nBut it's not my code. I won't submit a pull request to Signal written in Kotlin because I am pretty sure that it doesn't help the project. If I think about my next job interview, I believe I should be able to write Android apps in Kotlin, smoothly. It requires a practice. So let's practice.\n\n## The three virtues of a good programmer\nI was looking for a topic to write code for; you know, [the three virtues of a good programmer](http://threevirtues.com/). I found one; I am using Sony WI-1000x Bluetooth headset every day and quite a few times I have been having to disconnect it from my phone to connect it to my laptop, and the other way around.\n\nThe problem is that in order to disconnect a headset from Android **without killing Bluetooth** (the Covid-19 app needs it being turned on), you have multiple steps to do. A few times a day. Annoying.\n\n![Disconnect a headset from an Android phone](/videos/disconnect-1.mp4)\n\n![Connect a headset to an Android phone](/videos/connect-1.mp4)\n\n## App requirements\n\nThese are the requirements that I had in mind while I was writing the app:\n\n* A quick settings tile that allows you to connect and to disconnect simply by tapping the quick settings icon\n* The app remembers the device to connect and to disconnect\n* You can select a device for the app to remember in a simple list UI\n* Don't turn off Bluetooth itself; connect/disconnect only the specific device\n\nAlso, these are the non-feature requirements, that are the reasons why I wanted to write code of the app:\n\n* Use Kotlin\n* Use Kotlin Coroutine for async operations\n* Use AndroidX ViewModel\n* May not use a DI framework but make the modules as friendly as possible to write automated tests\n* i.e. Avoid fat activity\n\n## Coding highlights\n\nI found a few interesting points while writing the app.\n\n### 1. Both A2DP and HEADSET had to be disconnected to disconnect the headset\n\nI am not sure if it is with WI-1000x or it is the way for all Bluetooth headphones, but I found that you can connect to the headset by calling `connect` method only to the HEADSET profile, but [you must call `disconnect` method both to HEADSET profile and to A2DP profile](https://github.com/fumiakiy/BTToggle/blob/4780b091fc754040e14e96bb3c34d7fecb48c80d/app/src/main/java/com/luckypines/android/bttoggle/AndroidBluetoothAdapter.kt#L94-L113) in order to disconnect the headphones from the phone.\n\nBecause the code to receive a profile object is done asynchronously, I ended up writing code like this ([more code here](https://github.com/fumiakiy/BTToggle/blob/4780b091fc754040e14e96bb3c34d7fecb48c80d/app/src/main/java/com/luckypines/android/bttoggle/AndroidBluetoothAdapter.kt#L19-L55)) below to wait for both profiles before moving on to allow the app to intereact with the headphone. I feel there must be a better way of writing this type of *wait all events to happen before moving on* kind of code like `Promise.all` in JavaScript but wasn't able to find it atm.\n\n```\nsuspend fun onReady() {\n    coroutineScope {\n      while (true) {\n        delay(1000L)\n        if (headsetProxy != null && a2dpProxy != null) break\n      }\n    }\n  }\n```\n\n### 2. You must release the profile objects before leaving\n\nAndroid Studio was kind enough to let me know that the profile objects are leaking when I implemented the [TileService](https://developer.android.com/reference/android/service/quicksettings/TileService) for the app. I was kind of wondering the necessity of doing it but it was not obvious when I was writing the [Activity](https://github.com/fumiakiy/BTToggle/blob/4780b091fc754040e14e96bb3c34d7fecb48c80d/app/src/main/java/com/luckypines/android/bttoggle/MainActivity.kt) for the app.\n\nBut surely you need to [clear profile objects](https://github.com/fumiakiy/BTToggle/blob/4780b091fc754040e14e96bb3c34d7fecb48c80d/app/src/main/java/com/luckypines/android/bttoggle/AndroidBluetoothAdapter.kt#L115-L118) before [you leave](https://github.com/fumiakiy/BTToggle/blob/4780b091fc754040e14e96bb3c34d7fecb48c80d/app/src/main/java/com/luckypines/android/bttoggle/MainTileService.kt#L21-L39).\n\n### 3. You cannot [dis]connect Bluetooth headphones by Android SDK\n\n!!! Surprise! I wasn't able to find a simple and easy way to connect or to disconnect the headphones in Android SDK. Well there may be one, but simple web searching and browsing SDK website did not show me a `connect` or `disconnect` method to do it.\n\nI figured that folks out there who wanted to do that were calling the [connect](https://android.googlesource.com/platform/frameworks/base.git/+/48695cb07352cb3033dc11bb828e1ca947dfc04d/core/java/android/bluetooth/BluetoothA2dp.java#279) method and the [disconnect](https://android.googlesource.com/platform/frameworks/base.git/+/48695cb07352cb3033dc11bb828e1ca947dfc04d/core/java/android/bluetooth/BluetoothA2dp.java#319) method that were marked as `@UnsupportedAppUsage` through reflection. It worked ok, and I have no intention to publish this app for anybody to use, so [I just settled with it](https://github.com/fumiakiy/BTToggle/blob/4780b091fc754040e14e96bb3c34d7fecb48c80d/app/src/main/java/com/luckypines/android/bttoggle/AndroidBluetoothAdapter.kt#L82-L92).\n\n```\nval connect = BluetoothHeadset::class.java.declaredMethods.findLast {\n  it.name.equals(\"connect\")\n}\nconnect?.setAccessible(true)\nconnect?.invoke(headsetProxy, device)\n```\n\n### 4. You cannot collect two StateFlows in a launch block\n\n`collect` method of `StateFlow` blocks? I was not able to run this code as intended:\n\n```\nselectedIndexJob = CoroutineScope(Dispatchers.Main).launch {\n  viewModel.selectedIndex.collect { index ->\n    if (index < 0) return@collect\n    listAdapter.notifyItemChanged(index)\n    sharedPreferencesAdapter.setLastSelectedAddress(viewModel.getDevice(index).address)\n  }\n  viewModel.previousIndex.collect { index ->\n    if (index < 0) return@collect\n    listAdapter.notifyItemChanged(index)\n  }\n}\n```\n\n... because the second `collect` (or the block of it) was never called even when the state was updated. I had to write like this:\n\n```\nselectedIndexJob = CoroutineScope(Dispatchers.Main).launch {\n  viewModel.selectedIndex.collect { index ->\n    if (index < 0) return@collect\n    listAdapter.notifyItemChanged(index)\n    sharedPreferencesAdapter.setLastSelectedAddress(viewModel.getDevice(index).address)\n  }\n}\npreviousIndexJob = CoroutineScope(Dispatchers.Main).launch {\n  viewModel.previousIndex.collect { index ->\n    if (index < 0) return@collect\n    listAdapter.notifyItemChanged(index)\n  }\n}\n```\n\n... that is fine, but had to struggle a little bit of why the second block was not executed.\n\n### 5. AndroidX ViewModel and constructor injection\n\n[`by viewModels()`](https://developer.android.com/topic/libraries/architecture/viewmodel) is an easy way to get a view model instance but it requires the view model to have a default constructor. [You have to create your own `ViewModelProvider.Factory`](https://github.com/fumiakiy/BTToggle/blob/4780b091fc754040e14e96bb3c34d7fecb48c80d/app/src/main/java/com/luckypines/android/bttoggle/MainViewModel.kt#L47-L55) that instantiates a new object if you want to do constructor injection.\n\n### 6. lifecycleScope.launchWhenStarted ???\n\nI wrote the app on Saturday, November 21 2020. I'm writing this part the following day, and one of my favorite news letters [**Android Dagashi** issued a new post](https://androiddagashi.github.io/issue/147-2020-11-22/). In it was [the link to the SDK document about Kotlin Flows](https://developer.android.com/kotlin/flow/stateflow-and-sharedflow), and I learned that there is this thing called `launchWhenStarted`. The description goes:\n\n> \"In the previous example that used launchWhenStarted to collect the flow, when the coroutine that triggers the flow collection suspends as the View goes to the background, the underlying producers remain active.\"\n\nOh, so with that you don't have to keep a `Job` object, launch it and cancel it because it's handled by the context? Huh. I was doing it manually but you probably don't need this code any more (and the code I wrote may be a wrong way to do it in the first place?). I'll update the code when I have bandwidth.\n\n## Conclusion\n\nWhat ended up being implemented is here: [BTToggle app in GitHub/fumiakiy](https://github.com/fumiakiy/BTToggle/)\n\nMy life is now a little bit easier with this app and I am satisfied.\n\n![Disconnect a headset from an Android phone](/videos/disconnect-2.mp4)\n\n![Connect a headset to an Android phone](/videos/connect-2.mp4)\n"},{"frontmatter":{"slug":"/blog/20200815-m5stickc-mhz19b","date":"Sun, 16 Aug 2020 14:16:51 GMT","title":"M5StickCとMH-Z19Bで部屋の二酸化炭素を計測して記録する","epoch":"1597587411","excerpt":"MH-Z19BをM5StickCに接続して、CO2センサーのデータを読み取ってGoogle Sheetに記録するプログラムを書く。","ogImage":"/images/m5stickc-mhz19b-complete.png"},"markdownBody":"\n[前回](/blog/20200815-m5stickc-http)からの続き。\n\n## MH-Z19B\n\n![M5StickCとMH-Z19B](/images/m5stickc-mhz19b.png)\n\n[MH-Z19B](https://www.winsen-sensor.com/sensors/co2-sensor/mh-z19b.html)を[M5StickC](https://m5stack.com/collections/m5-core/products/stick-c)に接続して、CO2センサーのデータを読み取ってGoogle Sheetに記録するプログラムを書く。\n\nまずMH-Z19BについてるピンとM5StickCを接続する。MH-Z19Bに電力を供給するために、MH-Z19Bの`Vinピン`とM5StickCの`5V out`をつなぎ、MH-Z19Bの`GNDピン`とM5StickCの`GND`をつなぐ。MH-Z19BからデータをM5StickCで読み取るために、MH-Z19Bの`Txピン`とM5StickCの`G0`、MH-Z19Bの`Rxピン`とM5StickCの`G26`をつなぐ。M5StickC側のGPIOピンはなんでもいいっぽいが、つないだピン番号をコードに書く必要がある（後述）。\n\n|||\n|---|---|\n| [![MH-Z19Bのピン接続](/images/mhz19b-pins.png)](/images/mhz19b-pins.png)| [![M5StickCのピン接続](/images/m5stickc-pins.png)](/images/m5stickc-pins.png) |\n\n## MH-Z19Bのデータを読むコード\n\n接続できたらM5StickCでデータを読むコードを書く。日本語で書かれたM5StickCでMH-Z19Bを扱う記事を読むと、[UIFlowでPythonでコードを書いている例](https://kitto-yakudatsu.com/archives/7286#toc21)や[M5CloudでPythonを使う例](https://medium.com/tichise/m5stack%E3%81%A7%E5%AE%B6%E3%81%A8%E3%82%AA%E3%83%95%E3%82%A3%E3%82%B9%E3%81%AE%E4%BA%8C%E9%85%B8%E5%8C%96%E7%82%AD%E7%B4%A0%E6%BF%83%E5%BA%A6%E3%82%92%E8%A8%88%E6%B8%AC%E3%81%97%E3%81%9F-3553f7a1434d)が出てきてArduino/Cなコードが出てこなくて一瞬焦ったが、ArduinoのLibrary Managerで[MH-Z19を検索して出てくるライブラリ](https://github.com/WifWaf/MH-Z19)を`#include`して普通に使えた。\n\n実際のコードを書くときにライブラリの[examples/BasicUsage](https://github.com/WifWaf/MH-Z19/blob/master/examples/BasicUsage/BasicUsage.ino)を参考にしたんだが、M5StickCで使う場合は一部コメントアウトされている方を使う必要があったりする。別にポイントってほどのことではないが、Serial1をbeginで開くときに指定する実引数でボーレート(BAUDRATE)を9600にして、上述のTxとRxの番号を指定することで正しくデータを読み取れるようになる。この辺がサンプルコードの中では`HardwareSerial`になっていたり(`Serial1`でよい)、RX_PINとTX_PINの値が違っていたり(M5StickCではGPIO10やGPIO11へのアクセスはない)するが、まあ見ればわかるって話だと思う。[ESP32にはSerial1とSerial2っていう系統があるっていうのはこの記事で知った](https://lang-ship.com/blog/work/m5stickc-uartserial/)。\n\nソース: [https://github.com/fumiakiy/M5StickC/](https://github.com/fumiakiy/M5StickC/commit/6038aa3dbb8ade0c36a88142eef4f365a9dece8a#diff-ac3ed53726558e3635fc88015490f1bc)\n\n![CO2センサー完成。気温は高めに出る。](/images/m5stickc-mhz19b-complete.png)\n\n\n## Google Sheetに記録するコード\n\nCO2センサーのデータをSerialに出力してそれっぽいデータが取れていることが確認できたので、これをGoogle Sheetに送って記録しておくことにする。Google SheetにひもづけたApp ScriptをWeb Deployすれば勝手にHTTPのエンドポイントを作ってくれるので、下記のような単純なApp Scriptで、HTTP POSTでJSONを受け取ってGoogle Sheetに追加できる。\n\n```\nfunction writeData(ar) {\n  const d = new Date()\n  const aar = [...ar, d.getTime(), d.toLocaleString()]\n  const sheet = SpreadsheetApp.getActiveSheet();\n  sheet.insertRowBefore(1);\n  sheet.getRange(1, 1, 1, aar.length).setValues([aar])\n}\n\nfunction doPost(e) {\n  const d = e.postData.contents;\n  const j = JSON.parse(d);\n  writeData(j);\n  return ContentService.createTextOutput(\"ok\");\n}\n```\n\nこのコードをWeb DeployすればURLが割り当てられるので、それに対してM5StickCからHTTP POSTすればよい。めんどくさいので認証は省いてURLを知っていれば誰でもアクセスできるようにしちゃった。\n\nソース: [https://github.com/fumiakiy/M5StickC/](https://github.com/fumiakiy/M5StickC/commit/07fb585184442a125a88a250bdc4a14d8c23076b#diff-ac3ed53726558e3635fc88015490f1bc)\n\nあとは1日データを溜めて、グラフ化してみよう。"},{"frontmatter":{"slug":"/blog/20200815-m5stickc-http","date":"Sat, 15 Aug 2020 22:45:54 GMT","title":"M5StickCでベッドサイドのランプをOn/Offする","epoch":"1597531554","excerpt":"実際はSonoff Basic R3が楽しかったので味をしめて、何かIoT的なおもちゃでもっと遊べないかなあと思っていた。Sonoff Basic R3を調べる中で、要するにおもしろいのはESP32というWifiとBluetoothが入ったマイクロコンピュータであるのがわかったので、ESP32の開発ボードを眺めては何かできないかなあと。","ogImage":"/images/m5stickc.png"},"markdownBody":"\n[Sonoff Basic R3で電源コードにWifi経由でコマンドを送れる](/blog/2020-05-23_Sonoff-Basic-R3-------------------f5498b92027b)ようになって数ヶ月。以前に比べて進化した生活を送れてはいるものの、一つとてもめんどくさいことがある。Apple開発者プログラムに年間購読料を納めないと、iOSアプリのProvisioning Profileが一週間でexpireすること。なんで配布するわけでもないアプリを自分のiPhoneでだけ使うために年間1万円もお布施せねばならんのだ。初詣のお賽銭でもそんなに払わないのに。\n\nとかいいつつ、実際は[Sonoff Basic R3](https://sonoff.tech/product/wifi-diy-smart-switches/basicr3)が楽しかったので味をしめて、何かIoT的なおもちゃでもっと遊べないかなあと思っていた。Sonoff Basic R3を調べる中で、要するにおもしろいのは[ESP32というWifiとBluetoothが入ったマイクロコンピュータ](https://www.espressif.com/en/products/socs/esp32)であるのがわかったので、[ESP32の開発ボード](https://www.espressif.com/en/products/devkits)を眺めては何かできないかなあと。\n\n## WFHとCO2\n\n[弊社も来年の夏まで自宅作業が決定した](https://www.facebook.com/hello.iandco/posts/1186593688375252)ので、仕事環境を少し改善しなければと机や椅子を物色してみたものの、狭い部屋にこれ以上家具を置く気にもならなかった。そんな中、[WFHで環境改善の文脈で部屋の二酸化炭素濃度を測るのが流行っている](https://bunshun.jp/articles/-/36791)のを知る。これだ。\n\n\"Arduino CO2 sensor\"とかで検索すると、[MH-Z19BというCO2センサーがある](https://www.winsen-sensor.com/sensors/co2-sensor/mh-z19b.html)のがわかった。ArduinoではなくESP32の開発ボードとこのセンサーでCO2濃度をGoogle Sheetか何かに送って可視化するというプロジェクトをやってみよう。\n\n## M5StickCとMH-Z19B\n\nそういうことをしている例を検索してみたところ、[M5StickC](https://m5stack.com/collections/m5-core/products/stick-c)という製品に行き着いた。中にESP32 Picoってのが入ってて、LCD液晶とボタンが2つと、そして汎用IOピンがある。[M5StickCにMH-Z19Bをくっつけて使うためのケースを売っている人もいて](https://kitto-yakudatsu.com/archives/7286) (*1)、この組み合わせは成功例があるらしい。これだ。\n\n```\n*1 正確には、MH-Z19Bの利用例を探していてこの記事を見つけ、それでM5StickCというものの存在を初めて知りました。\n```\n\nM5StickCもMH-Z19BもAmazonで売っているのだが、検索してみるとそれよりだいぶ安い通販サイトがいくつかある。M5StickCはいろんな場所で売っているのだが、MH-Z19BとM5StickCを両方売っていて安いサイトを探し回った結果、[Banggood](https://www.banggood.com/)で買うことにした。決め手は、最安ではないもののそれなりに安価で両方売っていることと、[MH-Z19Bにピンをはんだ付けしてあるバージョンを売っている](https://www.banggood.com/MH-Z19-MH-Z19B-Infrared-CO2-Sensor-Module-Carbon-Dioxide-Gas-Sensor-for-CO2-Monitor-0-5000ppm-MH-Z19B-NDIR-with-Pin-p-1693604.html?rmmds=search&cur_warehouse=CN)こと。はんだごてを買うよりジャンパーワイヤーを買う方が安いし、まだはんだごてを買うほどのことでもないし。まあこの二酸化炭素センサーをずっと使い続けるならはんだ付けする日も来るかもしれないけど。\n\n説明を読むと、USやカナダにも倉庫を持っていてそこからの発送ならそんなに時間もかからなそうとか。Banggoodの評判を検索するとあまりよろしくないのだが、内容を読むと「洋服を買ったら偽物だった」「クリスマスに欲しかったのに届かなかった」など、いやそれはどうなのよ的なものが多かったので、せいぜい$35だしというわけで、念のためPayPal支払いで7月27日に発注した。\n\n発注して数時間後にはUSPSのトラッキングコードが割り当てられた。しかしそこから8月10日までの二週間、動きは一切なし。8月10日になってNJのUSPSに届き、そこからなぜかPAを経由して8月13日に無事に届いた。USPSのラベルの下に中国語が書かれた別のラベルが貼ってあって、それにはJFK宛てみたいに書いてあったので、結局中国のどこかからどうにかしてJFKに来て、そこから国内発送されたっぽいんだけど、詳細はわからず。でも送料**90セント**、保険70セントで三週間で届いたのでなんの文句もありません。\n\n![M5StickC](/images/m5stickc.png)\n\n## M5StickCでベッドサイドランプのON/OFF\n\nCO2の前にまずは簡単そうなほうをということで、M5StickCをWifiにつなげて、HTTP POSTでコマンドをSonoff Basic R3に送ることで、M5StickCのボタンを押したときにベッドサイドランプをOn/Offできるようにする。M5StickCのWifiでHTTP POSTする方法はそこら中に例があるので詳細は書かないが、一点だけ少しハマった。\n\nArduinoの`setup() -> loop()`を使ってプログラムを書いた。まずはArduinoのプログラム例でありがちな、`loop()`の中でなんらかの処理をして、`delay(1000)`とかで1秒寝てから`return`し、次`のloop()`が呼ばれる、みたいなコードを書いた。その`loop`の中で`M5.BtnA.isPressed()`を見て「ボタンが押されたら...」というコードを書いたんだが、ボタンを押しても全然反応しない。\n\n`M5.update()`で状態を更新した後、`M5.BtnA.isPressed()`を見ると今その瞬間にボタンが押されたのかどうかがわかるという仕組みなので、`delay(1000)`とかやってると、その1秒間のどこかでボタンを押しても、次に調べたときには`isPressed`はもう見えなくなっているってことだと思う。\n\n結局、`loop()`のなかで`delay`して処理を1秒ごとにするようなことはやめて、`loop()`はクロックに応じて実行されるのだが、中で現在時刻を`millis()`で取って、以前の`millis`と比較して、1000ms経過してたら処理する、ってなコードに変更してうまくいった。\n\n```\nunsigned long lastMillis = 0;\nunsigned long tick = 0;\nunsigned long INTERVAL = 1000; // 1sec\n\nvoid loop() {\n  M5.update();\n  unsigned long currentMillis = millis();\n  if (currentMillis - lastMillis > INTERVAL) {\n    statusUpdate(tick++);\n    lastMillis = millis();\n  }\n  if (M5.BtnA.isPressed()) {\n    toggleSwitch();\n    powerOff();\n  }\n}\n```\n\nこの機能を使うのは、夜寝る前にランプをONにするときと、寝る直前にOFFにするときだけなので、ONやOFFにしたらその度に本体の電源を切ることにした。M5StickCには小さいバッテリーが入っているので、こまめに電源を切っておけば結構長いこと充電なしで使えるはず。\n\nソース: [https://github.com/fumiakiy/M5StickC/](https://github.com/fumiakiy/M5StickC/commit/c64dc7fb78ee0732c97ae0a726fbdf3e2940c4a1)\n\n[次はCO2センサーにかかろう](/blog/20200815-m5stickc-mhz19b)と思う。\n\n"},{"frontmatter":{"slug":"/blog/2020-05-23_Sonoff-Basic-R3-------------------f5498b92027b","date":"Sat, 23 May 2020 21:14:59 GMT","title":"Sonoff Basic R3でセキュアなスマートホームを構築する","epoch":"1590268499","excerpt":"我が家でもようやく手元のスマホでベッドサイドのランプを消せるようになりました。"},"markdownBody":"\n我が家でもようやく手元のスマホでベッドサイドのランプを消せるようになりました。\n\n### ホモ・サピエンスになりたい\n\n我が家のベッドサイドにはIKEAのKvart(3 heads)というフロアランプを置いているのだが、これが首ごとにスイッチがあってしかも1つ1つが暗いので常に3つつけるせいで、寝る前に手を伸ばして3つのスイッチを切るのがうっとうしくて仕方ない。うっとうしくて仕方ないと言いつつ5年間毎日やっていたので、実はうっとうしくないのかもしれない。\n\n![IKEA Kvart floor lamp](/images/0*-6XxE5q1W_65wZ1C.jpg)\n\nしかし先日[Rebuild.fm (ep.246](http://rebuild.fm/264/) を聞いていた)ら、手で電気を消すなんて原始人かと（ポッドキャスト越しに）言われたことと、Work from homeで少し時間と体力に余裕があるので、重い腰をあげてスマートホーム（）に挑戦することにした。目標は、このフロアランプの3つのスイッチすべてをスマホでOn/Offできるようにすること。当然ながら簡単なのは、適当なスマートプラグを買って壁のアウトレットに刺して、ランプのコードをそのスマートプラグに刺すことだろう。でもなあ。\n\n### Arduinoで自作しようかな\n\nただランプの電源をOn/Offするだけ、ボイスコントロールも不要、IFTTTもAlexaも外出先からの操作も一切不要。むしろ、これらの機能は付いていて欲しくない。プラグとスマホが同じ空間にある前提で、スマホからプラグにコマンドを送る機能だけが欲しい。プラグからインターネットに出て行って欲しくない。代わりに何らかのAPIが欲しい。謎のうんちゃらCloudに登録とかしたくない。うんちゃらCloudから我が家の電気系統にアクセスなんてして欲しくない。\n\nという条件からまず考えたのが、Arduinoを使ってBluetoothでコントロールできるプラグを自作すること。その手の電気工事関連の資格は一切持っていないし、小学生のときに電子工作が流行ってはんだ付けはできないこともない、くらいのスキルセットだが、まあYouTubeでどうにかなるのでは。\n\n調べてみると、電源を入れたり切ったりするにはリレーという部品を使うらしい（その程度の知識もありませんでしたよ）。高ボルテージの電気を扱うのは危険だよねってことで、[IoT Relayなる製品](https://www.sparkfun.com/products/14236)もあることを発見。\n\n![Sparkfun IoT Relay](/images/0*XEb_J-JCb0nuY-3G.jpg)\n\n$30弱か…。これにArduino UnoとBluetoothモジュールをつけて、うーん随分かかるなあ。面白そうではあるけども、この4口もあるタップをただランプのOn/Offのためだけに買うのもバカバカしい。\n\n普通のArduinoで使えるリレーモジュールなら$5くらいで買えるので、それの使い方を調べてみた。見つけたのが[Arduinoで家電を操作しようというタイトルのこの記事](https://www.circuitbasics.com/build-an-arduino-controlled-power-outlet/)。何と電源タップのコードをちょん切って、電気が通る線をリレーにつないでいる。なるほど、これでリレーについているI/Oピンへ信号を送ることで電気を通したり通さなかったりできるということか。こりゃあ面白そう。\n\n![Cut the wire](/images/0*_eVKi14W8beaQ_YN.jpg)\n\n電源コードを切って出てくる3本のワイヤーがそれぞれ何で、どれがどれかをどうやって調べるのか、などなどを調べて机上の空論的な自信をつけたので、パーツをAmazonのカートに入れてみる。うーん、Arduino Unoとブレッドボードとワイヤーと、それに電源コードと交換用アウトレットなどを一通り揃えるとやっぱりそれなりの値段になるよね。あと、Arduino UnoとBluetoothモジュールを買って、それをベッドサイドに固定してランプのOn/Offのためだけに使うのってやっぱり無駄なんじゃないかなあ。\n\n### Sonoff Basic R3\n\nArduino経由じゃなくて、本体にHTTPサーバーか何か入っていてAPIで操作できるスマートプラグはないのか、検索してみた。Belkinの製品にAPIがあるらしいんだけども、やっぱり外部のサイトに登録とかすることになる。それはやりたくない。\n\nもう少し探して、[Sonoff](https://sonoff.tech/)に行き着いた。どうも主にEU向けに製品を作っているみたいだが、USで使っている人もいるみたい。[OSSのファームウェアを焼けばHTTPで操作できる](https://github.com/arendst/Tasmota)という情報があってドキュメントを見に行ったら、最新の[R3](https://sonoff.tech/product/wifi-diy-smart-switches/basicr3)では[DIYモードがあらかじめ入っていて、HTTPで操作できる](http://developers.sonoff.tech/sonoff-diy-mode-api-protocol.html)こと、[DIYモードにすると公式アプリからすら接続できなくなり、APIでしか操作できないらしい](https://notenoughtech.com/featured/sonoff-r3-diy-mode/)ことを発見した。これはスマートプラグではないが、求めていたのはこれじゃないか？\n\n![Sonoff Basic (https://www.electroschematics.com/sonoff-basic-wi-fi-switch/)](/images/1*pyH9Mh1_WMal12XwjvJ1nA.png)\n\nSonoff BasicはどうやらWifiチップとリレーがつながっているだけのボードで、Arduinoとリレーを使うときのような要領で電源コードの中間にこいつを挟むように配線すれば、あとはWifiで電気をOn/Offできるということらしい。GNDを配線する場所がないのもUS向けではないためなのか、ちょっと不安になるんだけども、YouTubeを見ても多分アメリカの人が使っているし、大丈夫だと信じる。こいつにすれば、これ1つ($10)と電源延長コード($5)だけ用意すればおしまいなので、早速Amazonで注文した。[Sonoff Basic R3自体は1つ$5くらい](https://www.itead.cc/sonoff-basicr3-wifi-diy-smart-switch.html)だし、延長コードなんて$1くらいで買えるものだけども、送料を入れればこんなもんだろう。\n\n### Cut the wire\n\nSonoff Basic R3につなぐので、あえてアースのない2 prongの延長コードを買った。アースはアースでSonoff Basic R3の外でつないでしまえばいいんだけども、考えたくなかったので。さあぶった切るぞ。\n\n![ラジオペンチで切る](/images/1*k9_0GznkTEHg0Dvg2I8pWw.png)\n\n![切れた](/images/1*CrjsC8gLN4DR9Ok1yt5yQg.png)\n\nワイヤーストリッパーもないので、引き続きラジオペンチでガワをむく。\n\n![力の込め具合を調節して](/images/1*5eqBKdZmEb4shffqKiQ0PA.png)\n\n![ワイヤーむけた](/images/1*yA4kwVtGmXmaaCkx-dO4ww.png)\n\n### Sonoff Basic R3に接続\n\n切った両端でガワをむいたら、Sonoff Basic R3のターミナルに接続する。ターミナルにはそれぞれNとLがあって、ニュートラルをNに、電線をLにつなぐ。2本の線のどっちがニュートラルかは、[byte sizedのYouTube動画で教えてくれた](https://youtu.be/lRCH67wfwNE?t=140)。USでは、極性のあるプラグ（2つのプラグで大きさが異なる）では大きいプラグの方がニュートラル。さらにニュートラルの方には、コードの外側にギザが付けられている、とのこと。見てみると確かにコードにギザが付いている方が大きな方のプラグの側になっている。\n\n![両端をSonoff Basicのターミナルへ](/images/1*m9_ppljWMni3YcY44niXmg.png)\n\nSonoffのホームページにも書いてあるし上の写真では外してあるカバーにも書いてある通り、両端ともターミナルの上の方がNで下がLになっている。コードのギザを確認して、ワイヤーを突っ込みネジを締める。\n\n![このコードの外側のギザは反対側にはないので、こっちがニュートラル](/images/1*v-7SPSMANi3VKyBwVLRxXg.png)\n\n付属品のコードを押さえるカバーを付けて、化粧カバーをつければ完成。ニュートラルと電線を間違えないようになんども確認した。\n\n![ギザのある方がNにつながっている](/images/1*00BdgcE11ByYJHj2rGSgoQ.png)\n\n![こちらもギザのある方がNにつながっている](/images/1*TNSZNsAw0LaQ14Hqbq5fLA.png)\n\n![完成した延長コード](/images/1*tHwsW0QBTwtlnCfYBIbNbw.png)\n\n### ファームウェアを更新\n\nまずはDIYモードの前に最新のファームウェアに更新する。Sonoff BasicはR3が出るまでは公式DIYモードはなくて、[内部で使われているWifiチップ用のファームウェア](https://tasmota.github.io/docs/)を焼いて遊ぶのが一般的だったらしい。\n\nR3でSonoffが公式DIYモードを用意したんだが、最初のバージョンでは本体の内部カバーも開けて中にあるピンにジャンパーをはめてDIYモードにする方式で、さらにDIYモードになったR3はあらかじめ設定されている名前のSSIDのWifiへ接続しようとするので、こちらでその名前のアクセスポイントを立てて、接続させて、それからいろいろ操作するという手順だったらしく、[R3のDIYモードなんか使い物にならん](https://notenoughtech.com/featured/sonoff-r3-diy-mode/)的な投稿が多い。\n\nSonoffはその辺敏感に反応して、現在のDIYモードはジャンパーもいらないし、R3のハードウェアスイッチを長押しするだけでDIYモードに入って、あとはR3に直接アドホック接続して設定をすれば良くなっているので、簡単になった。ただそのバージョンのファームウェアが入っているかどうかわからないので、とりあえずはファームウェアの更新をするという話。\n\nR3を電源に接続するとQuick Setupモードになるので、あらかじめダウンロードしておいた[eWelinkアプリ](https://play.google.com/store/apps/details?id=com.coolkit&amp;hl=en)でデバイスを検出して、SSIDやパスワードを設定してR3を自宅の無線ルーターに接続する。ファームウェアの更新もアプリでできる。本稿執筆時点では3.5.0が入った。\n\n### Let’s DIYモード\n\nファームウェアを更新したらいよいよDIYモードである。まずはR3に付いているハードウェアボタンを長押しして、青いランプを点滅させる（5秒くらい）。規則正しい点滅と、短・短・長の点滅の2種類があるので規則正しい方にする。\n\n![DIYモード](/images/1*6gUE3c7zBU9ochjTPin4Kg.gif)\n\nこのときR3は**ITEAD_xxxx**という名前のSSID（**xxxx**部分はブツによって異なる）でアドホックWifiを作っているので、それに接続して（パスワードは[Sonoffの開発者向けページ](http://developers.sonoff.tech/sonoff-diy-mode-api-protocol.html)に書いてある）、ブラウザーで**http://10.10.7.1**にアクセスする。そこで自宅のWifiのSSIDとパスワードを設定できる（11acとかの5Ghzには対応していない）。設定したらR3は再起動し、うまくいけば自宅のWifiネットワークに接続する。自宅Wifiのルーターの管理画面に行けばIPアドレスはわかるだろう。\n\n### WiresharkでmDNSの中身をみる\n\nあとはAPIドキュメントに沿って、curlでIPにむけてPOSTでも送ってやればいいんだろう…と思ったらそうでもなかった。IPとポート（デフォルトのポートも[Sonoffの開発者向けページ](http://developers.sonoff.tech/sonoff-diy-mode-api-protocol.html)に書いてある）が分かっても、R3のデバイスIDがわからないと、POSTするデータを作れない。R3はデバイスIDをmDNSでマルチキャストしていて、[Windows用のクライアントアプリ](https://github.com/itead/Sonoff_Devices_DIY_Tools)もあるのだが、mac OS用のアプリはない。仕方ないので、Wiresharkで通信をのぞき見た。必要なのは、eWeLink_nnnnnnnnのnnnnnnnの部分。\n\n![Wiresharkは万能](/images/1*bVHikqIMdjbxwpeRzTi6Cg.png)\n\nIPアドレス、ポート、デバイスIDの3つがわかれば、curlでHTTP POSTを送るだけで電源On/Offができる。\n\n```\n$ curl -X POST -d '{\"deviceid\":\"100090380b\",\"data\":{\"switch\":\"off\"}}' http://192.168.mm.nn:8081/zeroconf/switch</a>\n```\n\n```\n{\"seq\":2,\"error\":0}\n```\n\n毎晩curlするのもめんどいので、OnとOffのボタンがあるだけのAndroidとiOSのアプリを作った。\n\n### スマートでセキュアでプライベートなホーム\n\nこうしてベッドサイドランプを手元のスマホでOn/Offできるようになった。ボイスコントロールとかもやろうと思えばAndroid/iOSそれぞれのアプリ内でできるだろうし、謎のなんちゃらCloudにデバイスやアカウントを登録しない、自宅LAN内で完結したプライベート スマート ホームになった…気がする。R3はhttpしか話さないのだが、自宅の無線ネットワークに入られない限りはまあ大丈夫かなと。\n\n電源On/Offできればそれでよいタイプの家電製品を操作するならSonoff Basicはほんとに簡単だった。何かネタがあれば今後も使いたい。もっとも、Sonoff BasicはただWifiチップのESP8266とリレーを組み合わせただけなので、[ESP8266の開発ボード](https://www.amazon.co.jp/dp/B078WM1YQW/)を使えばいろいろ面白いことができるのかもしれない。\n\n"},{"frontmatter":{"slug":"/blog/2020-01-11_--------------45d1865c8b3a","date":"Sat, 11 Jan 2020 22:49:20 GMT","title":"ニューヨークで仮免を取った","epoch":"1578782960","excerpt":"前回からの続き。仮免を取るための筆記テストを受けるために、12月30日の朝10:30のアポイントメントをDMVのWebサイトで取った。"},"markdownBody":"\n### ニューヨークで仮免を取った\n\n[前回からの続き](/blog/2019-12-29_-------------------e3f6436b0b67)。仮免を取るための筆記テストを受けるために、12月30日の朝10:30のアポイントメントをDMVのWebサイトで取った。\n\n### テスト勉強\n\n12月23日で仕事を納めて、後の一週間でDMVのサイトにある[Drivers manual and practice tests](https://dmv.ny.gov/driver-license/drivers-manual-practice-tests)をひたすらやり、答えをほぼ覚える。これ以外の準備は何もしなかった。他の人が書いているブログなどを読んでも、ほとんどこれと同じ問題が出ると書いてあるし。\n\n### 当日\n\n12月30日当日。10時10分にマンハッタンのダウンタウンのDMVオフィスへ到着。ここにした理由は、単に以前近くに住んでいて場所を知っているからというだけだった。中に入ると、アポイントメントのメールに付いていたQRコードを読み取る機械が2台設置されていたが、両方ともout of orderでそこに職員が立っている。その人に「筆記テストを受けにきた」と伝え、アポイントメントのメールを印刷した紙を見せると、「今10:10だからまだ時間じゃない」。\n\n「じゃあここで待ってればいいの？」\n「いや、んー」、横にいたもう一人に\n「この人、筆記テストのアポイントメントを持っているんだけど」\n「筆記テストにアポなんかない」\nは？DMVのWebで取ったアポなんだけど？\n\n結局その横にできていた30人くらいの列に並ばされた。最初はなんの行列かもわからなかったけど、並んでいるうちにこれは写真を撮るのを待つ列だと判明。まわってきた別の職員からピンクの紙を受け取って署名する。写真を撮っていいよという同意らしい。順番が近づくと、ブース内の別の職員から今日の目的を聞かれて「テスト受験」と答えると、Tで始まる番号札を渡された。\n\n順番がまわってきて写真を撮る。写真を撮ったら、番号が呼ばれるまで待機。待機エリアにはベンチが大学の教室くらいの数あったが、すでに満席。呼ばれている番号を眺めると、30番くらい後だった。まあ薄々想定してはいたけども、結局アポイントメントを取った意味はゼロだった。最初に「じゃあここで待ってればいいの？」って聞かずに時間まで待っていたとしたら、20分後に同じ行列に並ばされることになっていたはず。早速の洗礼である。\n\n写真を撮る場所のすぐ横にテストエリアがあって、PCが10台くらい置いてあって、それでテストを受ける（マウスで選択するだけ）のだが、常時1、2人しか受験しておらず、それでいて番号はちっとも進まない。まあそんなことだろうとは思っていたよ。スマホにダウンロードしておいたPDFでテスト内容をひたすら復習。\n\n90分くらい経過しただろうか、とうとう妻の番号（自分の番号の1つ前）が呼ばれたので、二人でブースへ向かう。\n\n### 用意すべき書類\n\nニューヨーク州でDMV発行のIDを取るには、1) 誕生日を証明する書類、2) アメリカに滞在する許可を持っていることを証明する書類、および 3) ニューヨーク州に住んでいることを証明する書類が必要で、1はパスポート、2はI-94、ビザ、グリーンカードやEAD、3はbank statementかutility billが定番なんだが、妻には3がない。DMVのサイトにはしかし、「Parent/Spouse ID (in the same last name or with proof of relationship) (if issued within 1 year)」という項目があって、夫たる僕がIDを出して、同姓の妻がパスポートと（グリーンカード取得作業中に無駄に取った）日本領事館発行の婚姻証明を提示すればよいはずだったので、一緒にブースにいった。\n\nところがDMVの職員は、「これじゃ彼女の証明にならない」。\n\n「DMVのサイトで妻が一緒に住んでいる同姓の人であることが証明になるって書いてあった」\n「彼女の居住証明がないとだめ。bank statementかutility billか」\n「いやWebサイトに書いてあった」\n「ここではダメ」\n\nしばらく粘ったが取りつく島はまったくなく、結局妻はテストを受けられなかった。お役所関連のことでWebに書いてある内容なんか信じてはいけない。\n\n妻は待合所へ戻り、僕はテストを受ける端末番号を知らされて、テストを受ける。15分くらい。テストを始めると、最初に誕生日や名前を確認する画面が出てくる。その後テストの練習として、画面に円が書かれていて選択肢として「Triangle」や「Rectangle」が並んでいる中から「Circle」を選ぶという問題が出てくるので、それに答えると、次に本番のテストが始まる。\n\n見たことのある問題がほとんどだったが見たことのない問題も4問くらいあった。テストは英語で受けた。証明書を出すときにどの言語で受けるか聞かれるのだが、妻が「Japanese」と言ったら「日本語なんてあったっけ？」という始末。日本人の方は、Lower ManhattanのDMVはやめた方がいいかもしれない。\n\n### テスト、視力検査、仮免発行\n\nテストは、2問間違えたが無事合格。画面に「pass」と出るので、テストを終えて、すぐ横にある20人ほど並んでいる行列にまた並ぶ。この行列の目的は、最終的な証明の確認、視力検査、およびお支払い。この行列もまた遅々として進まず、1時間くらい並んだ気がする。道理でテスト端末は空いているのにTの番号は全然呼ばれないわけだ。端末が空くたびに人を入れていたら、この行列も100人を超えてしまうだろう。\n\nようやく順番がまわってきて、もう一度パスポート、SSNカード、bank statementなどを見せる。視力検査はおなじみのランドルト環の表のようなもの、でもランドルト環ではなく大文字アルファベットが書いてある紙がブースの少し奥に天井からぶら下がっていて、それの上から4番目？くらいを読み上げる方式。問題なく見えた。その場で印刷した紙が渡され、それが写真付きのカードが届くまでのlearners permitとなる。これを使う予定はないけども。\n\nこうしてすべてが終わり、出口に向かったのは午後1時。3時間コースだった。この時点でオフィスへの入館規制がかかっていて、オフィスの外の歩道に列が伸びていた。うっかりアポを午後にとっていたりしたらとんでもない目にあったところだった。\n\n写真付きのカードは1月10日に無事に郵送されてきた。これで当初の目的の1つだった「財布に入れておけるIDが欲しい」という目的は達成。有効期限は5年後の誕生日まで。さて、実際の運転免許証を取りに行くかどうか。どうしようかなあ。\n\n### DMVに行く前にこれを読んでいる方のために\n\nDMVのWebサイトはあてにならないが、できる準備はなんでもしていこうという観点から、アポをとって確認メールは印刷していった方がいいと思う。アポは1日の初めの枠、8時とか9時とかにしておいて、その時間につくように行けば、たとえアポが無意味でも並ぶ時間は短くなるはず。ただしDMVオフィスによってはWalk inでの筆記テスト受験はできないとWebに書いてある場所もあるので、その場合アポは必須なんだと思う。Webは信用しないと言いつつ、自分に不利になりかねない情報は受け止めて対策しておく必要がある。\n\nSSNとパスポート、ビザやグリーンカードはあるとして、自分名義現住所のbank statementとutility billを印刷して持って行くこと。DMVのWebサイトに色々書いてある、この書類は何ポイントこれは何ポイント、そして全部で何ポイント必要、とかいう内容は信用しない。bank statementかutility bill。これしか聞かれなかった。他の書類はまったく取り合ってもらえないと思った方がいい。H4では働けないなどの理由でSSNもなく、奥様の居住を証明することが難しい場合、SSNなしでも作れる場所で銀行口座を作っておくとか、Utilityの契約時に奥様の名前にするとかしておくと何かと便利だと思う。\n\nあとは、半日無駄に過ごすつもりで、時間が無為に過ぎることを容認できるくらい心に余裕がある状態のときに行きましょう。DMVで3時間なら「早めに終わったね」くらいの感じです。6時間（うち5時間45分は何もしない時間）とかを許容するつもりで行きましょう。\n\n[5時間講習の受講](/blog/2021-06-13_five-hour-course-drivers-license-ny/)へ続く。\n\n"},{"frontmatter":{"slug":"/blog/2019-12-29_-------------------e3f6436b0b67","date":"Sun, 29 Dec 2019 16:59:24 GMT","title":"ニューヨーク市で仮免を取ろうと思った","epoch":"1577638764","excerpt":"ニューヨーク市で暮らし始めて6年。重い腰をあげて受験しようと思いました。"},"markdownBody":"\n### ニューヨークで仮免を取ろうと思った\n\nニューヨーク市で暮らし始めて6年。日常生活で運転を必要とすることがないので、めんどくささから運転免許証を取るための行動をこれまでまったく起こさなかった。\n\nめんどくさいなあと思っていた理由は二つあって、一つはDMVに関する悪評。DMVイコールめんどくさい役所という話をあらゆる場面で聞かされていたので、とにかく行きたくなかった。ニューヨーク市に住み始めて最初の4年を、DMVオフィスから2ブロックの場所で過ごしたにも関わらず。もう一つは、平日に休みを取ってまで行きたくなかったこと。DMVの悪評とも相まって、無駄な時間を過ごすことが確定している場所へわざわざ行きたくなかった。\n\nところで、ニューヨーク州はでかい。ニューヨークといえばマンハッタンやブルックリンのごく一部を思い浮かべてしまうが、ニューヨーク州にはナイアガラの滝もあるし、スキー場やハイキングスポットや紅葉の季節のドライブスポットなんかもたくさんある。もちろん海岸もあればワイナリーだってある。ニューヨークに住んでいて、週末にふらっとこれらの場所に行かないのはなんとももったいない。\n\nだがしかし、これらの場所にふらっと「公共の交通機関で」行けるわけではない（行ける場所もある）。もちろんナイアガラの滝なんかはニューヨーク市内からだと飛行機に乗る距離だし、スキー場なんかは自家用車がないと厳しい。ハイキングなら電車で行き帰りできる場所もなくはないが、限られる。バスツアーもあるけど、行きたい場所すべてにバスツアーが催行されているわけではない。要するに、運転できるとのできないのとでは行動範囲が全然違うという当たり前のことを実感し始めている。\n\n運転免許証があるともう1つ便利なことは、とにかくこの街であらゆる場面で求められる「ID」つまり身分証明書になること。生年月日、顔写真、そしてニューヨークに住所を持っていることを証明してくれるので、美術館にいけば言い値で入れるし、バーで酒を飲めるし、FedExで書類を発送できるのである。パスポートで代替できることも多いけども、財布には入らない。したがって持っていくのを忘れる。会社のパーティでバーに行き、IDを持っていくのを忘れて、同僚にビールを買ってきてもらうことも一度や二度ではない。\n\nさて、2019年も終わりに近づき、会社は仕事を納めて1月2日まで暇である。例年は帰省していたのだが、今年はビザなどの関係で日本へはいけないので、そのままニューヨーク市にとどまっている。暇である。しかしここはアメリカ合衆国。クリスマス休暇が終わってから年末年始はそこまでお休みじゃない。DMVもお役所なので、12月30日でも開いているのである。平日である。自分は休みである。暇である。DMVで無駄な時間を過ごすチャンスである。\n\n一念発起して運転免許証を取りにDMVへいくことにした。\n\n[ニューヨークで仮免を取った](/blog/2020-01-11_--------------45d1865c8b3a)に続く。\n\n"},{"frontmatter":{"slug":"/blog/2019-07-04_Levi-s-Commuter-Trucker-Jacket-with-Jacquard-by-Google----------------Android----------------a4747b4edca5","date":"Thu, 04 Jul 2019 20:45:26 GMT","title":"Levi’s Commuter Trucker Jacket with Jacquard by Googleの袖から来たデータを機械学習してAndroidアプリで利用できるモデルを作る","epoch":"1562273126","excerpt":"Tensorflowで作ったモデルをTensorflow Liteのモデルに変換するまでの苦労話"},"markdownBody":"\n### Levi’s Commuter Trucker Jacket with Jacquard by Googleの袖から来たデータを機械学習してAndroidアプリで利用できるモデルを作る\n\n### TensorflowのモデルをTensorflow Liteのモデルに変換したい\n\n[前回なんとなく雰囲気で作ったTensorflowのモデル](/blog/2019-06-15_Levi-s-Commuter-Trucker-Jacket-with-Jacquard-by-Google----------------1ae6347c67fc)をAndroidアプリで利用するには、まずTensorflowで訓練したモデルをTensorflow Liteで読めるものに変換しなければならない。[ドキュメント](https://www.tensorflow.org/lite/convert)にはなんだかサラッと[コマンドで変換できそうなことが書いてある](https://www.tensorflow.org/lite/convert/cmdline_examples)のでやってみる。\n\n入力としてモデルを渡すのでまずモデルをシリアライズしてファイルにする。[DNNClassifierにはexport_saved_modelっていうメソッドがある](https://www.tensorflow.org/api_docs/python/tf/estimator/DNNClassifier#export_saved_model)のでこれを呼べばいいんだろうが、こいつに渡す引数がよくわからない。DNNClassifier savedmodelあたりでググり倒してようやく[それっぽいコードを見つけた](https://stackoverflow.com/a/55737532)のだが、これは直接Tensorflow Liteのクラスとメソッドを使ってインメモリのオブジェクトを変換する方法で、いやまあ別に動けばいいんだけども、渡しているものも何が何だかわからん。加えて、モデルを作る過程では一切出てこないセッションだのグラフだのというオブジェクトを「そこにある」前提で扱うコードになっている。`dnn/input_from_feature_columns/input_layer/concat:0`とか`dnn/logits/BiasAdd:0`とか一体どこから出てきたのか。\n\n### Tensorflow Liteで予測してみる\n\nとりあえず上記のコードを[前回のスクリプト](https://gist.github.com/fumiakiy/c1f8fe23b36b0a8984a12cd2bb54cd0e)へコピペして、classifierのtrainをした後で呼び出してみると、確かにconverted_model.tfliteファイルができあがるので、ひとまずこれをTensorflow Liteで推測に使ってみることにした。Tensorflow LiteのドキュメントをみるとPythonでも使えるぽいので、ひとまずスクリプトを書いてみる。\n\nTensorflow LiteのドキュメントではInterpreterオブジェクトを作ってrunメソッドを呼び出せば結果がoutput引数に返されるぽいことが書いてあるのだが、PythonのInterpreterオブジェクトにはrunメソッドがない。[ググって見つけたこのコード](https://stackoverflow.com/a/51093144)にしたがって、[input_dataだけ自前の配列に変えたスクリプト](https://gist.github.com/fumiakiy/a86a834352c1c2c5a8305e46b3a5e751)を書いて実行してみる。\n\n```\n$ python tflite1.py\n\nValueError: Cannot set tensor: Dimension mismatch\n```\n\nはて。次元が合わないというので、配列の配列にしてみる。\n\n```\n# input_data = e\ninput_data = [e]\n…\n$ python tflite1.py\n…\nValueError: Cannot set tensor: Dimension mismatch\n```\n\n同じエラー。配列の要素を一つだけ渡してみる。\n\n```\n# input_data = [e]\ninput_data = e[0]\n```\n\n```\n…\n$ python tflite1.py\n…\nValueError: Cannot set tensor: Dimension mismatch\n```\n\nまたまた同じエラー。何を渡せばいいんだかわからないので、とりあえず第一引数で使っている`input_details`の中身をダンプしてみることに。\n\n```\n[\n{'index': 0, 'shape': array([1], dtype=int32), 'quantization': (0.0, 0L), ‘name’: ‘Const’, 'dtype': &lt;type 'numpy.int64'&gt;},\n{'index': 1, 'shape': array([1], dtype=int32), 'quantization': (0.0, 0L), ‘name’: ‘Const_1’, 'dtype': &lt;type 'numpy.int64'&gt;}, …\n```\n\nつまりinput_details[0][‘index’]は“0”であると。このtensorはint64型のデータで、shapeは要素数1の配列であるということ…なのかな? ということは、これなら通るのか?\n\n```\n# input_data = e[0]\ninput_data = [e[0]]\n```\n\n```\n…\n$ python tflite1.py\n[[1. 0. 0. 0. 0. 0. 0. 0.]]\n```\n\nなんか出てきた。要素数8の配列なので、おそらくそれぞれの数値がLABELつまりモデルを作った文字データ(**a, b, c, d, e, h, o, y**)に対応していて、それを示す値が0/1でかえってきた? つまりこのデータから予想される文字は「a」ってこと?\n\nしかし**e[0]**の値しか渡していないのだからこれが正しいわけがないので、input_dataを正しい形にすべく、こんなコードにして、51件の数値を全部渡してみることにした。\n\n```\n# input_data = [e[0]]\nfor i in (range(len(e) — 1)):\n    interpreter.set_tensor(input_details[i]['index'], [e[i]])\n```\n\n```\n…\n$ python tflite1.py\n[[0.1134394 0.09876031 0.1299585 0.1381347 0.07306363 0.17048864\n 0.09710578 0.17904899]]\n```\n\nなんかそれっぽい値がかえってきた。これがそれぞれの文字かもしれない可能性を表す数値なんだろうか。eではなくyのデータを与えてみると、\n\n```\n# for i in (range(len(e) — 1)):\n#     interpreter.set_tensor(input_details[i]['index'], [e[i]])\nfor i in (range(len(y) — 1)):\ninterpreter.set_tensor(input_details[i]['index'], [y[i]])\n```\n\n```\n…\n$ python tflite1.py\n[[0. 0. 1. 0. 0. 0. 0. 0.]]\n```\n\nつまり100%「c」って予想ってこと? ふーむ。output_detailsの方をダンプしてみると、こうなっていて、そういう解釈で良さそうな気がする。\n\n```\n[{‘index’: 51, ‘shape’: array([1, 8], dtype=int32), ‘quantization’: (0.0, 0L), ‘name’: ‘dnn/head/predictions/probabilities’, ‘dtype’: &lt;type ‘numpy.float32’&gt;}]\n```\n\nここまで試行錯誤を重ねて、あとはtrainingのstep数やhidden_unitsの中身やらをあれこれいじってモデルを作り直して、また変換して[tflite1.py](https://gist.github.com/fumiakiy/a86a834352c1c2c5a8305e46b3a5e751)を実行してみて、というのを繰り返してみたが、なんとも今一つの結果しか得られない。らちが開かないので、Tensorflow Liteへの変換過程を変えて、Saved Modelとやらにエクスポートすればもう少しそのファイルに何か書いてあるんじゃなかろうかと、DNNClassifierのexport_saved_modelを呼ぶ方法を探すことにした。\n\n### TensorflowのDNNClassifierをSavedModelとして出力する\n\nもう一度「DNNClassifier “saved model”」あたりでググっていくつかそれっぽいサンプルを見ていてようやく[この記事](http://shzhangji.com/blog/2018/05/14/serve-tensorflow-estimator-with-savedmodel/)の中にコピペできそうなコードを見つけた。早速ちょいちょい書き換えて実行してみる。\n\n```\ndef export_tflite2(classifier, data):\n   feature_columns = []\n   for i in range(len(data)):\n        feature_columns.append(\n          tf.feature_column.numeric_column(key=str(i))\n        )\n```\n\n```\n    feature_spec = tf.feature_column.make_parse_example_spec(\n                     feature_columns\n                   )\n```\n\n```\n    # Build receiver function, and export.\n    serving_input_receiver_fn = tf.estimator.export.\n        build_parsing_serving_input_receiver_fn(feature_spec)\n    export_dir = classifier.export_savedmodel(\n                   'export', serving_input_receiver_fn\n                 )\n    print(export_dir)\n```\n\nなんと「export/1562177753」にそれらしきファイルができた。ファイルはバイナリーでそのままでは読めなかったので、これの中身を調べる方法を探すと、**saved_model_cli**というコマンドがある。実行すると、中に見慣れた文字列が。\n\n```\n$ saved_model_cli show --dir export/1562177753 --all\n…\n outputs['logits'] tensor_info:\n dtype: DT_FLOAT\n shape: (-1, 8)\n name: dnn/logits/BiasAdd:0\n…\n```\n\nこれは良いものなのでは? 早速[tflite_convertコマンド](https://www.tensorflow.org/lite/convert/cmdline_examples)にかけて、Tensorflow Liteのモデルに変換してみる。\n\n```\n$ tflite_convert --output_file=./model1.tflite --saved_model_dir=export/1562177753\n…\nSome of the operators in the model are not supported by the standard TensorFlow Lite runtime. If those are native TensorFlow operators, you might be able to use the extended runtime by passing — enable_select_tf_ops, or by setting target_ops=TFLITE_BUILTINS,SELECT_TF_OPS when calling tf.lite.TFLiteConverter(). Otherwise, if you have a custom implementation for them you can disable this error with — allow_custom_ops, or by setting allow_custom_ops=True when calling tf.lite.TFLiteConverter(). Here is a list of builtin operators you are using: CONCATENATION, EXPAND_DIMS, FULLY_CONNECTED, PACK, RESHAPE, SHAPE, SOFTMAX, STRIDED_SLICE, TILE. Here is a list of operators for which you will need custom implementations: AsString, ParseExample.\n```\n\nTensorflow Liteのランタイムには存在しないオペレーター(ここではAsStringとParseExample)を使っているので、変換できませんと。使っているのは誰なのかもよくわからんので、とにかくググる。[ParseExampleに関しては、このSOの答え](https://stackoverflow.com/a/55693825)が見つかった。export_saved_modelするときのやり方を少し変えればいいっぽい。やってみる。\n\n```\n# feature_columns = []\n# for i in range(len(data)):\n#     feature_columns.append(tf.feature_column.numeric_column(key=str(i)))\n```\n\n```\n# feature_spec = tf.feature_column.make_parse_example_spec(feature_columns)\n```\n\n```\n# Build receiver function, and export.\n # serving_input_receiver_fn = tf.estimator.export.build_parsing_serving_input_receiver_fn(feature_spec)\n```\n\n```\nfeatures = {}\nfor i in range(len(data)):\n    key = str(i)\n    features[key] = tf.convert_to_tensor(np.array(data[i]))\n```\n\n```\nserving_input_receiver_fn = tf.estimator.export.build_raw_serving_input_receiver_fn(features)\n export_dir = classifier.export_savedmodel('export', serving_input_receiver_fn)\n```\n\n無事export/1562179024にファイルができたので、先ほどのsaved_model_cliコマンドで中身をみてみるとだいぶ内容が変わっていた。まあ気にせずtflite_convertを再度実行してみる。\n\n```\n$ tflite_convert — output_file=./model1.tflite — saved_model_dir=export/1562179024\n…\nValueError: No ‘serving_default’ in the SavedModel’s SignatureDefs. Possible values are ‘predict’.\n```\n\nさっきのSOの答えに書いてあったのはこれか、ということでオプションを足して再度実行。SOに書いてあるのとはオプションの名前が違った(signature_def_keyではなくsaved_model_signature_key)。\n\n```\n$ tflite_convert --output_file=./model1.tflite --saved_model_signature_key=”predict” --saved_model_dir=export/1562179024\n…\nSome of the operators in the model are not supported by the standard TensorFlow Lite runtime. If those are native TensorFlow operators, you might be able to use the extended runtime by passing — enable_select_tf_ops, or by setting target_ops=TFLITE_BUILTINS,SELECT_TF_OPS when calling tf.lite.TFLiteConverter(). Otherwise, if you have a custom implementation for them you can disable this error with — allow_custom_ops, or by setting allow_custom_ops=True when calling tf.lite.TFLiteConverter(). Here is a list of builtin operators you are using: ARG_MAX, CAST, CONCATENATION, FULLY_CONNECTED, RESHAPE, SOFTMAX. Here is a list of operators for which you will need custom implementations: AsString.\n```\n\nParseExampleは使わなくなったけど、AsStringはまだエラーのまま。 — allow_custom_opsをつけて実行すればmodel1.tfliteはできるけども、これを先ほどのTensorflow Liteのコードに読み込むと以下のエラーで結局使えない。\n\n```\nValueError: Didn’t find custom op for name ‘AsString’ with version 1\nRegistration failed.\n```\n\nAsStringなんて簡単に実装できるんじゃないのかと思って[custom operatorを自分で実装する方法のドキュメント](https://www.tensorflow.org/lite/guide/ops_custom)を読んでみたけども、C++で書いてTensorflow全体をビルドしなおすってこと? よくわからんが手に負えなさそうなのでやめて、AsStringを使わないような変換を行う方法を探してみる。\n\nもう一度saved_model_cliを実行してみると、中にDT_STRING型の値を出力するtensorがあるのを見つけた。\n\n```\noutputs[‘classes’] tensor_info:\n dtype: DT_STRING\n shape: (-1, 1)\n name: dnn/head/predictions/str_classes:0\n```\n\nカテゴリー分けしたときのカテゴリー名(ラベル)を持っているのだろうか、よくわからないが使わないのでこれをモデルに含まないようにすればいいんじゃないかと。\n\ntflite_convertコマンドにはoutput_arrayというオプションがあって、これにtensorの名前を指定できるらしい。とりあえず今出力して欲しいのは予測結果だけなので、同じsaved_model_cliの出力にあった「dnn/head/predictions/probabilities:0」だけが出てくればいいやということで、output_arrayに指定してみる。\n\n```\n$ tflite_convert — output_file=./model1.tflite — saved_model_signature_key=”predict” — saved_model_dir=export/1562179024 — output_array=dnn/head/predictions/probabilities:0\n…\nValueError: Invalid tensors ‘dnn/head/predictions/probabilities:0’ were found.\n```\n\nエラー。いや待てよ、さっきダンプしたoutput_detailsによると、このtensorの名前は「dnn/head/predictions/probabilities」みたい。\n\n```\n[{‘index’: 51, ‘shape’: array([1, 8], dtype=int32), ‘quantization’: (0.0, 0L), ‘name’: ‘dnn/head/predictions/probabilities’, ‘dtype’: &lt;type ‘numpy.float32’&gt;}]\n```\n\nというわけで「:0」を除いてみる。\n\n```\n$ tflite_conver --output_file=./model1.tflite --saved_model_signature_key=”predict” --saved_model_dir=export/1562179024 --output_array=dnn/head/predictions/probabilities\n```\n\nできた。おお、できたよ。再度[Tensorflow Liteで予測するスクリプト](https://gist.github.com/fumiakiy/a86a834352c1c2c5a8305e46b3a5e751)を実行してみると実行自体はできた。出力は相変わらず意味がよくわからないけど。\n\n```\n$ python tflite1.py\n```\n\n```\n[[0.11178369 0.10516622 0.11024905 0.13274346 0.10095505 0.15692514\n 0.09929805 0.18287939]]\n```\n\n### Tensorflow Liteのモデルに入力する値\n\n同じモデルに色々な文字のデータを入れて試してみても、何か腹落ちするデータが得られないことがしばらく続いて、そろそろやる気もなくなって来たころ。\n\n何か変だなと思っていたのは、LiteではないTensorflowのclassifierを使ったテストではそれなりに当たりの予測を出すことが多いのに、なぜかLiteになると全然当たらないということ。渡している入力値がおかしいんだろうか。\n\nもう一度saved_model_cliの出力を見直すと、saved modelを使っていなかったときのコード(Tensorflow Liteのクラスとメソッドを使ってclassifierオブジェクトを直接変換したコード)では入力tensorとして「dnn/input_from_feature_columns/input_layer/concat」を使っていて、それに対して現状のsaved_model_cliの出力の中にはそういう入力tensorは存在せず、代わりに「Const_1」「Const_2」というtensorが全部で51個あるのがわかった。**51個**。これはこっちが渡そうとしている1つ1つのデータを入れる場所に違いないので、ループでset_tensorしている今のコードで大丈夫のはず…なんだけど、[input_details[i][‘index’]と、配列の添字ではなくあえてオブジェクトのindexキーを使ってデータをセットしている](https://gist.github.com/fumiakiy/a86a834352c1c2c5a8305e46b3a5e751)のはなんでなんだろう、と思いついて、input_detailsの中身をダンプしてみると、\n\n```\n[\n{‘index’: 0, ‘shape’: array([1], dtype=int32), ‘quantization’: (0.0, 0L), ‘name’: ‘Const’, ‘dtype’: &lt;type ‘numpy.int64’&gt;},\n{‘index’: 2, ‘shape’: array([1], dtype=int32), ‘quantization’: (0.0, 0L), ‘name’: ‘Const_10’, ‘dtype’: &lt;type ‘numpy.int64’&gt;},\n{‘index’: 3, ‘shape’: array([1], dtype=int32), ‘quantization’: (0.0, 0L), ‘name’: ‘Const_11’, ‘dtype’: &lt;type ‘numpy.int64’&gt;}, …\n```\n\n0番の要素のindexは0だけど、1番の要素のindexは2になっているし、名前もConst_10でConst_1ではない! ということは、テストデータの1番要素の値をinput_details[1][‘index’]に入れてしまうと、1番のtensorにセットすべき値を2番のtensor(本来10番要素の値を入れる場所)にセットしていることになってしまうのでは?\n\n配列の要素とtensorの並びを正規化して、それから正しいtensorに値をset_tensorするようにコードを書き直してみた。\n\n```\n# for i in (range(len(y) — 1)):\n#     interpreter.set_tensor(input_details[i]['index'], [y[i]])\n```\n\n```\nindices = [0] * 51\nfor detail in input_details:\n    vindex = 0\n    m = re.match(r'Const_(\\d+)', detail['name'])\n    if (m is None):\n        vindex = 0\n    else:\n        vindex = int(m.group(1))\n    indices[vindex] = detail['index']\n```\n\n```\nfor i in range(len(y)-1):\n    interpreter.set_tensor(indices[i], [y[i]])\n```\n\n実行してみる。\n\n```\n$ python tflite1.py\n```\n\n```\n[[0. 0. 0. 0. 0. 0. 0. 1.]]\n```\n\nおお、yをyと予想したっぽい! yをeにして再度実行してみる。\n\n```\n# for i in range(len(y)-1):\n#     interpreter.set_tensor(indices[i], [y[i]])\nfor i in range(len(e)-1):\n    interpreter.set_tensor(indices[i], [e[i]])\n```\n\n```\n$ python tflite1.py\n```\n\n```\n[[0. 0. 0. 0. 1. 0. 0. 0.]]\n```\n\neも正しく予測している! このTensorflow Liteのモデルは良いものなのでは? Androidアプリで実行してみよう!\n\nというわけで次回へ続く。\n\n"},{"frontmatter":{"slug":"/blog/2019-06-15_Levi-s-Commuter-Trucker-Jacket-with-Jacquard-by-Google----------------1ae6347c67fc","date":"Sat, 15 Jun 2019 15:44:21 GMT","title":"Levi’s Commuter Trucker Jacket with Jacquard by Googleの袖を手書き認識デバイスにする","epoch":"1560613461","excerpt":"ジャケット（についてるsnap tag）からJacquardの糸に触れたときの連続的なデータを使って遊んでみる。"},"markdownBody":"\n### Levi’s Commuter Trucker Jacket with Jacquard by Googleの袖を手書き認識デバイスにする\n\n[前回まで](/blog/2019-06-01_Levi-s-Commuter-Trucker-Jacket-with-Jacquard-by-Google------------8b56fb4732d7)のコードで、ジャケット（についてるsnap tag）から飛んでくる情報、特にJacquardの糸に触れたときのなんというか連続的なデータをアプリで取得できるようになった。今のところこの情報は公式アプリでもデモ目的以外には使われていなくて、Double TapやBrush In/Outなどのイベントはsnap tag側で先に判別された上で、そのIDがある種デジタルな、離散的な値として飛んできて、公式アプリはそれに対して反応することができるだけになっている。\n\n連続的なデータを使って何かできないかということで思いついたのが、袖をなぞって発生する一連のデータを文字として認識させて、キーボードのように使えるようにすること。それを実現するために、何度もある文字をなぞったデータを機械学習にかけて、15本の糸のなぞられ方から文字を判別するモデルを作成して、あわよくばそれをアプリ上で実行してキーボードのように使う。\n\n機械学習とかやったことないしPythonもほとんど書いたことないのだが、まあStackoverflowでなんとかなるだろうと思って始めてみた。\n\n### 学習用データの収集\n\n学習させたいデータがないと学習させられないので、まずはデータを作る。最初は糸1本ごとの触られっぷりを示すらしき1バイトのデータをそれぞれカラムとして保存して、さらに1つの文字を書くのにある程度の数のデータが連続して送られてくるので、1文字の書き始めと書き終わりまでの系列データを並べた2次元の配列を考えた。一方の軸の大きさは15で固定で、もう一方の軸の大きさは文字の書き終わりまでに送られていたイベント数ということになる。\n\nこのアプリ上で、教師あり学習用のデータを作るためにa, b, cの文字ををそれぞれ10回程度ずつなぞって、書き終わるたびに1つの文字のデータとして記録して、ログを吐き出した。したがって吐き出されたデータはこんなのが並んでるファイルとして保存される。\n\n```\n0,0,c,d,0,1,2,3,4,5,0,0,0,0\n0,0,0,0,4,3,2,1,a,a,a,a,0,0\n0,0,0,0,c,d,0,1,2,3,4,5,0,0\n0,0,0,0,0,0,4,3,2,1,a,a,a,0\n…\n```\n\nさて少量ながらデータが集まったので、解析してみる。ググってStackoverflowして行くと、やろうとしていることはいわゆるカテゴリー（クラス）分けで、「教師あり学習で分類を行う」ということになるらしい（反対語? は「教師なし学習」「回帰」らしい）。”supervised classification algorithm” とか、さらに”small dataset”で検索してみると、support vector machine (SVM) またはNaive Bayesというアルゴリズムがあること、これらのアルゴリズムをお手軽に使えるツールとしてscikit-learnというのが使えることがわかった。scikit-learnがPythonで使えるモノであるということは知ってるし、Naive BayesアルゴリズムはCPANモジュールもあって前職でお遊びながら使ったことがあった、という程度の知識でスタート。\n\n### scikit-learnで使える学習データを作る\n\nscikit-learnとNaive Bayesで検索してみるといくつか入門記事が見つかるのだが、そのほとんどが[irisつまりアヤメのデータからそのアヤメの分類を当てるという例](https://www.ritchieng.com/machine-learning-iris-dataset/)が出てくるので、とりあえずそれをやってみる。写経して動かして、ははあなるほど、と。\n\n次にirisのデータを自分のデータに置き換える方法を探ってみる。irisのデータは1つの種ごとに4つのカラム（petalのwidthとlength, sepalのwidthとlength）があって、それらが3種類のアヤメに分けられるらしい。それをこんな風にデータ化している。\n\n```\n[\n [ 5.1 3.5 1.4 0.2]\n [ 4.9 3. 1.4 0.2]\n [ 4.7 3.2 1.3 0.2]\n [ 4.6 3.1 1.5 0.2]\n [ 5. 3.6 1.4 0.2]\n …\n]\n```\n\nこちらが使いたいデータはさっき書いたように1つの文字に対して2次元の配列になっている。こういう風に単純に置き換えて渡してみてもエラーになる。\n\n```\n[\n [\n [0,0,12,13,0,1,2,3,4,5,0,0,0,0],\n [0,0,0,0,4,3,2,1,10,10,10,10,0,0],\n [0,0,0,0,12,13,0,1,2,3,4,5,0,0],\n [0,0,0,0,0,0,4,3,2,1,10,10,10,0],\n …\n ],\n …\n]\n```\n\n```\nValueError: Found array with dim 3. Expected &lt;= 2\n```\n\n次元が多すぎるってことで、次元を減らすために適当にググって見つけたこんなコードで適当に次元を減らす。\n\n```\nX = X.reshape(X.shape[0], -1)\n```\n\n一応走りはするものの、こんな次元の減らし方では特徴を正しく捉えたデータになっているとは思えない。\n\nつまり、糸1本1本を別のカラム（次元）として扱うとこれら連続データをただしく渡せないことがわかったので、データの取り方を変えて、1イベントにつき1列で15本の糸のデータを表す値を作ることにした。具体的にはこんな感じで0本目の糸のデータには2**0を、1本目の糸のデータには2**1をそれぞれかけて…とやって1つの大きな数値を作ることにした。これで意味が失われていないのかすごく疑問だが、まあドンマイ。\n\n```\nvar data = 0\nbytes.forEach { byte -&gt;\n val digit = Math.pow(2.toDouble(), (bytes.size — 1).toDouble())\n data += Math.ceil(digit * byte).toInt()\n}\n```\n\nこうして、1つの文字に対してこんな数値が並んだデータを再度a, b, cごとに10ずつくらい作り直して、Python再開。\n\n```\n5931008,\n5308416,\n5013504,\n3473408,\n…\n```\n\n### scikit-learnでモデルを作る\n\nさっきと同じように、irisのデータを作っている箇所を自分のデータ用に変形してみる。当然ながら、それぞれの文字のそれぞれの学習データの大きさは同じでないといけないので、適当にファイルをいくつか眺めて、1つの文字のデータ行数を51にして、連続する同じデータはすべて削ってしまうことにした。これもデータの意味を消してしまっている気がするがドンマイ。\n\nPerlスクリプトをちょいちょい書いてデータを揃えたら、そのファイルをPythonで読み取って、データを食わせてテストしてみる。データ数が少なすぎるし信頼性は低いけど、とりあえずできた。\n\n```\nimport os\nimport re\n```\n\n```\nimport numpy as np\n# from sklearn.svm import SVC\nfrom sklearn.naive_bayes import GaussianNB\nfrom sklearn.model_selection import train_test_split\n```\n\n```\nLABELS = [‘a’, ‘b’, ‘c’]\n```\n\n```\n# read all data and make an array of array of data\npath = ‘./normalized/’\ndata = {‘a’: [], ‘b’: [], ‘c’: []}\nfor f in os.listdir(path):\n datum = []\n m = re.match(r’(\\w)_(\\d)\\.txt’, f)\n if (m is None):\n continue\n char = m.group(1)\n with open(os.path.join(path + f), ‘r’) as lines:\n for line in lines:\n datum.append(int(line.rstrip()))\n data[char].append(datum)\n```\n\n```\n# construct the ml stuff\n```\n\n```\ntarget = []\nsamples = []\nfor char, ar in data.items():\n for datum in ar:\n target.append(LABELS.index(char))\n samples.append(datum)\n```\n\n```\n# clf = SVC()\nclf = GaussianNB()\nX = np.array(samples)\ny = np.array(target)\nX_train, X_test, y_train, y_test = train_test_split(samples, target, test_size=0.1, random_state=0)\n```\n\n```\nclf.fit(X_train, y_train)\nprint clf.score(X_train, y_train)\n```\n\n```\nprint clf.predict(X_test)\nprint y_test\n```\n\n```\n$ python t1.py\n0.7941176470588235\n[2 0 2 0]\n[2, 1, 2, 2]\n```\n\n### Tensorflowで同じことをやってみる\n\n目的は作ったモデルをAndroidアプリにデプロイして、入力されたデータから文字を推測することなので、scikit-learnで作ったモデルだとやりづらそう。\n\nTensorflowでモデルを作ればTensorflow LiteでAndroidアプリ上で利用できることは知っていたので、scikit-learnで作ったモデルをTensorflowのモデルに変換できるのかを調べたが、まあよくわからないけど簡単にはできませんよね。Tensorflowはニューラルネットワークのためのもので、SVCとかGaussianNBとかはそうじゃないとかなんとかよくわからん。\n\nそれじゃあTensorflowで似たような感じで分類を行うことはできるのかと思って、”Tensorflow iris”とかでググったら[TensorflowにもDNNClassifierというものがあってアヤメの分類ができる](https://www.tensorflow.org/guide/premade_estimators)らしい。早速それを行なっているコードをサンプルから探して、実行してみて、自分のデータで置き換えてみるというさっきと同じ作業を今度はTensorflowのコードでやってみる。まあ[できたのはできた](https://gist.github.com/fumiakiy/cc9107e2f4b66dbc0a20ee1eabc04dc1)。全然当たってないけど。\n\n```\n$ python tf.py\n```\n\n```\nTest set accuracy: 0.788\n```\n\n```\nPrediction is “2” (100.0%), expected “2”\n```\n\n```\nPrediction is “2” (66.6%), expected “0”\n```\n\n```\nPrediction is “2” (66.6%), expected “1”\n```\n\n### 文字を増やす\n\nここまでやっている間ずっと心配に思っていたのは、aと**d**やbと**h**やcと**e**を本当にこんなデータで区別できるのかということ。そこで、d, e, h, o, yの5つの文字をさらに10ずつくらいログにとって、同じPerlスクリプトで整形して、[scikit-learnのコード](https://gist.github.com/fumiakiy/b8018b441d51639d3690ad003bebce0a)にかけてみた。\n\n```\n$ python sk2.py\n0.49504950495049505\n[6 1 0 1 6 0 6 5 0 1 6 4]\n[6, 0, 2, 0, 6, 3, 3, 7, 2, 0, 5, 4]\n```\n\nそこそこ? [Tensorflowでやってみる](https://gist.github.com/fumiakiy/c1f8fe23b36b0a8984a12cd2bb54cd0e)とどうだろう。\n\n```\n$ python tf2.py\n```\n\n```\nTest set accuracy: 0.195\n```\n\n```\nPrediction is “4” (15.8%), expected “2”\n```\n\n```\nPrediction is “4” (15.8%), expected “0”\n```\n\n```\nPrediction is “4” (15.8%), expected “1”\n```\n\nガーン。ものの見事に全然区別できてない。ニューラルネットワーク様にはもっとたくさんデータを食わせないとダメなのかあとか思いながら、アルゴリズムを変えてみたりあーだこーだしていてふと気づいた。DNNClassifierに渡している「hidden_units」ってなんだ。\n\nニューラルネットワークでディープラーニングってのは、[それっぽい絵](https://www.mapleprimes.com/maplesoftblog/209354-A-Beginners-Guide-To-Using-The-DNN)を見てみると、入力から出力の間に通る場所をいくつも作っていくものらしい。どこかのサンプルから写経した[10, 10]を渡しているけど、これはニューラルネットワークのinputとoutputの間にあるよくわからん神経ノードの数と層を表しているのだから、ここを増やせば精度が上がるんじゃないか? データも少ないし、適当に[20, 40, 20]などと渡してみた（前掲リンク先のを真似した）。\n\n```\n$ python tf2.py\nTest set accuracy: 0.929\n```\n\n```\nPrediction is “2” (100.0%), expected “2”\n```\n\n```\nPrediction is “0” (100.0%), expected “0”\n```\n\n```\nPrediction is “1” (48.4%), expected “1”\n```\n\n…精度が急上昇しました。\n\nちょっと本当かなと思って、[20, 40, 80, 40, 20]とかも渡してみたら精度が1.000のオール100%なんてことになったこともあったんだけど、こんな程度のデータ量だと(?)試行するたびに全然違う数値が出てくるので、一喜一憂しても仕方ない。このままデータを増やしていっても、aとdをより精度高く判別できるようになるとは正直思えないし。\n\nだが、まあとりあえず小文字のアルファベットのデータを全部作って、できたモデルをTensorflow Liteに乗せてAndroidで実行してみるモチベーションが湧くくらいの精度ではあるので、次に進もうと思う。\n\n[Levi’s Commuter Trucker Jacket with Jacquard by Googleの袖から来たデータを機械学習してAndroidアプリで利用できるモデルを作る](/blog/2019-07-04_Levi-s-Commuter-Trucker-Jacket-with-Jacquard-by-Google----------------Android----------------a4747b4edca5)へ続く。\n\n"},{"frontmatter":{"slug":"/blog/2019-06-01_Levi-s-Commuter-Trucker-Jacket-with-Jacquard-by-Google------------8b56fb4732d7","date":"Sat, 01 Jun 2019 15:09:41 GMT","title":"Levi’s Commuter Trucker Jacket with Jacquard by Googleを操る自作アプリを作る","epoch":"1559401781","excerpt":"スマートジャケットからの情報を得て何かするAndroidアプリを作ってみる"},"markdownBody":"\n### Levi’s Commuter Trucker Jacket with Jacquard by Googleを操る自作アプリを作る\n\n### LEDを思いどおりに光らせる\n\n[前回](/blog/2019-05-12_Android----------Bluetooth------------5844e20b5b98)までで書いたとおり、公式アプリとsnap tagとの通信をWiresharkでのぞいて見て、同じ値を自作アプリから同じBluetooth serviceの同じcharacteristicに送りつけてみたら同じように光ったので、同様の手順で公式アプリがサポートしている3種類の光らせ方とその値をメモってみた。すると、一部だけ異なる値を送っていることがわかった。何度も同じ光らせ方をさせてみると、その度に変わる部分と、光らせ方が同じなら変わらない部分があることもわかった。そういうわけで、こういう単純なコードで、3種類のうちから希望の光らせ方をする値を作って送りつけることはできるようになった。\n\n```\nfun valueToWrite(command: Command): ByteArray {\n  val b = UByteArray(19)\n  \n  // It seems these two bytes varies among snap tags\n  b[0] = 0xc0U\n  b[1] = 0x11U\n  \n  // Together with these 5 bytes, the first 7 bytes could be a tag's id?\n  b[2] = 0x08U\n  b[3] = 0x00U\n  b[4] = 0x10U\n  b[5] = 0x08U\n  b[6] = 0x18U\n  \n  // The 8th byte seems like an id of the command.\n  b[7] = sequenceId\n  \n  // The next 4 bytes don't seem to change\n  b[8] = 0xdaU\n  b[9] = 0x06U\n  b[10] = 0x08U\n  b[11] = 0x08U\n  \n  // The 13th byte seems like the command\n  b[12] = command.value\n  \n  // The following 6 bytes don't seem to change\n  b[13] = 0x10U\n  b[14] = 0x78U\n  b[15] = 0x30U\n  b[16] = 0x01U\n  b[17] = 0x38U\n  b[18] = 0x01U\n  \n  return b.toByteArray()\n}\n```\n\n```\n...\ncharacteristic.setValue(valueToWrite(command))\ngatt?.writeCharacteristic(characteristic)\n```\n\n### ジェスチャーを取得する\n\n次に、これも公式アプリでサポートされている、Jacquardの糸を触ることで通知を受け取る機能を実装してみる。LEDを光らせるのは自作のアプリからsnap tagへ向けてデータをwriteすればよかったのだが、これをするにはBluetoothの通知機能を利用しないといけない。具体的には、snap tagが出しているserviceのうちどのcharactersticがこの通知を発信しているのかを探し出して、それに対して通知を有効にした上で、callbackのメソッドで値を受け取る。\n\n```\nval CLIENT_CONFIG_DESCRIPTOR_UUID = \"00002902-0000-1000-8000-00805f9b34fb\"\n```\n\n```\njacquardService?.characteristics\n  ?.forEach { characteristic -&gt;\n    characteristic.descriptors?.filter {\n      it.uuid == UUID.fromString(CLIENT_CONFIG_DESCRIPTOR_UUID)\n    }\n    ?.lastOrNull()?.let { desc -&gt;\n      desc.setValue(BluetoothGattDescriptor.ENABLE_NOTIFICATION_VALUE);\n      gatt?.writeDescriptor(desc);\n      gatt?.setCharacteristicNotification(desc.characteristic, true)\n    }\n  }\n```\n\n```\n...\n  override fun onCharacteristicChanged(gatt: BluetoothGatt?, c: BluetoothGattCharacteristic?) {\n    Timber.d(\"changed ${c?.uuid}: ${c?.value?.size} == ${c?.value?.map { b -&gt; String.format(\"%d\", b) }?.joinToString(\":\")}\")\n  }\n```\n\nとりあえず通知をしてくるcharacteristicすべてをlistenしてログを見ようとやってみたのだが、どうもそれらしき通知がこない。あるcharacteristicからの通知しかこなくて、その値は明らかに別の用途のものだった。\n\nひとしきりうなってからググると答えがすぐに見つかった。通知を受け取るには、characteristicのdescriptorに対して通知を有効にするように値を書き込む必要があるのだが、ある書き込み要求が完了するまで次の書き込みはできないらしい。つまり、descriptorWriteが完了したというcallbackのメソッドの中で次の書き込みをしないとならない。連続ですべてのcharacteristicに対して通知を設定しようとしていたので、リストの先頭のcharacteristicのものしか設定されていなかった。\n\nちょいちょいとテキトーにコードを書き直したところ、他の通知も来るようになり、ジェスチャーが発生したときの通知は「d45c2030–4270-a125-a25d-ee458c085001」のcharacteristicであること、ジェスチャーそれぞれに以下のような値が割り当てられていることがわかった。\n\n```\nenum class GESTURE(val raw: ByteArray) {\n  DOUBLE_TAP(ByteArray(1, { i -&gt; 0x1 })),\n  BRUSH_IN(ByteArray(1, { i -&gt; 0x2 })),\n  BRUSH_OUT(ByteArray(1, { i -&gt; 0x3 })),\n  COVER(ByteArray(1, { i -&gt; 0x7 })),\n  BRUSH_OUT_IN(ByteArray(1, { i -&gt; 0x8 })),\n  UNKNOWN(ByteArray(1, { i -&gt; 0x0 }))\n}\n```\n\nおもしろいことに、公式アプリでは使われていないもう1つのジェスチャー（BRUSH_OUT_IN）が存在した。たまたまBRUSH_OUTした後に惰性で少し触り続けていたら違う値が飛んできたのでわかったのだが、OUTした後INする動作を連続で行うとこのジェスチャーが認識される。公式アプリで使われていないのは、多分他のジェスチャーと混同しちゃうからだと思う。BRUSH_OUTはジェスチャーと認識されるまで少しラグがあるっぽいのもこれのせいか。\n\n### 「生」データを取得する\n\nさっきジェスチャーの通知を取得しようとしていて別の用途の通知が来たと書いたが、それがなんで別の用途だとわかったかというと、とにかくJacquardの「糸」に触れると何発も飛んでくるからだった。これは明らかに糸を触ったときのデータが来てる。つまり、決められたジェスチャーについてのデジタルなデータだけではなく、触った糸についてのある種アナログな情報も通知が来るということ。これも公式アプリにそれっぽい画面があるので、そういう情報も取れることは想像できるのだけども。\n\nこの生データ、18バイトのデータが来るのだが、先頭の1バイトは明らかにシーケンス番号で、次の2バイトは割と固定のデータで、残りの15バイトの値が触り方によってずいぶん変化する。糸を数えてみるとやっぱり15本。というわけで、3から18までのインデックスの値が糸の触り方を示すっぽい。\n\nそこで公式アプリと同じような、[こんな感じの見た目のViewを作ってみた](https://www.youtube.com/watch?v=aBNK_TGtYTUところそれっぽい動きが見えるようになった。\n\nこの値をどう使うかについてちょっとアイデアが浮かんだのでやってみたいんだけど、時間と手間が掛かりそうでうーん。とりあえずは、ここまでの調査でできたものを、コードをきちんと書き直して公開するのを先にやろうかな。とはいえこのジャケットを持っている人が少ないしコードを書く人はもっと少なそうだから公開しても誰の役にも立たなそうだけども。\n\n[Levi’s Commuter Trucker Jacket with Jacquard by Googleの袖を手書き認識デバイスにする](/blog/2019-06-15_Levi-s-Commuter-Trucker-Jacket-with-Jacquard-by-Google----------------1ae6347c67fc)へ続く。\n\n"},{"frontmatter":{"slug":"/blog/2019-05-12_Android----------Bluetooth------------5844e20b5b98","date":"Sun, 12 May 2019 15:43:30 GMT","title":"AndroidアプリとデバイスとのBluetoothでの通信内容を解析する","epoch":"1557675810","excerpt":"Levi’s Commuter Trucker Jacket with Jacquard by Google を手に入れたの続き。"},"markdownBody":"\n### AndroidアプリとデバイスとのBluetoothでの通信内容を解析する\n\n[Levi’s Commuter Trucker Jacket with Jacquard by Google を手に入れた](/blog/2019-05-05_Levi-s-Commuter-Trucker-Jacket-with-Jacquard-by-Google--------f37ae5a4cde5)の続き。\n\nJacquardのジャケットとsnap tagの機能を利用するAndroidアプリを作るために、まずは公式アプリでは何をどうやっているのかを調べてみた。前回の記事で触れたとおり、JacquardのサービスのUUIDといくつかのcharacteristicのUUIDはわかったので、それらに向けていつどんなデータが飛んでいるのか、特にLEDを光らせるコマンドはどうやって送られているのかを調べる。\n\n### AndroidでBluetoothログを取る\n\nまずは、公式アプリで3つのうちのどれかのアクションにLightを割り当てておく。\n\nまた、Androidの設定で[Developer Optionsの中にある「Enable Bluetooth Host Controller Interface (HCI](https://developer.android.com/studio/debug/dev-options) snoop log」をオンにして)、Bluetoothを切って再度オンにしてやる。これでBluetoothでの通信内容がログに保存される。\n\nそうしてから、Jacquardの3種類のLEDモード（白く光らせるFlash Light、赤く点滅させるSignal、7色?に回転するParty?）を順番に割り当てて、実際に動作させてみる。するとそれぞれの動作は、どれも起動してから30秒で自動終了すること、また実行中にもう一度同じことをする（Brush Inするとか）と停止できることがわかった。\n\nそれぞれの動作を行った時間をなんとなく記録して、adbでデバイスからBluetoothログを取得する。[ドキュメント](https://developer.android.com/studio/debug/dev-options)には「Captures all Bluetooth HCI packets in a file stored at “/sdcard/btsnoop_hci.log”」って書いてあるんだけども、最近のAndroidではこのファイルが作られるわけではなく、ログを見るにはbugreportするのが正解らしい。\n\n`adb bugreport hoge`とやると、hoge.zipが落ちてくるので、`unzip hoge.zip FS/data/misc/bluetooth/logs/btsnoop_hci.log`してログを手に入れた。\n\n### WiresharkでBluetoothログ解析\n\n`btsnoop_hci.log`はそのまま人間が読むためのテキストログではないのだけど、幸いなことに[Wireshark](https://www.wireshark.org/)がいい感じにやってくれるので、Wiresharkでファイルを開く。だいたいこんな時間帯にこれをやったよな、ってあたりのログを見て、それらしき通信を探す…\n\n探す…んだけど、[前回あたりをつけた](/blog/2019-05-05_Levi-s-Commuter-Trucker-Jacket-with-Jacquard-by-Google--------f37ae5a4cde5)サービスやcharacteristicのUUIDが全然見つからなかった。あたりはハズレでした。\n\nしかたないので、それらしき時間帯で共通に発生しているらしくて、他の時間帯には発生していないと思われる、ような気がするかもしれない感じのログエントリーを探してみる。すると、snap tag上のサービス「d2f2bf0d-d165–445c-b0e1–2d6b642ec57b」、characteristic「d2f2eabb-d165–445c-b0e1–2d6b642ec57b」に対して謎の値をwriteしていることがわかった。\n\nさらに、その謎の値をwriteした後すぐに、同じサービスの同じcharacteristicから別の値をreadしていること、その30秒後にまた同じサービスの同じcharacteristicから別の値をreadしていることが判明する。しかも3種類のLEDの光らせ方それぞれを行った時間帯にそれぞれ、writeとreadの値だけが異なる通信をしている。これは怪しい。\n\n何度かLEDを光らせてはログを取ってみると、これらの値は毎回若干異なるもののある種のパターンがあり、全然変わらない部分、毎回変わる部分、光らせ方によって変わる部分があることがわかった。例えば赤点滅モードの場合の値は「c0110800100818**06**da060808**20**107830013801」だったり「c0110800100818**1a**da060808**20**107830013801」だったりするが、Partyモードの値は「c0110800100818**05**da060808**10**107830013801」だったり「c0110800100818**1b**da060808**10**107830013801」だったりする。\n\nそこで、とりあえず自作Androidアプリから同じUUIDsに対してログと同じような値を送りつけてみたらどうなるか、やってみることにした。\n\n### Bluetooth Low Energyのperipheralにコマンドを送る\n\nこんな感じのコードを書いて、BLEデバイスを見つけて、接続して、characteristicを取得して、それに値を書きこんでみる。これが動けば、`startScan`してすぐにsnap tagが光るはず…。\n\n```\nprivate val blinkInRed: ByteArray get() { ... }\n```\n\n```\nprivate val bluetoothAdapter: BluetoothAdapter? by lazy(LazyThreadSafetyMode.NONE) {\n  val bluetoothManager = getSystemService(Context.BLUETOOTH_SERVICE) as BluetoothManager\n  bluetoothManager.adapter\n}\n```\n\n```\nprivate var scanner: BluetoothLeScanner? = null\nprivate var gatt: BluetoothGatt? = null\n```\n\n```\nfun startScan() {\n  scanner = bluetoothAdapter?.bluetoothLeScanner\n```\n\n```\n  val filter = ScanFilter.Builder()\n    .setServiceUuid(ParcelUuid(SERVICE_UUID))\n    .build()\n  val option = ScanSettings.Builder()\n    .setScanMode(ScanSettings.SCAN_MODE_LOW_POWER)\n    .setCallbackType(ScanSettings.CALLBACK_TYPE_ALL_MATCHES)\n    .build()\n```\n\n```\n  // Start searching the service advertised from a device\n  // Get the result in `scanCallback` below\n  scanner?.startScan(listOf(filter), option, scanCallback)\n}\n```\n\n```\nprivate val scanCallback = object: ScanCallback() {\n  override fun onScanResult(\n    callbackType: Int,\n    result: ScanResult?)\n  {\n    result?.let {\n      // Found the service. Connect to the device\n      // Get the connection result in `gattCallback` below\n      gatt = it.device.connectGatt(context, false, gattCallback)\n    }\n  }\n}\n```\n\n```\nprivate val gattCallback = object: BluetoothGattCallback() {\n  override fun onConnectionStateChange(\n    gatt: BluetoothGatt?,\n    status: Int,\n    newState: Int)\n  {\n    if (status == BluetoothGatt.GATT_SUCCESS) {\n      when (newState) {\n        BluetoothProfile.STATE_CONNECTED -&gt; {\n          gatt?.let {\n           // Connected to the device. Lookup the service\n           // Results come in to `onServicesDiscovered` below\n           it.discoverServices()\n          }\n        }\n      }\n    }\n  }\n```\n\n```\n  override fun onServicesDiscovered(\n    gatt: BluetoothGatt,\n    status: Int)\n  {\n    when (status) {\n      BluetoothGatt.GATT_SUCCESS -&gt; {\n        gatt.getService(SERVICE_UUID)?.let { s -&gt;\n          // Found the service. Lookup the characteristic\n          s.getCharacteristic(CHARACTERISTIC_UUID)?.let { c -&gt;\n          // Set the binary value to the characteristic\n            c.setValue(blinkInRed)\n            // Write the value to the characteristic\n            // This should light up the LED on the snap tag\n            gatt?.writeCharacteristic(c)\n          }\n        }\n      }\n    }\n  }\n}\n```\n\nまあ光りませんよね。\n\nそもそもscanに成功しなくなった。それもそのはずで、公式アプリとsnap tagを接続してしまっていたので、snap tagはadvertisementをやめているぽかった。なので、いったん公式アプリでsnap tagをforgetし、Androidの設定からBluetoothデバイス「Jacquard」もforgetする。すると、scanに成功して、connectからcharacteristicを見つけるところまで進むようになった。\n\nが、やはり光らない。`writeCharacteristic`はtrueを返してきたりするんだけど、光らない。このアプリの通信をBluetoothのログをWiresharkで見てみたけど、送っている値や何かが間違っている気配はない。\n\nここで気になったのは2点。まず、Androidが執拗に「Jacquardからparing requestが来てるけどpairする?」というポップアップが出続けること。まあこれは無視していたんだけど、もう1点、もしこのコードが動作するようなら、そこいら辺にある他人のsnap tagを光らせ放題じゃないか?\n\n### Bluetooth Low Energyにおけるconnectとpairとbond\n\n当然なんだけど、BLEにはちゃんとセキュリティ、特に飛び交うデータの暗号化に関する仕様があって、それを理解しておけって話なんだけども、簡単にいうとググってこの[connecting, pairing and bondingに関する説明](https://devzone.nordicsemi.com/f/nordic-q-a/11939/connecting-bonding-pairing-and-whitelists/45217#45217)を発見して納得した。connectしただけで見られる情報だけでは（おそらく多くの場合で）デバイスの機能を利用することはできず、それをするには鍵交換を行った上でデータを暗号化してやりとりしなければならないと。\n\nとなると、Wiresharkで見た情報は鍵が変われば変わってしまうのでは? 鍵はperipheralとclientが同じでも毎回変わるのか?\n\nどうやってそれを調べられるのかわからないので、とりあえず公式アプリを一度アンインストールして、再度インストールして、接続してログを見てみた。値は変わっていなかった。これは多分違うAndroidデバイスだと違う値になるんだろうなあ、当然snap tagが変わればまた違う値になるんだろうなあ、となると、Wiresharkで見た値そのものを公開したところで、他の人はその値を使えないだろうなあ。でも「俺専用の俺アプリ」を作る分にはまあ動くのかも。\n\n### Let there be light\n\nというところまで考えたところで、Androidのドキュメントに戻って、[BluetoothDevice#setPin(byte[] pin](https://developer.android.com/reference/android/bluetooth/BluetoothDevice.html#setPin%28byte%5B%5D%29))と[BluetoothDevice#createBond(](https://developer.android.com/reference/android/bluetooth/BluetoothDevice.html#createBond%28%29))を見つけた。pinの値は、ジャケットを持っていれば知っているはずのアレで、ジャケットにくっついている。公式アプリはこれを入力しなくても値を表示してくれるので、snap tagはこの値もadvertiseしているはずなんだけど、それを探すのは後回し。\n\nそういうわけで、`discoverServices()`を呼び出す前に`setPin`と`createBond`を呼び出してしまう。\n\n```\ngatt?.let {\n  // Connected to the device. Pair, bond\n  it.device.setPin(myJacketPin)\n  it.device.createBond()\n  // And then lookup the service\n  // Results come in to `onServicesDiscovered` below\n  it.discoverServices()\n}\n```\n\n光った！光ったよ！Wiresharkで見た値をそのまま送りつけただけですが、無事光りました。\n\n本当は`createBond`の成否をBroadcastReceiverで受け取ってから操作しないといけないのだが、いったんbondしてしまえば次からはまあ速いので、こんなコードでもちゃんと動いた。\n\n[Levi’s Commuter Trucker Jacket with Jacquard by Googleを操る自作アプリを作る](/blog/2019-06-01_Levi-s-Commuter-Trucker-Jacket-with-Jacquard-by-Google------------8b56fb4732d7)へ続く。\n\n"},{"frontmatter":{"slug":"/blog/2019-05-05_Levi-s-Commuter-Trucker-Jacket-with-Jacquard-by-Google--------f37ae5a4cde5","date":"Sun, 05 May 2019 22:57:12 GMT","title":"Levi’s Commuter Trucker Jacket with Jacquard by Google を手に入れた","epoch":"1557097032","excerpt":"苦節4年、ついにスマート繊維を組み込んだ例のアレを手に入れて、早速少しコードを書いてみました。"},"markdownBody":"\n### Levi’s Commuter Trucker Jacket with Jacquard by Google を手に入れた\n\n苦節4年、ついにスマート繊維を組み込んだ例のアレを手に入れて、早速少しコードを書いてみました。\n\n![Levi’s Commuter Trucker Jacket with Jacquard by Google](/images/1*Ox5jDQ5gm-Bmf7YJH8TBkQ.jpeg)\n\n### Levi’s Commuter Trucker Jacket with Jacquard by Googleとは\n\nあれはもう4年前。Google I/O 2015で発表されたJacquardプロジェクトで「スマート繊維」というコンセプトが発表された。\n\nGoogle I/O 2015の後にたまたま[Rebuild.fm](https://rebuild.fm)に呼んでいただいて、[ほんの少しだけこれの話をして](https://rebuild.fm/94/)いて、このときからずーっと気になっていた。もっともこのときは、ジーパンに組み込まれるとばっかり思ってて、「太ももにこれが入っててもガサガサ触っちゃう」みたいなことを言っていたけど。\n\n1年経って、Google I/0 2016でLevi’sとのコラボで作るのはパンツじゃなくてジャケットであることが明らかになって、なるほど！となった。\n\nGoogle ATAPは（少なくとも当初は）2年で市販品を作ることがプロジェクトの要件になっていることが他のmoon shot的なR&amp;Dとは違う点で、それゆえにこのジャケットも、Levi’sが2017年の春に出荷することになっていた。結局2017年の春は過ぎたものの秋になってようやく、でも本当にこのジャケットは出荷された。2019年の今でもLevi’sの（ディスコンになった）Commuterラインで唯一残っている製品として[オンラインでもお店でも買うことができる](https://www.levi.com/US/en_US/clothing/men/outerwear/levis-commuter-x-jacquard-by-google/p/286600000)。\n\n買うことができる…んだけど、$350って高すぎる！どうせちっとも使わない機能がついているからって$250余計に払うほどお財布に余裕はなかった…。\n\n### ジャケットとsnap tagを別々に中古で入手\n\n自転車通勤時のパンツを買いたいなあと思ってて、でも上記のとおりLevi’sのCommuterラインはディスコンになっていて、うーんと思ってたときにメルカリで1本見つけて以来、（スマホで）古着屋巡りを時間つぶしにやっていた。こちらNew Yorkでは[Poshmark](https://poshmark.com)というサービスがそこそこに流行っているらしく、それ以外に[Grailed](https://www.grailed.com/)とか、あともちろんeBayやMercariもある。\n\nある日、どういうわけか女性ものを検索する設定で、”Levi’s Commuter”をPoshmarkで検索してしまったときになんと、Jacquard Tracker Jacketを$50で売っている人を発見。スマホと通信するためのsnap tagはなくなっているものの、$50??\n\n実はそれ以前にMercariでsnap tagだけを$15で売っている人を見つけていて、ただ本体がなければ意味がないので放置していた。さっそくMercariを見に行って、まだ売っていることを確認。Poshmarkでジャケットを無言即買いした。ジャケットが出荷されたのを確認して、Mercariでsnap tagもお買い上げ。しめて$65+送料トータル$20くらいで、$350だったあのジャケットを手に入れた。\n\n中古といっても、ジャケットは色落ちもほとんどなくてめちゃくちゃ綺麗だし、snap tagは多分開封してない箱のままで来たし、新古品と言ってよいクオリティ。\n\nジャケットの作りも、全部のポケットにファスナーがついていたりとか、袖の内側に隠してリブがあって風が入らないようになっていたりとか、Levi’sのCommuterラインのTracker Jacketの作りはそのまま、まあこれが$50ならお買い得なのでは、という感覚。\n\nだがこれを買ったことの意味は当然、Jacquardを試すことにあるのだ。まずはさっそく、公式アプリをダウンロードして機能を確認してみる。\n\n### Jacquard公式アプリ\n\n[Jacquardの公式アプリ](https://play.google.com/store/apps/details?id=com.google.android.apps.jacquard)を起動して、ジャケットとsnap tagとアプリを接続したら、ジャケットに対する3種類の動作について対応するアクティビティを設定できる。3種類の動作とは、袖を上から下へこするBrush in、袖を下から上へこするBrush out、袖を2回叩くDouble tap。このそれぞれに、現時点でアプリが提供しているアクティビティを割り当てる。例えばナビゲーション機能（次に曲がる場所を音声で教えてくれる）、現在地をアプリに保存する、単純にsnap tagのLEDを光らせるなど。また、アプリからsnap tagへ通知を送って、snap tagを振動させることもできる。電話やテキストが来たときとか。\n\n…と、かなりできることは限られていて、まあそれも当たり前で、自転車に乗っている最中にサッと行いたいことってそんなもんでしょう、ということなんだろう。音楽を聞き始めるとか、次の曲へ進むとか、止めるとかいうこともできるんだけど、自転車乗ってるときに耳栓しないでーって思うし（けっこうな数いらっしゃいますけども）。\n\nとはいえ、ここまで何もできない（というか自分がやりたいことが揃っていない）と、そりゃー「なければ作る」しかないねと。\n\nだが、Jacquard SDKは存在しない。以上。\n\n仕方ないので、適当にあたりをつけながらtry and errorでジャケット+snap tagとアプリとの通信を解析してみることにした。\n\n### Bluetooth Low Energy (BLE)でscan\n\nまあ当然予想されることだし、スマホのBluetoothを切ったらアプリが動かないことがわかるので、snap tagはBLEのPeripheralなんだろうなと想像して、単にBLEでデバイスをscanして、deviceを見つけて、serviceを見つけて、characteristicを見つけて、という一連の流れでデバッグログを書くだけのものを作ってジャケットを探してみた。\n\n最初は全然それらしきデバイスが見つからなくて困ったんだけど、snap tagがadvertiseしてなかっただけっぽくて、ジャケットの袖に刺激を与えたら出てくるようになった。[ScanRecord#getDeviceName(](https://developer.android.com/reference/android/bluetooth/le/ScanRecord.html#getDeviceName%28%29))が”Jacquard”という文字列を返してくるのですぐわかってよかった。結果、このデバイスは「d45c2000–4270-a125-a25d-ee458c085001」というserviceを持っていることがわかった。\n\nさらにこのserviceは17のcharacteristicを持っていて、そのうち12のUUIDが上記のserviceのUUIDと関連する値を持っていた。具体的には「d45c2000」の部分が「d45c2010」「d45c2030」となっていてあとは同一。これが多分Jacquard特有のcharacteristicなんだろうなあと推察した。\n\nそこでこれらのcharacteristicからもう少し情報を取得してみる。[BluetoothGattCharacteristic.html#getProperties(](https://developer.android.com/reference/android/bluetooth/BluetoothGattCharacteristic.html#getProperties%28%29))を見ればcharacteristicがREADだけなのかWRITEもできるのかがわかって、WRITEできるcharacteristicはアプリからメッセージを送れる、つまりLEDを光らせるものかまたは振動させるものということになる。予想に反してWRITEできるものが4つ見つかったんだが、そのうち2つはREADとWRITEが両方できるので、なんとなくこの2つ「d45c2080–4270-a125-a25d-ee458c085001」と「d45c20f1–4270-a125-a25d-ee458c085001」から見てみることに。\n\nとりあえず、公式アプリから使える「七色に光らせる」機能を自作アプリから呼び出せるようにしてみようと目標を設定した。\n\n[AndroidアプリとデバイスとのBluetoothでの通信内容を解析する](/blog/2019-05-12_Android----------Bluetooth------------5844e20b5b98)へ続く。\n\n"},{"frontmatter":{"slug":"/blog/2019-02-12_---------e0304804cb7b","date":"Tue, 12 Feb 2019 15:26:17 GMT","title":"翻訳有害論有害論","epoch":"1549985177","excerpt":"プログラミング自体を学ぶのか特定のソフトウェアの使い方を学ぶのか。さらに例えばExcelの使い方みたいな意味でソフトウェアの使い方を学ぶのか、Javascriptのフレームワークやライブラリの使い方を学ぶのか。目的に応じて最短距離は変わると思うけど、どの場合でも「母語でない自然言…"},"markdownBody":"\n### 翻訳有害論有害論\n\nプログラミング自体を学ぶのか特定のソフトウェアの使い方を学ぶのか。さらに例えばExcelの使い方みたいな意味でソフトウェアの使い方を学ぶのか、Javascriptのフレームワークやライブラリの使い方を学ぶのか。目的に応じて最短距離は変わると思うけど、どの場合でも「母語でない自然言語を体系的に学ぶ」が最短距離であることはない。ただこの人が論じているのは短期的な目的を達するための最適手段ではなく、長期的な利益を見据えた投資として最適である何か（英語を学ぶこと）が明らかであるのに、短期的に利益が見込めるのが明らかであるという理由で「すでに長期的な投資をある程度まで行っていてその利息を享受し始めている人々」が、「まだその長期的な投資をしていない、するかどうか決めかねている人々」に、安易な選択肢を与えてしまうことで、（見返りを短期的には実感できないかもしれない）長期的な投資から人々を遠ざけるように仕向けるのは、「優しい」のか、という問題提起なんだろう。\n\nで、その問題設定？に「えーそれちがうでしょー」と感じるのは、長期の投資によって将来得られるであろう利益が大きいことが確定的であったとしても、その長い期間生きていく糧は得つづけなければならず、その糧が「このJavaascriptフレームワーク」を使えることで得られる場合、そのドキュメントが翻訳されていたおかげで日々の糧を得ることが可能になるのだから、それは「優しい」でしょう、って思うから、かなあ。そういう、当座は困らないっていう前提があれば、次に使うことになる他人製のライブラリは英語でしかドキュメントがないかもしれないから、当座困っていない今のうちに英語も学んでおこう、っていうことにもなるし。元の論者がいう翻訳有害論はこういう入り方を許してくれないので、よくないなーとなる。「糧」っていうと食い扶持という意味に聞こえるけど、「今日もプログラミング楽しかった」「今日もやりたかったXをやることができた」って思うのも糧だよね、って意味で。\n\n個人の経験はすべての人に当てはまらない。勉強という、誰にでも許されている普遍的な権利というわけではないものでは特に、というそれだけ、なんだけども。\n\n```\n<a href=\"https://mobile.twitter.com/miyagawa/status/1095184749973319681\"></a>\n```\n\n"},{"frontmatter":{"slug":"/blog/2018-06-02_Sony--6000---------Essential-PH-1-----de81334408d","date":"Sat, 02 Jun 2018 15:32:11 GMT","title":"Sony α6000 を買った、またはEssential PH-1はいいぞ","epoch":"1527953531","excerpt":"Essential PH-1は買い"},"markdownBody":"\n### Sony α6000 を買った、またはEssential PH-1はいいぞ\n\n### 買った\n\n昨年は転職やらなんやらでバタバタで夏休み的なもので旅行をできなかったので、5月に10日休んでスペインはアンダルシア地方に行ってきた。で、当然写真を撮るわけなんだが、せっかくなのでスマホじゃないカメラを持っていきたいと思った。\n\nこれまで使っていたのは Pentax K10D で、重いし一番よく使うレンズに曇りがある（落っことしたせい）しで、持っていくのやだなあと思って、もっと軽いカメラを探すことにした。小さくて軽くてもマニュアル撮影とかバルブとかできるってことになるとやっぱりミラーレスってことになるらしく、ミラーレスということになるとPentaxはもちろん、CanonやNikonもいまいちらしく、Panasonic/OlympusかSonyかって選択になるらしい。\n\n$500とかくらいでどうにかなりませんかねえと、Google Shopping Searchしてみたところ、[Tri-State Camera](http://tristatecamera.com/)がSony α6000を$500未満で売っているのを発見。出発日が5/16で買ったのが5/11というギリギリの注文だったけど、余計に払って2 day shippingを選択して、会社の所在がニューヨーク近郊ぽいから大丈夫だろうと思ってエイやで発注したらちゃんと届いた。\n\n### 調べた\n\n届いたのでさっそく使い方をいろいろ調べた。おまかせモードが2つあって、i+のほうがファンシーな写真を撮れるらしい印象。あとはシャッタースピード優先、絞り優先、マニュアルという感じか。パノラマとかシーンとかもあるけど使わなそうな気がした。\n\nそれより面白そうなのは、カメラに[ダウンロードする「アプリ」](https://www.playmemoriescameraapps.com/portal/)があって、カメラの機能を使って変わった写真を撮れるらしいこと。有料アプリがたくさんある中、とりあえず無料のアプリ「Picture Effect+」と「Sync to Smartphone」を落としておいた。\n\n### 使った\n\n実際にスペインで使ったんだけど、まあ軽いので持ち運びが苦ではないのが一番よい。ほぼ歩いて回って観光していたので、K10Dを持って行ったら辛かっただろうと思う。\n\niとi+の2つのオートモードの違いは、iのほうが見たままのを撮れる感じで、i+のほうがもう少し写真としてどうにかしてくれるという感じか。\n\n![これiだっけi+だっけ忘れた](/images/1*eSEd6CEVSysOXm9oNDfoIQ.jpeg)\n\nK10Dの機能で一番missしたのは、グリーンボタン。絞り優先とかオートじゃないモードにしているときに、今の状況をカメラはどう思っているのか（つまりグリーンモードで撮ると絞りやシャッタースピードはどうなるのか）をサクッと知ることができて、下手くその僕には必要な機能だったんだけど、それがないこともあって、ついつい前回のマニュアル設定で全然違うシーンを撮ってしまうことが多くて、あとで見ると暗すぎたり。明るくて白飛びしているのはファインダーでわかるんだけど、あとで見たら暗すぎるっていうのは、ファインダーで見ると意外にカッコよく見えることが多くて、お、これでいいじゃん、って思ってしまう。\n\n![く、くらい](/images/1*_cyKFCRi_G7DTzG5zrsJKw.jpeg)\n\ni+と、マニュアル系のモードでは機能選択すれば、Auto HDR（3枚撮り）してくれる。\n\n![日差しが強いですね](/images/1*GDRnsheEvCgOrD04oZgrsw.jpeg)\n\nPicture Effect+ アプリを使うと、強いHDR写真を撮ることもできて、これはこれで面白い。\n\n![花の小径](/images/1*CxlBvUY4RRQmwWVucukp-w.jpeg)\n\nToy CameraとかMinitureとかのエフェクトもあって使ってみたけどよくわからなかった。\n\nそれと、Sync to Smartphoneアプリが便利だった。古い4GBのSDカードしかなくて2日で満タンになってしまっていたんだけど、adhoc wifi接続したスマホに「その日の分」を全転送しておいて、あとはまた「その日の分」を全消去してしのいだ。スマホが勝手にGoogle Photosに上げてくれるのでその後のことはあまり考えなくてよい。\n\n### レンズ欲しい\n\n標準キットのレンズが16–50mm/f3.5–5.6っていうズームレンズで、使ってみた結果別にいいんだけど、暗いところで明るい写真を撮るのが好きなので、f/1.xのレンズが欲しい。いくつかあるけど高い。がんばって働こう。\n\n### ところでEssential PH-1\n\nカメラがクソだカスだと未だにレビューで書かれるPH-1ですが、昔の記事はともかく、最近のレビューでもそうやって書かれているのを見ると、はてこの人は一体どんな写真を撮りたいんだろうと思ってしまう。PH-1のカメラ、今ではだいぶいいと思うんだけど。フツーよりもだいぶ良いという意味で。\n\n![ ](/images/1*xjA0jyO_Zoul3vEIFEgv-g.jpeg)\n\n![HDRですけどね](/images/1*M2_cAE_sXw38v6O29rzIPA.jpeg)\n\nα6000と比較するとこう。いやあ悪くないと思うんだけどなあ。\n\n![](/images/1*Tl2JAcAjHX7U5Dn_U4IaLg.jpeg)\n\n![左α6000 右PH-1](/images/1*fLfAJiaqxVN86mq9JDToqA.jpeg)\n\nSnapdragon 835の128GBでこの程度の写真を撮れて、[お値段$500未満](https://www.amazon.com/dp/B074BWGRKH/)ですよ。お買い得じゃないですか。セキュリティアップデートはPixelより早いし、今すぐAndroid Pも入れられますよ。[今すぐ買う](https://shop.essential.com/products/phone)\n\n### 買ってよかった\n\nα6000は買ってよかったなと思った。僕が撮るような下手くそ写真はスマホカメラで十分なんだけども、まあ撮ってて楽しかったし。今回は三脚を持っていくのを忘れたり、夜早々に寝ていたこともあって夜をほとんど撮れなかったので、次どこかに行くときは夜の写真を撮ろうと思う。\n\n"},{"frontmatter":{"slug":"/blog/2018-03-25_Uber-Visa----------a9728070d622","date":"Sun, 25 Mar 2018 19:15:49 GMT","title":"Uber Visaカードをゲットした","epoch":"1522005349","excerpt":"追記: 2019–11–32020年2月以降、ここで書いているようなrewardsはUber Visaでは得られません。Uber関連のサービスに毎日お金を払っている方以外にはおすすめできないカードになりました。念のため追記しておきます。詳細はこちらの記事などをご参照ください。"},"markdownBody":"\n### Uber Visaカードをゲットした\n\n**追記: 2019–11–3**\n2020年2月以降、ここで書いているようなrewardsはUber Visaでは得られません。Uber関連のサービスに毎日お金を払っている方以外にはおすすめできないカードになりました。念のため追記しておきます。詳細は[こちらの記事](https://www.businessinsider.com/uber-credit-card-review)などをご参照ください。\n\n### アメリカでクレジットカードを作る\n\nアメリカ合衆国に来て、Social Security Numberを取得したあと最初にしたことの1つがクレジットカードを作ること。SSNを取得したてで当然Credit Historyは皆無なので、それでも作れるカードの代表ということで、[ANA Card USA](http://www.anacardusa.com/en/)に申し込んで、3週間くらいで無事カードを手に入れたのが2013年6月のことだった。\n\n### ANA Card USA時代\n\nカードをゲットしてから、地道に支払い可能なすべてのものをカードで支払い、遅滞なく毎月全額を収め続けてスコアをあげたつもりになっていたが、なにせ、ANA Card USAはなにしろANAのマイルがつくだけ。こっちはANAに乗るとはいっても大した回数でもないしマイルの使い道にとぼしい。\n\nそろそろそれなりのスコアになったかなあと思った10ヶ月後、なにげなくクレジットカード比較サイトを眺めていたら、新しくアメリカでサービスを始めたBarclaycardの紹介を目にした。旅行関係の支払いで1$2ポイント、2500ポイントを$25として使えて、初回ボーナス50,000ポイント。\n\nこっちならANA以外の場所でもポイントを使えるし。$89の年会費があるものの初年度は無料だしANA Card USAも年会費はかかっていたから、まあいっかということでダメ元で申し込んでみたのが2014年3月。なんとapproveされてカードが届いた。ANA Card USAは速攻キャンセル。\n\n余談。ANA Card USAをキャンセルした直後に、Amazonで買った商品がなんだか理由は忘れたけどキャンセルされて、カードにrefundされた。されたんだけどカードはもうキャンセルしたので戻ってこない。困ってANA Card USAを運営するFirst Bankcardに電話してみて事情を説明したら、refundされた分を小切手で郵送してくれた。後にも先にも小切手を持って銀行に行って口座に振り込んだのはこのときだけ。\n\n### Barclaycard arrival+時代\n\nBarclaycard arrival+カードは、当初はクレジットカード比較サイトでの評判も上々だったし、クレジットラインも地道に増えたし、Mastercardのランクも少し上がったし、とそれなりにrewardingだったんだけども、2015年後半頃からポイント使用の下限が10,000に跳ね上がったり、Android Payがいつまでたっても使えなかったりと不満を溜め込み始めた。\n\n2017年初にも、年会費を払う前に解約していよいよ他に移るかあ、と思って他のカードをいろいろ検討し始めた。Barclaycard arrival+は、この頃にはクレジットカード比較サイトでも全然評判がよろしくなくて、他のカードにない唯一の利点がヨーロッパでChip and Pinできるよってこと。いやまあヨーロッパ旅行もする予定はあるけど、そんだけ？\n\nとはいえ移る先のカードにも対して魅力的なものがない。周囲を見るとChase Sapphire Preferredが一番人気のようだけど、年会費が今よりあがる上にメリットは大して変わらないように見える。初回ボーナスをもらえるのは魅力だけど。\n\nそうやって結局2017年の年会費も払い、さらに使うこと1年。Android Payもようやく使えるようになり、まあこれでいいのかなあと思っていた矢先に、Barclaycardのサイトで[Uber Visa](https://www.uber.com/c/uber-credit-card/)の紹介を見つける。\n\nUber Visaは年会費無料、Foreign Transaction feeゼロ、んでもってカテゴリーによるが最大4%バック。まじで？APRとかバランストランスファーのレートとか俺には関係ないし、これ最高じゃね？\n\n### Uber Visa却下\n\n引っ越しで家賃を下げてケーブルTVを切ってといろいろ断捨離したので、ついでにカードも断捨離するかということで、さっそくUber Visaを申し込んだ。Ficoでのスコアは700をコンスタントに超えているし、問題はないだろうと。\n\nところがその2週間後、そっけない手紙とともに申し込みは却下された。\n\n手紙に書いてある理由は「too few accounts with sufficient satisfactory performance」。いや確かにaccountは今のカードの分しかないけど、それあんたたち自身（Barclaycard USA）なんだから、俺がどんだけloyalでtrustworthyな客か知ってるだろう？！\n\nんーまじかこれってどうにかなるんだろうかと、その理由の文言をネットで検索してみると、これはBarclaycardが使う文言なのか、同じのに当たった人がわりと多いみたい。掲示板を見てみたら、スコア800でこれをくらったという人に対して、回答者が「definitely recon」と言っている。reconnaissance？どこを？なんで？と思って「Barclaycard recon」で検索したら、reconsiderationのことだった。どうやらあまり表には出していない電話番号があるらしい。\n\n### Uber Visa reconsideration\n\nさっそく翌日に電話する。手紙に書いてあるApplication番号を告げると、向こうから返ってきた返事は「当社からあなたに渡せるcredit lineは現在arrival+で利用可能な分だけです。arrival+のほうのcredit lineを減らす気はありますか？」なるほどー。\n\n「もちろんです。Uber Visaをもらったらarrival+のほうはキャンセルするつもりでした」\n\n「それなら、Uber Visaのほうに大部分を移して、arrival+のbalanceを全部払ったらあらためて電話してくれれば残りを全部移動させてarrival+をキャンセルするという流れにできますよ」\n\n「それでおなしゃす！」\n\nそして無事approveされた。5日後にカードが無事手元に到着する。めんどくさがらずになんでも電話してみるもんである。\n\n### Final thoughts\n\n思うに（完全に想像だが）、僕が今持っているカードがBarclaycard発行のものでなければすんなり行ったのかもしれない。逆にUber Visaではなく、例えばChase Sapphireを申し込んでいれば、やはりすんなり行ったのかもしれない。これらは異なるissuerだから新しくcredit lineを作ることになるのだろうというのがその理由。副作用として、最初に使える枠はだいぶ下がっただろうけど。また一つアメリカでのサバイバル知識を得た。\n\n知ってのとおりUberという会社自体の評判は非常によろしくないので、Uber Visaを持ってますとか自慢するようなことじゃないんだけど、このカードのreward内容は年会費無料のグループの中では群を抜いていると思う。Amazon PrimeのメンバーならPrime VisaでWholefoodsでの買い物が5%バックになるっていうので一瞬考えたんだけど、結局Primeの年会費を払いたくなくてやめた。\n\n以上、クレジットカードを変えた話でした。\n\n"},{"frontmatter":{"slug":"/blog/2018-03-25_------------------c7e99608f41e","date":"Sun, 25 Mar 2018 14:13:47 GMT","title":"ニューヨーク市内で引っ越し先へ入居","epoch":"1521987227","excerpt":"ニューヨーク市内で引っ越しの当日からの続き"},"markdownBody":"\n### ニューヨーク市内で引っ越し先へ入居\n\n[ニューヨーク市内で引っ越しの当日](/blog/2018-03-22_-----------------bd1b22641946)からの続き\n\n今度の部屋は結構広いウォークインクローゼットがあって収納は問題ないなーと思っていた。持ってきた服をぶら下げ、とりあえず使わないものを棚の上に押しやり、お皿やなんかをキッチンにしまって…と荷ほどき作業をしていて気づいたのは、キッチン周りの収納スペースが狭いというか使いづらいこと。\n\n前の部屋はキッチンカウンターとシンクが別々にあってシンク側にもカウンターがあって、さらにそれぞれのカウンターの上に収納スペースがあって引き出しもあったから、食器類を入れる場所には不自由していなくて、というかだいぶ余っていたんだが、今回の部屋のキッチンの収納は、お箸やスプーンをしまったり、オタマや包丁をしまったりする引き出し的な収納がない。キッチンカウンターはそれなりの広さがあるんだが、冷蔵庫の配置の関係で、デッドスペースも多い。\n\nバスルームの手洗いの下の収納にものをしまおうとしたら、これもありがちな、水漏れ中。パイプから滴ってて、収納したら濡れてしまう。\n\n### 鍵交換\n\n結局部屋の鍵は見つからず、すこし落ち着いたので1階に戻ってフロントマンに聞いてみたところ、ちょうど鍵職人がくるところだった。ドアのシリンダーごと交換することになったらしい。\n\n鍵交換職人が作業しているときに、ここの管理のheadだという若干殺し屋っぽい風情の人もきたので、ついでに水漏れの件も聞いてみた。そしたら鍵をつけた後にそのまま鍵職人が見てくれて、あーだこーだやって直してくれた。仕事はやい。このシンクは部屋の内覧をしたときはまだ設置されていなくて、殺し屋曰くなんだかあわてて外部の職人が付けたようなので、うまく締まってなかったんだな、とかなんとか。\n\n鍵交換も終わり、改めて1階へ戻って新しい鍵のセットを受け取ってサインをして、ようやく部屋が自分のものになった感。自分のものじゃないけど。ただ、このときもまだドアは開放モードのままで鍵を使わなくても出入りできるようにしていた…\n\n### ベッド組み立て\n\n我々は日本人なので、家では靴を脱ぐ。そこでお約束の、だいたい片付け終わった部屋のフロアを雑巾掛けして、裸足で歩けるようにする。\n\nそして寝床を確保するべく、新しく買ったベッドフレームを組み立てる。ドライバー1本でできるので、これは簡単。ベッドの脚の底に、家具なんかがぶつかっても傷がつかないようにするためのフェルトみたいなやつ（日本で100円ショップで買ってきたあった）を切り貼りする。すべらせて移動してもまあ床にも傷がつかないし。\n\nそしてベッドの上でこれも新しく買ったマットレスを開放する。[ATP](http://atp.fm/)のディスカウントコードを入れて買った[Casperのマットレス](https://casper.com/friends/fumiakiy)は、真空パック状態で丸まってやってくるので、傷つけないように梱包を開いていくと、プシューっと空気が入ってマットレスが立ち上がる。枕もついでにCasperで買ったので、これも開放する。\n\nCasperの枕は、なんだかかわいらしい円筒形の容器に1つずつ入ってくる。この容器をゴミ箱として利用することにした。まあまあいい感じ。\n\n### Casper vs Nectar\n\n実はマットレスは、当初はCasperではない別のメーカーのものを購入していた。買わなきゃならないってことで探していたら、[Nectar](https://www.nectarsleep.com/mattress)というメーカーがCasperと似たような製品をCasperの2/3の値段で売っていたので、それを買ったのだ。Nectarはキャンペーン中で枕2つが無料で付いてくるってのもあって。Nectarは365 nights trialで1年寝てから返品もアリって言ってて。\n\nだがしかし、Nectarは2週間経っても発送される気配がない。おまけにNectarは発送していないのにカードに課金をしていることに気づいて不信感も募る。とうとう引っ越し1週間前になったので、これは新居で寝る場所を確保できない懸念がピークに達して、結局Casperでオーダーした。Casperはすぐ出荷するって書いてあったし、評判は悪くないし。\n\nNectarのサイトのLive Chatでオーダーをキャンセルした。\n\n「もう予定の期日を過ぎたから、これ以上発送されなかったら当日に寝場所がなくなっちゃうから、もう他で買っちゃったんだよ」\n\n「でも明日発送されるかもしれないよ」\n\n「発送されても、他で買っちゃったし、おそらくNectarのほうを返品することになると思う。そしたらそのマットレスはゴミになってしまう。だったら最初から他の人に送ったほうがいいと思う」\n\nとかいうやりとりを経てキャンセル。カードへの返金を確認した。もう少し余裕を見て注文しておけばよかったんだが、なんせ引っ越し自体のスケジュールに余裕がなかったから。\n\nCasperの寝心地は今のところとてもよい。今からNectarを発注して、Casperは100日以内に返品するっていうのも仕組み上はアリだけど、今のところそうする予定はない。\n\n### 鍵が開かない\n\n引っ越し当日の最後のタスクは、Verizonの技術者が来てネットを開通すること。午後3時から5時っていう枠で頼んでいて、4時くらいに電話が来てあと30分くらいで行くっていうから待っていたんだが、案の定5時になってもこない。ありがち。5時半になってもこないので、Verizonに確認すべく共用フロアのネットを使うために部屋を出る。フロントでWifiのパスワードを聞いて、Verizonとチャットを始めて「技術者がこないんだけど」とか打っていたら、妻が走ってきて「なにやってんの！もう来たよ？そしたらなんだか出て行っちゃって、そいでもって部屋に入れなくなっちゃった！」\n\nえ？\n\n急いでチャットをぶったぎってそのままに部屋に戻ると、ドアが閉まっていて開かない。ドアはオートロックというか、外からはドアノブを下げられなくて、開く方向に鍵を回すことでドアノブを下げるのと同じ動きをする仕組みなのだが、鍵を回しきってもドアの金具というか爪というかが完全には引っ込まず、引っかかったままなので開かないという状況だった。\n\nこれって…泥棒の道具でどうにかなるんだろうか…？ええーどうしようと思いながら全身全霊を注入してエイやって回したら開いた！\n\nホッとして、1階に電話をかけて、鍵が開かない状態ですと説明をして再度handymanを派遣してもらう。さっき鍵を付けたのとは違う人が来て、状態を確認して、「作業するにはウォデュコディが必要だからそう言ってくれ」と電話を渡される。え？え？なにそれ？と思いながら電話でいやだからその鍵が開かなくてえっと、といってまた代わってもらい「自分で言ってくれない？」と言ったら「いやそれはできない」とかえ？え？となってもう1回代わったら、電話の先でフロントマンが「Work Orderを出すんでしょ？」と言われてあーそういうことかーはいお願いします、と。要するに、今は確認しに来ただけで実際に手をつけるには手続きとしてWork Orderを発行してもらわないといけないということだった。\n\n鍵の調整をしてもらっていたらやたら陽気なVerizonの技術者が戻ってきた。「Hey wazzaup」遅れてすみません的なことは特になく。ありがち。部屋にある機械は動いているが地下にある大元が切れているのであーだこーだみたいな説明をして、口笛を吹きながらなんだかごそごそやっている。その後も地下と部屋を何度か往復し、本部らしきところに電話をかけて状態を確認したりしていた。\n\n### トイレの水が止まらない\n\n鍵の調整中にまた殺し屋風情のheadがやってきたので、彼にもう1つお願いした。実はトイレを何度か使ったら、それっきりトイレの水が流れるのが止まらなくなってしまっていた。前のアパートでも1回あって、タンクの中の栓の部分のゴムが弱っていたっぽいんだけど、今回はそんな感じではなく、お手上げだった。\n\n鍵の設置をしたときもこのheadはその場にいたので、しきりにhandymanに「ほんとに開かなかったのか？全然問題ないじゃないか」「いや今俺が直したから問題がなくなったんだよ」「んーどうなってたんだ？」「いやだからこれがこの辺で止まっちゃってたんだよ」みたいなやりとりをしていた。\n\n鍵の調整は完了したので、一応妻の力でも十分開けられるかどうかを外から確認して、OKとなった。殺し屋headは上がる時間だったみたいで、鍵の調整をしている人に引き続きトイレも作業するように支持して、Good nightといって去っていった。さっきから殺し屋などと書いているが、見た目がそうなだけで、普段から挨拶も交わすし、仕事きっちりな、いい人である。\n\nトイレの調整もなんだかネジを閉めたりなんだりしたらしく、キュッと止まるようになった。\n\n### My voice is my password\n\nVerizonの技術者が陽気に口笛を吹きながらごそごそやり続けて1時間。どうやら地下で切れているのはテレビのデータだったらしく、インターネットのほうは生きていたようで結局ネットはつながったらしい。最後まで電話でその点をしきりに「この契約はネットだけだから、ごにょごにょの電波がゼロでも問題ないだろ？な？」と確認していた。\n\n配線盤はクローゼットにあるんだけど、Wifiルーターは室内におきたかったので、壁のアウトレット側の作業もしてもらい、ルーターの接続を確認した。そこでネット開通のためのユーザーアカウントの引き継ぎみたいな作業を行うらしく、なんか専用の端末にログインしたんだが、そのとき彼が口で電話に向かって、自分の技術者IDらしき番号に続けて「My voice is my Verizon password」と言ったので仰天した。\n\n僕が大好きな映画[Sneakers](http://www.imdb.com/title/tt0105435/)の中で、ビルの中のセキュリティレベルの高いエリアに入るために音声認証が必要というシーンがあって、そのときのフレーズが「[My voice is my passport, verify me](https://www.imdb.com/title/tt0105435/quotes/qt0448965)」なのだ。\n\n作業が終わったところで技術者にSneakersを見たことがあるか聞いてみたら、あるようなないような返事だったのでいまいち盛り上がれなかったんだけど、この人とは代わりにゴジラの話題で盛り上がった。子供の頃にゴジラを映画館で見てそれ以来大好きだと。日本の輸出品で一番優れているものがゴジラなんだと力説されて、あー、おー、そうかそうか、最近のやつはみた？みたらいいよ？あーアメリカのじゃなくて日本のやつ、いやアニメもあるらしいけどrealのほうね、あれ、アメリカでは見られないのかなあ、みたいなやりとりをした。\n\nWifiルーターを一度外して、壁のアウトレットにパネルをはめ込んで、再度繋げて、技術者のおっちゃんは意気揚々と帰っていった。帰りしなに、この近辺のおすすめバーを3つ4つ教わった。\n\nそして…ネットは繋がらない。は？と思ってルーターを再起動したりしたんだけど、ルーターには繋がるけど外にいけない。は？は？だってさっきはつながったじゃん、と思いながらふと、ルーターを壁のアウトレットから外して、クローゼット内にある機械のコネクタに直結したらつながった。ありがち。たぶんアウトレットのパネルをはめ込んでいるときに断線したかなにかだろう。\n\n結局Wifiルーターは今もクローゼットの中にある。別に電波強度も問題ないので、まあかえってよかったかも。\n\n### Settled\n\nこの日の夕食は、さっそく繋がったばかりのネットを使って食事のデリバリーを頼んだ。前のアパートでは、デリバリーが到着するとフロントから電話がかかってきて、それに応答しないとデリバリーが中に入れないことがあったので、デリバリーを頼んだときは（[前記のとおり](/blog/2018-03-11_------------------1-35e3f49ceed1)）PCを開いてGoogle Voiceで電話を受けられるようにしておかないといけなかったのだが、このアパートにはフロントから一方通行の連絡が受けられるインターホンが付いている。わりとけたたましいピーピー音がなって向こうからの声が聞こえる仕組み。なので、やっぱり電話は不要になりそうだ。\n\n初めての引っ越しは一応の落ち着きをみた。\n\n続く。。。かも\n\n"},{"frontmatter":{"slug":"/blog/2018-03-22_-----------------bd1b22641946","date":"Thu, 22 Mar 2018 11:59:05 GMT","title":"ニューヨーク市内で引っ越しの当日","epoch":"1521719945","excerpt":"ニューヨーク市内で引っ越しの準備その3からの続き"},"markdownBody":"\n### ニューヨーク市内で引っ越しの当日\n\n[ニューヨーク市内で引っ越しの準備その3](/blog/2018-03-17_------------------3-72cd85892fd1)からの続き\n\n### Verizon Fios…\n\n金曜日の朝9時指定で引っ越しなので、木曜日の夜は冷蔵庫も空で外食し、慣れ親しんだ街で最後の夜を過ごす。\n\n金曜日の朝。起きたらすでにネットが繋がらない。今日移動することは指定していたが、まさか0時で切れるとは。なんでそこだけきっちりやるんだ。向こうが開通したタイミングで切れればいいんじゃないか。\n\n[Ting](https://zql8fe716fn.ting.com/)でネットを使えるので助かった。[電話を契約しておいてよかった](/blog/2018-03-11_------------------1-35e3f49ceed1)ーと思った瞬間だった。\n\n### Men arrived with a van\n\nほぼ時間通りに引っ越しManから電話が入り、引っ越し作業開始。まずは5年間住んでて初めて足を踏み入れた裏の荷物搬入口へ行って、導線を確認。バンから出てきた明らかに現場のボスぽいおっちゃんと握手をし、もう1人の背の高い屈強な男と一緒に部屋へ向かって荷物の量などを確認する。こちらの作戦、つまり大物を運んでいる間に箱詰めを完了する予定を伝える。\n\n予定と実際の内容に違いがないことを確認して、引っ越しguysがバンから青いプラスティックの梱包用の箱やダンボール製のワードローブ、それに映画でおなじみのダクトテープなどを取り出してくる。\n\n自転車、ソファ、テーブル、テレビを運び出している間にその青い箱に細かいものをバンバン入れて…と思ったが、実際はソファやテーブルを運ぶ前の準備を引っ越しguysがいろいろしている間に梱包作業はあらかた終わってしまい、ソファは後回しになった。背の高い男は「やー少ないし早いから大丈夫とかってみんな言うんだけど実際はそうじゃないことが多いんだよねー。今回は本当に早かったな。」とお褒めの言葉？をいただいた。\n\nこの背の高い引っ越しManは、話すタイミングがあるごとに「俺たちは仕事を早くして余計な金を使わせないことを大事にしてる」「なるべく早く終わらせるから心配するな」「任せとけちゃんとやるから」と言っていて、好感度大賞を狙っているんだろうか？という感じ。実際に好感度は高い。\n\n結局正味40分程度で搬出は終わった。\n\n### さよならマンハッタン\n\n部屋に忘れ物はないか確認して退出。大家さんとの約束通り、アパートのフロントデスクに鍵を預ける。まだ部屋の契約は残っているので部屋に入る権利はあるのだが、新しいrenterを探すために部屋を見せることが必要で、不動産屋さんが入るときに使うのだ。ちなみに、大家さんもビルのフロントもそれぞれ鍵を持っているので、彼らはいつでも勝手に入れるっちゃ入れる。もっともそんな心配をしたことは5年間で一度もなかったが。\n\n5年前に初めて来たときにもやりとりしたフロントのマネージャーと最後の挨拶をし、外に出て引っ越しguysと引っ越し先で落ち合うことを確認して、地下鉄で移動する。\n\n### 来たぜブルックリン\n\nそういうわけでアパートを見にきたとき以来のブルックリンへ降り立つ。朝から何も食べてないのでお腹が空いたということで、アパートの近所のスーパーを下見がてら訪問して、すぐ食べられそうなパンみたいなやつを探していたら…電話が。「おい、着いたぜ、どこにいる？」まじか早いなMan With A Van。道空いてたのかな。\n\nあわてて走ってアパートへ行き、フロントの人と「今日引っ越してきたんですけど」「ああ聞いてます。Nice to meet you」「Nice to meet you too. えーと鍵をください」「あー、んー、ん？」\n\n### 部屋の鍵がない\n\n引っ越しの段取り確認の中で、部屋の鍵を前日に受け取れないか聞いてみたんだが、鍵は引っ越し当日にしか受け取れないけどフロントに置いてあるから心配すんな的なやりとりを不動産屋さんとフロントのマネージャーと三つ巴でやってあったんだが、この始末である。\n\nそのマネージャーとのメールを見せて、\n\n「ほらフロントに置いてあるって書いてあるでしょ」「うん…ここにあるメモにもこのフロントの所定の置き場にあるって書いてあるけど、でもない」「このマネージャーはどこにいる？」「オフィスにいるから電話してみよう」\n\nフロントマンがマネージャーに電話をする…「え？不動産屋が持ってるかも？あ、そう、電話してみる」\n\nさらに電話…「ハーイ、うちのマネージャーが部屋の鍵をあんたが持って行ったって言ってるけど？え、持っていかない？あー、大家さんが持って行ったかも？違う？いやーそんな記録ないけど？えー？あー？」\n\n再度マネージャーへ電話「いや持って行ってないってよ、いや探したけどないんだよ。記録は昨日の午後に返したことになってるんだけど？…んー、バーイ」\n\n要するに所在不明。結局どうなったんだか今もわからない。\n\n結局30分くらいこのやりとりで無駄になり、引っ越しguysも荷物を運べる状態にしてしびれを切らして電話してきて「おい、まだか」「鍵がないって言っててさー入れないんだよ」「なんだそりゃ困ったな」的なやりとりをした挙句、とりあえず管理会社が持っているマスターキーを使って部屋を開けて引っ越し作業だけさせてもらうことに。\n\nやっと部屋の階へ行くと、荷物を部屋の前まで持ってきて待っていた好感度guyが笑顔で「おお、やっとか。じゃあがんばって早く終わらせよう」的な。好感度さらに倍。\n\n### アンパッキング\n\n何もない部屋に荷物を適当に運び入れる。引っ越し屋さんが持ってきた青い箱を開けて中身を適当に部屋に出して、青い箱はたたんでいると「お、これってもしかしてもう持って帰ってもいい？」\n\n青い箱は[totobox](https://totoboxes.com/)という有料の梱包資材で、Man With A Vanがオススメしてたからそれにしたんだけど、再利用可能なのであとで回収される。荷ほどきが終わらなければ置いていってくれてあとで連絡すれば取りに来てくれるんだけど、それももちろん手数料がかかるし、なんせ20箱程度で中身はとりあえず部屋にぶちまけてしまえばいいものなので、その場で回収していってもらうことにした。\n\nそれと、新しく買った[ベッドフレーム](https://www.amazon.com/gp/product/B01M24RQTM/)と[マットレス](https://casper.com/friends/fumiakiy)が配達で届いていたので、これも好感度guyに1階から運んでもらった。一応と思って、事前にメールでMan With A Vanに頼んでみたらあっさりOKで作業目録にいれておいてくれて、好感度guyも「おお、話は聞いてるぜ」と。Man With A Van、事務所と現場との連絡もちゃんとしていた。よかったよかった。\n\n荷ほどきを終えて、That’s itとなった。3時間で時計を止める。\n\n### 請求\n\n最後に現場監督の方が部屋に来て、3時間だから$360+車$25（だったと思う）と言われて、あれ、見積もりより安いなと思ったんだけどそのままOKした。支払いはクレジットカードでと言ってあったので、Square…ではなく電話を始めた。電話に対して「Hey boss, it’s John. Yeah, finished. 3 hours.」んで僕に「カードをよこせ」渡すと、電話口にカード番号、MM/YY、裏っ返してCVVも、口頭でお大声で。はあーまじかーそうだよねえー。たぶん一番手数料が安い仕組みなんだろうな。小切手とか最近流行らないし、かといって引っ越しのドタバタのときに現金で数百ドル持って来いとは言いづらいし、後日請求と振込とかだとトンズラが怖いし、これが安くて確実な方法なんだろうな。\n\nBillingも完了して、チップを$20ずつのつもりで$40渡して、ありがとうありがとうさようなら元気でねと挨拶して、2人は帰って行った。考えたら最後にバンの中が空かどうか確認するとか荷物のチェックとか一切しなかったけど、まあ正直金目のものもないし、覚えているものはすべて出したし、問題はなし。\n\nと思ったら20分後くらいに電話がかかってきた。「へい、梱包資材のtotoboxとワードローブの使用料を請求するのを忘れてた。すまんがさっきのカードに$80足させてもらうぜ」「ああーそれでなんか安かったのかー。はい問題ないです」「オッケー、バーイ」\n\nというわけで、Man With A Vanの請求は総額$478でした。ほぼ見積もりどおり。\n\n### Man With A Vanについて\n\nここまで読んでいただいた方には僕がMan With A Vanを気に入っている様子が伝わったと思うのですが、後日譚がありまして。\n\n液晶テレビを毛布みたいなやつでくるんだりそれなりに梱包して運んでくれていたんですが、おそらく車内でなにかにぶつかったか圧迫されたかで、画面左下の一部がなんというか半円形にぼやけるようになっていました。ど真ん中じゃなくてよかった。映像のその部分がたまたま白っぽいと、黒い影のようになって目立ちます。\n\nフロアランプはほぼそのままの状態で、長細いダンボール箱につっこんで、その上にほかにもいろいろいれて運んだんですが、一番底の台の部分がへっこんでいて、これもおそらく車内で何かに強くぶつかった跡だと思われます。\n\n傷がついたかなと思ったのはこの2点だけで、ソファと自転車は問題なし。お皿やなんかも、きちんと梱包してダンボールに入れておいたので、特に問題なし。\n\n総じて、丁寧さには欠けるけど、まじめで親しみやすくて働き者guysでした。Oz MovingやFlatrate Movingの見積もりは（いろいろディスカウントして）$700以上だったので、今回の引っ越しの規模にちょうどあったサービスと値段だったなと思っています。それに他の引っ越し業者なら丁寧だったのか？ってのはわからないし。\n\nそういうわけで、よっぽど潔癖な方でない限り、僕はMan With A Vanをオススメできます。\n\n[ニューヨーク市内で引っ越し先へ入居](/blog/2018-03-25_------------------c7e99608f41e)へ続く\n\n"},{"frontmatter":{"slug":"/blog/2018-03-17_------------------3-72cd85892fd1","date":"Sat, 17 Mar 2018 15:40:41 GMT","title":"ニューヨーク市内で引っ越しの準備その3","epoch":"1521301241","excerpt":"ニューヨーク市内で引っ越しの準備その2からの続き。"},"markdownBody":"\n### ニューヨーク市内で引っ越しの準備その3\n\n[ニューヨーク市内で引っ越しの準備その2](/blog/2018-03-11_------------------2-ae04f126a97f)からの続き。\n\n### 家具付きアパートから引っ越す\n\nこれまで5年間住んできたアパートは、会社経由で紹介してもらった[住友不動産の柏原さん](https://www.sumitomo-ny.com/agent_detail.aspx?agentid=2118)が、こちらから連絡した条件を元に探してくれていたアパートたちを2、3日かけて内覧しまくって決めた。当時連絡した条件は、$2,000/mo、ちゃんとしたキッチン、できれば自転車置き場、くらいだったと思う。\n\nマンハッタンで$2,000/moで探すのは実際かなり厳しく、まあそれでも10部屋くらいは見たんだが、ここを見て$2,500/moだったけど決めたのは、家具付きだったことが大きな理由 [1]。クイーンサイズのベッド、一人がけカウチ、テーブルと椅子、間仕切りにも使える棚と、おまけに炊飯器からお皿からとにかく生活に必要なものがすべてそこにあった。僕はNYにはスーツケースとダッフルバッグ1つずつに服とバリカンと髭剃りだけ詰め込んで来たので、最初に家具や日用品への出費を迫られなくて本当に助かった。\n\n[1] あとで気づいたんだけど、あのロケーションとビルの設備とを考えると、$2,500/moはかなりお得だったと言わざるを得ない。\n\nそういうわけで、この5年の間自分で買って引っ越し先にも持っていきたい大物といえば、テレビとソファとダイニングテーブルくらいしかない。とはいえ自分たちで運べる量ではないので、引っ越し屋さんを探す必要があった。\n\n### Man With A Van\n\n日本でもそうだけど、引っ越し屋のトラックは目立つので日常生活をしているだけでなんとなくそういう会社があることくらいはわかる。よく目にしていたのはOz MovingとかFlatRate Movingとか。先述の理由で普通の引っ越しより規模が小さいと思われるので、日本でいう赤帽みたいなサービスないのかなあと思ってsmall local movingとかって検索して、見つけたのがこの[Man With A Van](https://www.manwithavan.com/)というサービス。引っ越し以外にたとえばIKEAに一緒に行って、買った荷物をバンで運んでくれたりとかもするらしい。\n\nさっそく見積もりを依頼してみると、ものすごい速攻で返事がきた。相場がわからないので安いのか高いのかよくわからないが、人間2人の時給とバンの値段という計算自体はリーズナブルに思えた。ただ相場がわからないと交渉もしづらいということで、Oz MovingとFlatRate Movingにも見積もりを依頼した。\n\nありがちな話だが、両者とも返事の代わりに電話をよこしてきて詳しい話をさせてくれと。んで、電話してみるとこっちが見積もり依頼にすでに書いたことと同じ質問をしてきて、ふむふむなるほどーとか言って、それで最初の値段を掲示してくる。そのとき「今上司に確認してこれこれの分をWaiveしてもらったよ！」とかいうのを忘れない。\n\n両者とも出てきた金額はMan With A Vanにくらべて2割増しくらいだったかなと思う。まあ赤帽とヤマトやアートとを比較するのに意味がないのと同じことなので金額の多寡を比較しても仕方ない。ただこのときすでにMan With A Vanにすることに決めていた理由は、何か質問すると2時間程度でメールで返事が来ること。いちいち電話とかしてこないし、一度聞いたことをまた聞いてきたりしない。うざくないのだ。んでもって安いし自分たちの用途にあてはまっているし、小さいローカル会社ががんばってる風なのでそういうのを応援するという意味もまあまああるし、ってことで決めた。\n\nその後Quoteをもらった他数社には「もう他社に決めたからすまん」というメールを送り、それに対して電話がかかってきてますますうざくて嫌いになるというお定まりの流れもあった。\n\n### パッキング\n\nさて引っ越しを2週間後に決行することに決まった。その後のやりとりで、事前にダンボールを送ってもらうのはやめて、当日に再利用可能な梱包箱を持ってきてもらい、その場で梱包して出すことにした。事前に送ってもらうとその分金がかかるから。\n\n引っ越し作業の方々は時間計算でお金を取るので、その場での梱包は高くつくかもよって言われたんだけど、いやいやこっちは荷物なんてほとんどないんだから大丈夫任せとけと言った手前、準備は万全にしなくては。そこで必要になるのがダンボール箱。買うこともできるが、ここは日本でやったのと同様に、ほうぼうから集めてくることにした。日本だとスーパーとかでダンボールをもらえることが多いから、Wholefoodsとかにないかなーと。細かいものをなるべく箱にまとめておいて、当日は作業する方々が大物を移動させる間に、当日持ってくるはずの大きな箱に小さい箱をバンバンいれていって、30分程度でパッキング完了、という作戦を立案していた。\n\nWholefoodsでは使えそうなダンボールは見つけられなかったんだけど、会社に毎日なにかしら届くAmazonその他の箱を回収することには成功した。Office Managerの協力を得て、あとその週たまたまゴミ捨て当番だったこともあり、普段ならリサイクルの日に出すものとしてキープしてある箱を毎日せっせと家に持って帰ることを続けて、昼間に妻が細々したものをそれらの箱にまとめる。あと本とかDVDとかの当座は必要なくて細かいけどそれなりに大事に扱いたいものは、リュックに詰めて会社に持って行って一時的に会社に置いておくという荒技も使った。\n\nということで、2週間後には大小様々な箱と、空になった棚とクロゼットができあがった。洋服など入りきらないものもあったが、当日持ってくるはずの梱包キットに入れられるはず。布団やなんかも旅行用真空袋に詰め込むことにして、準備万端。\n\n### 引っ越し手続き\n\n東京23区内での引っ越しでは聞いたことがなかったが、こちらでは引っ越しや大型家具の搬入などでエレベーターを使うときには、エレベーターを事前に予約することと、搬入出業者の損害保険加入証明書（Certificate of Insurance, COI）をビルの管理会社に提出すること、セキュリティデポジットや諸経費が必要な場合がほとんど。これは引っ越し作業中に建物を傷つけたり作業員が怪我したりした場合に、お互いがお互いを訴えたりしないように、だと思う。今住んでいるところも次に住むところもそれらが必要で、まずは引っ越し業者にCOIを提出してもらう必要がある。\n\nMan With A Vanはこれもやっぱり速攻で、2時間程度で2つのビル宛のCOIをメールで送ってくれた。あとはそれぞれの管理会社のフォームに必要事項を記入して、引っ越しの日と時間帯を書いてエレベーターの予約をリクエストする。今いるビルの方はPDFに書いたものをスキャンしてメールで送るのだが、引っ越し先のビルはWebサイトでエレベーターの仮予約をして、申込書とCOIをメールで送って、それが承認されればエレベーターも予約完了という流れだった。\n\n引っ越し先のビルはあっさり申し込みできたんだが、今いる方のビルから手続きの返事がちっとも来ない。4日待ってしびれを切らして、催促のメールを入れたらその返事でようやくエレベーターの予約が完了した。引っ越し予定日の4日前。\n\nビルの側からは「エレベーターの予約が確定するまで引っ越し業者と日時を確定しないように」と言われるが、引っ越し業者は人員の配置などから当然のように「日時はいつですか」から契約作業をスタートするわけで、完全に鶏と卵。引っ越し業者を決めなければCOIはもらえないが、COIがなければ申し込みができず、エレベーターの予約もできない。もちろん多くの場合で引っ越し業者側が日時の変更に応じてくれるのだろうが、この2フェーズコミット問題は本当になんとかならないものだろうか。\n\nあ、そうそうそれとNYCのビルの多くは週末の引っ越しを許可しないのでご注意を。僕の引っ越しは金曜日の朝一に設定しました。会社には休みをもらって。\n\n[ニューヨーク市内で引っ越しの当日](/blog/2018-03-22_-----------------bd1b22641946)へ続く\n\n"},{"frontmatter":{"slug":"/blog/2018-03-11_------------------2-ae04f126a97f","date":"Sun, 11 Mar 2018 16:02:02 GMT","title":"ニューヨーク市内で引っ越しの準備その2","epoch":"1520784122","excerpt":"ニューヨーク市内で引っ越しの準備その1からの続き…なんだけど引っ越した後の話になってしまった。"},"markdownBody":"\n### ニューヨーク市内で引っ越しの準備その2\n\n[ニューヨーク市内で引っ越しの準備その1](/blog/2018-03-11_------------------1-35e3f49ceed1)からの続き…なんだけど引っ越した後の話になってしまった。\n\n### Cutting cord\n\n2013年に来てからずっと変えていないものがVerizon Fiosのケーブルテレビ契約。入ったアパートではTime Warner Cable（現Spectrum）かFiosを選べたのだが、2週間入っていたAirbnbの部屋がTWCでまあ遅かったのと、Fiosは初年度契約がTWCより安い上に光ファイバーなので速い。Fiosにしない理由が見当たらず、Double playというやつで契約した。$79.99/moとかだったと思う。\n\nしかし初年度が終わると割引が消え、その後はテレビのチャンネル数を減らしたりなんだり頑張ってどうにか$120/moに抑える感じで、たけーなー変えたいなーと思っていた。引っ越し先のアパートを見にいったときも、必ずケーブル会社を確認していたが、ブルックリンだとOptimumが選択肢に入ることもわかった。Optimumの初年度プランはインターネットのみで$39.99。一応割引を受けているためVerizonとの契約を途中で切るとEarly Termination Feeを取られるが、それを払っても安上がりになる。Optimumの品質は不明だけど、まあダメなら乗り換えればいいさ。\n\nそういうことで、今月引っ越すので解約したいという連絡をVerizonのWebサイトのチャットで連絡する。この手の話でチャットで済むのはありがたい。\n\n当然といえば当然だがチャット先のサポートの人は、解約せずにVerizonのインターネットのみ契約への切り替えを提案してきた。全然脅すとかなんとかそんなつもりはなかったんだが、解約したいといったら向こうから初回契約のみのはずの割引プランを掲示してきて、結局Fiosの100/100のプランを$39.99で契約できることになった。アカウント自体は継続するから契約作業とかめんどくさいことはなくなるし、Verizon Fiosの品質はわかってるしってことで、月$10のWifiルーターのレンタルが入って$49.99/moということで。\n\nこれで今までに比べて$50以上浮いた。Cordをcutした以上、この浮いたお金を使う先は決まっている。\n\n### Netflix vs Hulu\n\n特にスポーツシーズンに結構ライブテレビを観ていたしニュース番組もそれなりに観ていたので、インターネット契約のみになってもライブTVは必要だろうなと思って検討を始めた。対象は、YouTube TV、Hulu with Live TV、DIRECTV NOW、PlayStation VUE、Sling TV。\n\nそれに、いわゆる動画サブスクリプションサービスで念願のあれやこれやも観たい。これまで$120も払っている上にさらに月$10で見る暇もないドラマを見るサービスとかないわーと思ってNetflixにもHuluにも入ったことがなかったのだ。Amazon Video、Netflix、Hulu。Amazon Primeにも入っていないので。\n\nAmazon vs Google vs Apple的な現状を考えると、YouTube TVはないかなあ。PS VUEはラインアップが弱いし、Sling TVとDIRECTV NOWは観たいチャンネルが高い。Hulu with Live TVはHuluも含まれての価格だから、まあお得っちゃお得かも。とは言いつつ、せっかく減らした月額費用が$40/moで吹っ飛ぶなあ。\n\nと、いろいろもやもやした結果、とりあえずNetflixを始めてみることにした。最初にNetflixにした理由は3つ。1つは[Icarus](https://www.netflix.com/title/80168079)を観たかったこと。[Lance Armstrongのポッドキャストに監督がゲストで出ている](https://lancearmstrong.com/podcast/the-forward-episode-80-bryan-fogel-part-1)のを聞いて、これは観たいと思った。ロシアのドーピングの話なんだけどそこに至る経緯がすごい。2つ目はBlack Mirror。[Rebuild.fm](https://rebuild.fm)でたびたび話題に上るので観てみたかった。そして、これらNetflixオリジナルのものにはどうやら日本語字幕があるらしいことが決め手になった。\n\nテレビにNetflixアプリが入っているので、何もつけなくてもテレビをWifiにつなげばリモコンのNetflixボタンを押して視聴できる。さっそくIcarusを観て、サン・ジュニペロを観て、Hang the DJを観て…\n\n… House of Cardsを最初から見始めた。どハマりした。平日に夕食を終えてから2、3エピソード、休日はもっとたくさん観続けて、Season 4の途中まで来た。でもまだStranger Thingsもあるし、ドキュメンタリーも観たいのが結構あるし、それなりに映画もあるし。\n\nLive TV観てる時間なくね？\n\n[ニューヨーク市内で引っ越しの準備その3](/blog/2018-03-17_------------------3-72cd85892fd1)へ続く\n\n"},{"frontmatter":{"slug":"/blog/2018-03-11_------------------1-35e3f49ceed1","date":"Sun, 11 Mar 2018 15:20:50 GMT","title":"ニューヨーク市内で引っ越しの準備その1","epoch":"1520781650","excerpt":"ニューヨーク市内で引っ越しを決めたからの続き"},"markdownBody":"\n### ニューヨーク市内で引っ越しの準備その1\n\n[ニューヨーク市内で引っ越しを決めた](/blog/2018-03-03_------------------c07c6b753d71)からの続き\n\n### My wireless history\n\nこの時点で僕は携帯電話の契約をしておらず、スマホはWifiでしか使っていなかった。ここでNYCにきてからの携帯電話の契約を振り返ってみよう。\n\nこの時代になっても電話番号は何かと必要なIDである。2013年にNYCに来て結構楽しみだったのも、AT&amp;TとVerizonどっちにしようかなーとかいうことだった。どっちのショップにも行ったんだけど、決めかねたのでとりあえずVerizonでPrepaidのフィーチャーフォンを買ってまずは電話番号をとった。この電話には結局3、4回チャージしてたぶん$150くらい払ったと思う。最初のアパートの契約作業や、その他諸々で電話がかかってくることもかけることも度々で、携帯電話があってよかったなあと思った。\n\n本物の電話番号があればGoogle Voiceのアカウントを作れる。携帯電話の番号をゲットしてすぐにGoogle Voiceのアカウントを作った。今でもこの番号が僕の電話番号だ。\n\n2013年に渡米したときに持っていた端末はSoftbankの201Mで、まだこれをSIMアンロックできていなかったので、とりあえずWifiで使いつつNexus 5が出るのを待っていた。11月にNexus 5をゲットして、Straight TalkというAT&amp;T系MVNOでとりあえず使い始め、その後Walmartで買えるT-Mobileの$30/moプランに変えて使っていた。\n\nPrepaidなのでたまに日本に1ヶ月ほど戻るときは、Refillせずに放置してまた帰宅したらRefillするようにしていたんだが、あるときふと気づいた。俺、電話もSMSも全然してなくね？\n\n朝起きて会社に行って夜帰って寝るという生活で、おまけに電話やSMSをくれる相手も全然いないとなると、携帯電話の契約を持っている理由が見当たらない。スタバはもちろん、マンハッタンではそこいらじゅうにNYCの無料Wifiのタワーがあるし、地下鉄の駅に降りれば地下鉄のWifiを使えるし、データを使えなくて困るということもない。\n\nそこで2014年の中頃に日本から戻ってきてから、Refillをせずに携帯契約をしないことにしてみた。Google Voiceには今は使えない携帯の番号が連携されていることになっているが、それでもPCブラウザーのGmail経由で電話をかけることも受けることもできる。受けることができるので、電話がかかってくることがわかっていれば、PCを開いて待機していればよい。いつかかってくるかわからない電話で、どうしても出なければならないものなどないので、それで十分だった。\n\nそれから3年ほど経過し、たまに両親がこっちにくるとかで連絡できないと困るときにStraight TalkにRechargeして1ヶ月使うくらいで、携帯の契約はないままWifiのみで生きてきた。友だちが訪ねてきたのに友だちの携帯で店を探させたりして。\n\n一番困ったのは[自転車事故で救急車で運ばれた](/blog/2017-10-02_-------------------------2d10b02652db)ときで、このときは会社にも家族にも連絡できずあーどうしようと思っていたんだけど、やっぱりERに無料Wifiがあって、結局そこまでは困らなかった。\n\n今どき手元のスマホでデータを使えない瞬間があるって最初は不安だけど、生活リズムができてしまえば、月に$50とか無駄に払っているのはバカバカしい。無駄じゃないことが多いんだろうけど、僕の場合は。\n\n閑話休題。\n\n### Tingで携帯電話再開\n\nそういうわけで携帯の契約がなかったんだが、引っ越し作業でふと気づく。前回同様、なにかと電話がかかってくるのでは？\n\n月に$50とか払うのはバカバカしいが、最近では使った分だけ払うMVNOがあって安く済ませようとがんばれば$20以内に収まるかもしれない。さっそく[宮川さん](https://rebuild.fm/)に[Tingのリファラルコード](https://z69tpj6ndek.ting.com/)を送ってもらって、TingのSIMをゲットし、Google VoiceにTingの番号を連携した。あっと[僕のコードも貼っておこう。ライトユーザーなら特にTingおすすめですよ](https://zql8fe716fn.ting.com/)。\n\n引っ越し作業が終わって結論を書くと、電話の契約は正解だった。特に後述の引っ越し屋さんとの連絡で役に立った。部屋を探しているときも電話がかかってきていることが何度かあったので、もっと早く気づいていればよかったなと思った。\n\n[ニューヨーク市内で引っ越しの準備その2](/blog/2018-03-11_------------------2-ae04f126a97f)へ続く\n\n"},{"frontmatter":{"slug":"/blog/2018-03-03_------------------c07c6b753d71","date":"Sat, 03 Mar 2018 15:26:52 GMT","title":"ニューヨーク市内で引っ越しを決めた","epoch":"1520090812","excerpt":"ニューヨーク市内で引っ越し先を探したの続き"},"markdownBody":"\n### ニューヨーク市内で引っ越しを決めた\n\n[ニューヨーク市内で引っ越し先を探した](/blog/2018-03-03_-------------------6d634505e7cb)の続き\n\n### 書類クエスト\n\n数日うんうん悩んだが、まあそうそうこの金額でこの程度の物件が出てくるとも思えないし、ブルックリンに住んでみたかったし、えいどうにかなるわってことでエージェントに連絡してアプリケーションを開始することにした。\n\n今回の物件はいわゆるCondo、分譲アパートの賃貸で、部屋の持ち主が僕を受け入れてくれること以外に、ビルの管理委員会がその賃貸を承認してくれることが必要になる。部屋の持ち主との暫定的な合意ができたら、ビルの管理会社へ書類を提出する（アプリケーション）必要がある。申込書やパスポートのコピー、給与証明、直近のbank statement、昨年の確定申告書類、直近の給与明細などの通常書類以外に、3種類のreferral letterが必須で、困った。\n\n1つはbusiness referralで、現雇用主からの推薦状的なもの。会社のFounding Partnerに頼んでみたら、ふたつ返事で引き受けてくれてほっとした。\n\n2つ目はpersonal (character) referenceで、雇用以外の関係者、ようするに友人からの推薦状。友だちのいない身としては誰に頼めばいいのか困ったあげく、前社のCFOにおそるおそる（僕たちまだ友達ですよね…）お願いしてみたら、これもふたつ返事で引き受けてくれた。ああよかった。ありがとうございます。\n\n3つ目がcurrent landlordからの推薦状。てことは今の大家さんに引っ越すよって言わないといけないのか。でもアプリケーションがうまく行かなかったら残留の可能性もあって、そうなると「へっへっへ家が見つからないんだろう、家賃をあげてやるぞ」とか言われないかとか、（今となってみれば）若干余計な心配をした。おそるおそるメールしてみたら、これもふたつ返事で引き受けてくれた。わりとよくあることなんですねたぶん。\n\nそういうわけで心配したわりに数日であっという間に書類は集まった。次はお金。\n\n登録手数料および引っ越し諸経費（これらはビルの管理会社へ）と、security deposit（敷金）1ヶ月分および最初の月の家賃（これらは大家さんへ）を、銀行小切手で用意する。（この時点での）現在の部屋を契約するときにこれが大変だったのだが [1]、5年住んでそれなりに慎ましく生きている今となっては何の問題もなく、銀行へ出かけてお金をおろす感覚で窓口に立ち「銀行小切手でちょうだい」っていうだけだった。\n\n小切手を郵送するのはなんとなくためらわれるし、通勤経路の途中だったこともあって、不動産屋さんに直に出向いて書類一切を手渡しして、アプリケーションがはじまった。\n\n[1] 前回はSSNもないし銀行口座は開いたばかりだし、その上口座の中身を急いで作るためにATMで日本の口座から下ろした金を、同じATMでこっちの口座に入れるということを（しかも限度額があるので3日にわたって）したため、口座にフラグが立ったらしく、残高を作って銀行小切手をもらいにいっても「審査が必要」って言われて、残高はあるのにしばらく小切手を切ってもらえなくて、Airbnbの終わりも迫っていて、ホームレスの危機に立ったのだった。銀行窓口のマネージャー的な人に、ホームレスになっちゃうんですよマジで、お願いしますよ、俺H-1Bゲットして日本から来たプログラマーだしマネーロンダリングとかいう額でもないですよね、とか半泣きで訴えて、やっと3日経った夕方にもらえたのでした。\n\n### 契約打ち切り交渉\n\nそして数日後、アプリケーションは無事受け入れられ、晴れて引っ越しすることに決定した。契約は2月15日から。つまり、このままだと2月から5月までの3ヶ月間、あのNYCに部屋を2つ賃貸していることになる。何このセレブ感。\n\n前述のとおり、基本的には契約期間中に家を出ることはできないので、大家さんとの合意を形成する必要がある。ググってみても、1ヶ月かぶるのは当たり前、あとはうまく時期を選んで探せよGood luck的な書き込みしか見つからず。どうせだめなんだろうなあと思いながら、おそるおそるメールで、referralのお礼と2月に引っ越すので契約を打ち切れないかと打診してみた。\n\nそしたら返事は思いの外前向きで、1ヶ月短縮に同意、さらに次の人が見つかればもっと短縮してもよいということに。この大家さんほんとにのんびりしてるというかガツガツ感が全然ない人で、なんだかとても助かったなあ。こっちの思い込みかもしれないけど、こんなにさらっとうまくいくことはめったにないんだろうなあと思った。Confrontationがとにかくイヤなので、言わないで済むなら言わないで済ませたいなあってつい思ってしまうんだけど、何でも言ってみるもんだなあというか、僕はもっと人を信じるべきなんじゃないかと思った。まあ次回もこうなるかはわからないし、次回引っ越しするときはもう少し期間を考慮しようとも思った。\n\n[ニューヨーク市内で引っ越しの準備その1](/blog/2018-03-11_------------------1-35e3f49ceed1)へ続く\n\n"},{"frontmatter":{"slug":"/blog/2018-03-03_-------------------6d634505e7cb","date":"Sat, 03 Mar 2018 14:29:44 GMT","title":"ニューヨーク市内で引っ越し先を探した","epoch":"1520087384","excerpt":"ニューヨーク市内で引っ越しの続き"},"markdownBody":"\n### ニューヨーク市内で引っ越し先を探した\n\n[ニューヨーク市内で引っ越し](/blog/2018-02-11_--------------6324113a2d34)の続き。\n\n### 南に向いてる窓を\n\n最初の物件を見に行ったのが土曜日で、そこで自分たちの中で固めた必須条件を満たす物件をさらに探してみた。もちろんそれなりによさげな物件はそこそこ見つかる。\n\nだがしかし、写真を見ただけでは安心できないのがStreet EasyやTrulia。同じビルの違う部屋の写真が平気で載っているし、説明に書いてある内容が実は古かったり単に間違っていたりすることは当然のようにある。\n\nそこでまずはFloor planから部屋の向きを確認する。ところがFloor planには方角が記されていないことも多いし、Floor planが違う部屋のものであることも往往にしてある。なのでFloor planがあってもうのみにせず、次に住所をGoogle Mapsとストリートビューで確認する。小さいアパートやタウンハウスなら、窓が南に向いて付いているかどうか、ストリートビューが撮影された時点で目の前に大きな建物はないか、くらいはわかる。\n\nStreet Easyには過去にその部屋がRentされたときの情報も載っていることがあって、過去のリスティングでは違う写真やFloor planを使っていることもあるので、そこらへんも調べる。また、大きな建物の場合は建物が全方向を向いていたりするので、目当ての部屋が南に向いているかどうか調べるのが難しいこともある。大きい建物の場合、ビル自体のWebサイトがあることが多いので、そこで部屋番号と向きを照らし合わせたり、自分の目当ての部屋にFloor planがない場合は違う階の同じ部屋番号のFloor planを探したりする。\n\n東京23区あたりでは説明に南向き日当たり良好って書くのは（ほんとにそうなら）当たり前だったと思うが、こっちでは必ずしもそこがウリのポイントではないのか、Southern exposure, lots of sunlightと書いてあるものもあれば（うのみにはできない）、実際はそうなのに書いてないこともある。特にマンハッタンでは日当たりは贅沢品なので、日当たり重視で探すならこういう手間暇をかけることになる。もちろん出かけていって見てみるのが一番いいのだが、ハズレ物件をいくつも見るのはしんどい。\n\n### 近い物件発見\n\n同じ土曜日の夜に1つ物件をStreet Easyで発見した。立地は以前に日本から同僚がNYCに来たときに彼らが使ったAirbnb物件のすぐ近くで、少しだけ土地勘がある場所。アパートは、写真を見る限り部屋は明るそう。\n\nさっそくFloor planを調べ、ビルのWebサイトで部屋の場所や向きを調べる。幸いビルのサイトに階ごとの部屋の配置と向きが出ていたので、それとFloor planを照らし合わせて南に向いて窓があること、南側は道ではなく中庭なのだが、7階建ての6階で中庭部分は抜けているのでおそらく日はだいぶ入るだろうことを確認して、内覧のアポをStreet Easyから送った。\n\n夜中に送って翌日の日曜日を希望したので、無理かなあと思っていたんだが、日曜日の午前に返事がきて、夕方4時45分に待ち合わせて見せてもらうことに。1月の夕方5時だともうだいぶ暗いので、日当たりは見られないかなあと思いながら、街並み的なものも確認するために2時過ぎに出かける。\n\n最寄り駅まで地下鉄で行って、そこからぶらっと歩きつつ街の様子を確認する。Wholefoodsは今のとこより近いし、さらに近いところにもう1件スーパーがある。カフェだのバーだのレストランだのも結構あるし、人通りも多い。アパートのある建物の周辺は日本語でいうタワマンがにょきっと生えていて、再開発だなあって感じ。\n\n…とかほんとはもっとぶらっとしたかったのだが、なんせ3時過ぎると寒さで辛くなるので、4時半ごろにはビルに入ってロビーのソファで不動産エージェントを待つ。\n\n5時過ぎに現れたので、部屋を見る。ギリ太陽光がある状態でこんだけの明るさならまあいいかなあ。部屋も今より広いなあ。窓は今より大きい。中庭経由でお向かいさんの窓と向かい合っているのが気になるが、洗濯機が部屋に付いてる！外にも各階に大型の洗濯機がある。ゴミ捨ても各階でできる。ジムやコンシェルジェなどのありがちなアメニティもある。15分ほどで見て回って内覧は終え、アプリケーションのための書類をとりあえず送ってもらうことにした。\n\n### 家賃交渉\n\n場所もいいしアパートもきれいだしほぼ完璧に南向きで日が入るしということで条件はクリアしていた上に、すでにめんどくさくなってきており、いやーこれでいいっしょーって気分になっていたんだけど、妻にとっては初のブルックリンで、中庭を挟んでいるとはいえ目の前に他人の目がある感じで、えーどうかなあ、うーんうーんとか言いながらその後一週間、その間も部屋をいろいろ探して1件は見てみたものの、特によいものにはあたらない。\n\nそんな中不動産エージェントからメールが来て、「こないだ送ったメール見てくれた？」あ、見てなかった。だいぶめんどくさくなってきていたし、ここはいっちょダメ元でという気分で、$100下げてくれと家賃交渉をしてみることにした。ダメなら断る理由にもなるし。\n\nエージェントからの返事は「交渉するなら、こっちも何か、たとえば契約期間を長くするとかしたら？」ということで、当初12ヶ月のところを18ヶ月コミットするから、$100下げてくれと言ってみる。これは、14とか16とか言えばよかったと後悔した。\n\nそしたらなんと、家賃下げOKの返事が。やばい。どうしよう。\n\nこちらの賃貸契約は、東京23区あたりの賃貸では当たり前の、別に契約期間に関係なく2ヶ月前連絡でいつでも出られるというものではなく、どんな事情であれ双方の合意がなければ契約期間中の家賃支払いは必須なので、出なきゃならない場合は例えば自力で代わりに住む人を見つけてこいとか、住まなくても構わないけど家賃は払えよとかそういうことになるので、コミットメントなのだ。\n\n（その時点で）現在住んでいるアパートの契約が5月半ばまであるのに今回のこのアパートは2月半ばからの契約になってしまい、3ヶ月分も重複してしまう。どうしよう。\n\n[ニューヨーク市内で引っ越しを決めた](/blog/2018-03-03_------------------c07c6b753d71)へ続く\n\n"},{"frontmatter":{"slug":"/blog/2018-02-11_--------------6324113a2d34","date":"Sun, 11 Feb 2018 15:18:37 GMT","title":"ニューヨーク市内で引っ越し","epoch":"1518362317","excerpt":"ニューヨークであれそれをしたシリーズ。"},"markdownBody":"\n### ニューヨーク市内で引っ越し\n\nニューヨークであれそれをしたシリーズ。\n\n### 序\n\n春が近づくといつも憂鬱になるのが、大家さんと家賃の話をしなければならないこと。5年前にニューヨークに到着して以来住み続けている今のアパートは、アメニティもロケーションもよくて、5年も住んでれば周囲の土地勘みたいなものも定まることもあって居心地がとてもよいんだけど、毎年毎年少しずつあがっていく家賃がもはや限界だなあ、と思い始めていた。\n\nそういうわけで、年初から重い腰をあげて部屋探しを始めた。当初は、とはいえ5月まで部屋の契約があって原則的に突然契約を終わらせることはできないことになっているので、まあ物件を見る練習ってことでいいかなあくらいの軽いノリ、のつもりで。\n\n### 諸条件\n\n今のアパートはマンハッタンのFinancial Districtにあるのだが、引っ越しをする以上家賃を下げることは必須の条件。そうなると、ほぼ必然的にBrooklynやQueensなどへの移転ということになる。オフィスがBrooklynのGowanusにあるので、Queensからだと遠いかなということで、主にBrooklynで探すことに。\n\n場所以外の条件としては、買い物するスーパーが徒歩圏にあること、夜はともかく日中はそれなりに人の往来があること、でもうるさくないこと、洗濯をアパート内で（部屋内でとは言っていない）できること、部屋に自然光がそれなりの時間入ること、くらいかなあ。ジムとかドアマンとか配達の集積とかのアメニティはあきらめるつもり。\n\n### 手段\n\n住みたい場所が決まっているなら、東京23区あたりと同様に不動産屋さんに直接でかけて、大まかな条件を言って物件をいくつか見せてもらう…なんてこともできなくはないんだろうけど、東京23区あたりとは違って、同じ道でも数ブロック移動すればがらっと雰囲気が変わってしまうのがこちらの街。距離的に千駄ヶ谷と錦糸町くらいの違いかな？みたいなつもりで行くと、実は千駄ヶ谷と千葉県流山市くらい違う。そういう土地勘は全然ないので、まずは物件を探してみて、そこを見に行くことを続けて土地勘を養いつつ、と思っていた。\n\n物件探しのツールは[Street Easy](https://streeteasy.com/rentals)と[Trulia](https://www.trulia.com/)。Street Easyのほうがサイトやアプリが使いやすいが、TruliaにはCrime MapとかStreet Easyにはない機能がある。ちょっとした時間にアプリやサイトで、大体の金額や場所で検索して、写真で見た目が気に入ったらお気に入りに保存して、夜に家でその中身を検討する。\n\n当たり前だが、今検索して出ているのは、現在市場に出ているか近々市場に出る物件であって、1ヶ月後にはまた違う物件が出るわけだが、手続きだなんだを考慮すると、そんなに練習時間もないよなあ、とか思って、ある週末にさっそく見つけた物件を1件見に行った。場所はGreenwoodというPark SlopeとGowanusに隣接したエリア。通勤至近、お家賃安め。Wholefoodsには…自転車で行く感じ。[Industry CityというモールにSunrise Mart（日本食スーパー）が入るらしい](https://ny.eater.com/2017/10/20/16504268/japan-village-industry-city)、などの情報からそこそこいいんじゃないか？的な。\n\n### 物件内覧その1\n\nStreet EasyでOpen Houseの予定が出ていたので、そこから行きたい時間を指定してメールを送る。エージェントが割とすぐに返信してきて、現地で待ち合わせをすることに。\n\n当日、結構寒い中外で待っていると、中からエージェントが出てきてさっそく部屋へ。ビルは新築で、部屋も過去の入居者なし。1ベッド1バス、お家賃$2,400。バルコニーがあってバーベキューグリルが付いてる！屋上にもバーベキューエリアがあり、駐輪場完備、エアコンは三菱、などなど、まーちょっと狭いかな？っていうのを除けば、部屋自体は相当良い。\n\nだがしかし、難点が2点。まず部屋が北東向きで日があまり入らない感じ。暗くはないんだが、日が入ってくる感じでもない。バルコニーがあるのはいいんだけどねえ。日中部屋にいることが多いとやっぱり部屋の居心地は大事。そもそも今の部屋も当初の予定より高かったけど、どうせひきこもるんだし日が当たって外を見渡せるのはいいよなあと思って選んだんだった。\n\n2点目は街。とにかく古いタウンハウスが並んでいる昔の住宅地で、昔ながらの商店とちょっとしたスーパーがあるものの、日中でもあんまり人は歩いていない。[Industry City](https://industrycity.com/)まで歩いていけっていうのも、距離というよりは近所の不安感という意味で、辛そう。おそらくあと2年もすれば開発されて人口が増えるんだろうし、自分一人ならまあ問題はないんだけど、結構な重点項目にバツがついた。というか、ここを見てみてほんとに重視する項目はなんなのかがはっきりした感じ。もちろんこれらの難点があるからこそ、家賃がそれなりの範囲だってことなんだけども。\n\nというわけで、パス。まあ、まだ始めたばかりだし、物件はまだあるさ。[ニューヨーク市内で引っ越し先を探した](/blog/2018-03-03_-------------------6d634505e7cb)に続く。\n\n"},{"frontmatter":{"slug":"/blog/2017-12-17_----------13490d2fdef1","date":"Sun, 17 Dec 2017 17:00:57 GMT","title":"自転車事故のその後","epoch":"1513530057","excerpt":"ニューヨークで自転車事故にあって、鎖骨を折って、手術を受けてから2ヶ月。術後の経過は良好で、2度の通院でも特に問題なし。ただ、骨をつないでいる金属板の存在を日々感じるので、違和感が常に左肩にまとわりついている。"},"markdownBody":"\n### 自転車事故のその後\n\n[ニューヨークで自転車事故にあって](/blog/2017-10-02_-------------------------2d10b02652db)、[鎖骨を折って](/blog/2017-10-02_-----------------------39bae6cabb2c)、[手術を受けてから](/blog/2017-10-02_-------------------------d8cb3ae7d810)2ヶ月。術後の経過は良好で、2度の通院でも特に問題なし。ただ、骨をつないでいる金属板の存在を日々感じるので、違和感が常に左肩にまとわりついている。\n\n最終的に自分の保険のOut of pocket maxである$6,000に達したので、（この1年については）$6,000以上の自腹負担はない、らしい。この国のこと、まだ油断はできないが、ひとまずそういうこと。\n\nこれについては保険会社のカスタマーサポートに連絡を入れて、2度確かめた。というのも、外科手術の費用として病院に払う分だけで$5,300で、外科医師の施術費用$1,400と合わせただけでOut of pocket maxに達するのは明らかで、でもどういうわけか保険会社のWebサイトを見ても、いつまでたってもこの$5,300のClaimが確定しない。これが確定しないので、Out of pocket maxに達していないという状態のまま、やれX-Ray$25だ、やれ医師の診察$60だと細かい金額の請求書が積み上がっていって、いやいや、これらは払わなくていいはずだろ、俺はもう$5,300も病院に払っていて、$1,400の外科医師費用を払ったらオーバーしちゃうんだから。\n\n保険会社からの最初の返答は、まだ処理中ってことだったので、いや通常2週間かかるって設定になっててすでに3週間を過ぎていること、この金額が確定すればOut of pocket maxを越えることが確実なのに、他の細かいのは最近の日にちのものも含めてどんどん確定して請求されているのに、一番大きい金額のものをいつまでも確定しないのはunfairであること、などを再度主張したら、その返答として突然の計算結果がやってきて、めでたく$6,000に収まるような金額に設定された。\n\nそれを受けてさらに1週間後、手術当日に先払いした$5,300のうちの$1,800くらいがrefundされたので、外科医の施術費用$1,400を支払った。手術からすでに2ヶ月以上経過していた。\n\nそうなんです、日本の方は疑問に思ったかもしれませんが、こっちでは外科医と外科医が手術を行う病院の設備利用料は別建ての会計です。病院にまとめて払うわけじゃないんです。麻酔科もレントゲンも全部別。もっとも支払う作業自体はNYUのWebsサイトでできますが。\n\nやっと一息ついたかなと思ったら、今度は救急隊から救急車の請求$700が2ヶ月以上経ってから来たんだけど、こちらは請求書に書かれていることに従って保険の番号などをWebで入力したら、数日後に$0に確定していました（すでにOut of pocket maxをオーバーしているから）。\n\n事故って以来、加害者側とかかった金額について都度連絡をメールでしていて返信もちゃんと来ていたので、$6,000が確定したので、それに上乗せして$7,000でどうだ、という請求をした。実は一番最初、まだ金額が確定していないときに、Out of pocket maxを信じて$7,000の請求を一度したんだけど、そのときはまあ確定してからにしませんかと言われて、まあそうするかってことにしていたので。\n\nまあ案の定というか、「ようやく奨学金を返し終えたばかりでやっといくばくかの貯金ができたばかりである」「実は春先に子供が生まれる予定」「そもそも事故を自分なりに検証したんだが、原因がどちらにあるかはambiguousだと思う」と。\n\n正直だいぶ迷った。彼はその場から逃げてしまうこともできたはずで、そうされていたら多分見つけられなかったと思う。しかし彼は逃げず、警察官（交通整理担当でたまたまそこにいただけで、事故の処理のために呼ばれた人ではない）に対してきちんと自分の身分を明かして調書にも名前と住所が載っている（はず。見てない）。メールを送ったら心配している旨の返信もよこしたし、そもそも連絡先をきちんと置いていった。この正直者を、その正直さゆえにpunishすることが正しいのか、と。\n\nただ、やっぱりどう思い返しても、あのとき彼が逆走さえしなければ俺の肩に異物が入ることはなかったし、彼だって無駄にお金を使うこともなかった。逆走されて「半々」というのは納得がいかない。\n\nということで、「わかった。$5,000でどうだ。別にこちらの責任を少し認めるわけじゃない。この不愉快な会話を早く終わらせていつもの生活に戻りたいだけだ。逆走しておいて半々というのはどう考えてもunfairだ。」という返信をした。\n\nするとこれも案の定、「$5,000で手を打とう。前のメールで書いた通り今手元にその金はないから、5回分割にさせてくれ。それと、この件でこの後法的措置をとってその結果がこちらの（注：加害者側の）不利に働いた場合、この$5,000は返金すると約束してほしい。」ま、そうですよね、ってことで今絶賛返金受け取り中。\n\n$1,000も出費することになったし、今後、例えば肩に入っている金属板をとる手術を受けるなら、その費用は完全に自腹だし、自転車だって見た目は平気だけど乗ってみたらどっか壊れているかもしれないし（まだ再開できてない）、弁護士さんが聞いたらアホって言うだろうけど、もう精神的に、なんというか、めんどくさい。ああ、正直者が罰を受けていいのかとか、ああでもじゃあ被害者たる自分は救われないのか、とかいうことを考え続けて毎日を過ごしたくない。\n\nそういうことで、この項は誰の参考にもならないと思いますが、一応記録として残しておくことにしました。おしまい。\n\n"},{"frontmatter":{"slug":"/blog/2017-12-09_Essential-PH-1-----1---5d3b0757a03c","date":"Sat, 09 Dec 2017 19:39:52 GMT","title":"Essential PH-1 を買って1週間","epoch":"1512848392","excerpt":"Essential PH-1を買って1週間たちました。$300未満（購入したときのディール）でSnapdragon 835なAndroidの使い勝手とは。"},"markdownBody":"\n### Essential PH-1 を買って1週間\n\n[Essential PH-1を買って](/blog/2017-12-09_Essential-PH-1------18f33b97acd2)1週間たちました。$300未満（購入したときのディール）でSnapdragon 835なAndroidの使い勝手とは。\n\nチタンの筐体は、プラスチック感満載のNexus 5Xと違って何か高級品を持っているような感覚。テーブルにもそっと置いてしまう。手に持つと重いのは重いんだけど、「手に収まっている」感じでまあ、長時間持ち上げて撮影とかでもない限り問題ないです。ケースは使っていませんが、えらいすべります。まあ早晩落としますねこりゃ。\n\nまー2年ぶりの新車だし、速く感じますよねそりゃ。カメラの起動が遅いって文句を見かけた気がするんだけど、普通の写真については、アイコンに触って撮影できるようになるまで1秒以内な気がします。最初はどうだったのか知らないけど、最初がそこまでひどかったんなら、すごく改善されたんだと思います。\n\n[Googleカメラ](https://www.xda-developers.com/google-camera-hdr-customization-raw-support/)も入れて、同じシーンを両方撮って見比べてるんだけど、うーん、何か違う？全然変わらない気がします。Essentialのカメラアプリは、HDRがデフォルトではオフになっていて、少しでも暗いときにオンにすると「明るいところで使う機能だよ」ってToastが出るんだけど、無視してHDRで撮ってこれ。特に問題ないと思うんだけど。\n\n|||\n|---|---|\n|![Essential](/images/1*PhV2X0MgOJ4ashL1IG4nhw.jpeg)|![Google](/images/1*t520QxeBgucs_5Guwo6kpA.jpeg)|\n|![Essential](/images/1*pXDhLXoZdtpYKv8ULRGaQA.jpeg)|![Google](/images/1*ga5PExdzMrVkb6toa08vwg.jpeg)|\n\n光量が少ないところでたぶんGoogleカメラの方がよい。ということはソフトウェアでどうにかなるってことだから、アップデートに期待しつつ、まあもう少しいろいろ撮影してみないと。もともと写真のクオリティにそこまでこだわりのある人間ではないし、イラっとするような遅さもないので、今のところ問題なし。\n\n[今回のお得ディールで](/blog/2017-12-09_Essential-PH-1------18f33b97acd2)ついてきた360度カメラ。世界最小らしいです。360動画も撮れます。まあ面白いよねぇ…。\n\n11月のカメラアップデートで、iPhone 7 Plus以降のハイエンド機では必須になった感のある[ポートレートモード](https://www.engadget.com/2017/11/30/essential-phone-portrait-mode/)が増えました。\n\nうん、いいんじゃないでしょうか？あれやこれと比較してどうかはわからないけど、満足してます。\n\niPhone Xのあの部分のことは「のっち」と呼ぶそうなので、Essential PH-1のこの部分のことは「ゆかちゃん」と呼ぶことにします。\n\n見ている限り、アプリの「ゆかちゃん」対応は3段階あります。一番ダメなのが、ステータスバーの後ろに行ってしまってオプションメニューやナビゲーションドロワーを開けない（または開くのが難しい）アプリ。\n\n|||\n|---|---|\n|![Feedly。未対応](/images/1*0hFDnVStKxvJn2tLjo9Rlw.jpeg)|![Yahoo Fantasy Sports。未対応](/images/1*l6qgEJUx-jaQIWSdtwrB7g.jpeg)|\n\n松竹梅なら竹のものがたぶん最も多くて、プラットフォーム提供のウィジェットに変な手を入れていないとこうなるんだろうと想像。TwitterやInstagram。\n\n![Instagram。普通](/images/1*IA42BLO9R-sjAc2rXZS6_A.jpeg)\n\n松レベルなのがGoogle Maps、City Mapper、Google Play 系（StoreとかMusicとか）。かしゆかの裏まできっちり利用しつつ、ツールバーはかしゆかの下に表示して操作できます。\n\n![Google Maps。ゆかちゃんの横にYankee Stadium。](/images/1*RC6IalFEwaB_WjnA8G5_xQ.jpeg)\n\n一番ダメなタイプのアプリがなぜああなるのかの原因はなんとなくわかっているので、別途コードを書いて検証しようと思います。\n\n地下鉄で横に座っている人のiPhone Xをガン見したときに、「のっち」は不自然に邪魔だろーこれーとかおもったんだけど、「ゆかちゃん」はまったく邪魔じゃないというか特に違和感ないです。「のっち」より細身だし。\n\n3.5mmヘッドホンジャックはありません。USB-Cからの変換ドングルが付属してます。僕はこれにあわせて[Refurbishedで$189だったSony WI-1000X](https://www.amazon.com/Sony-WI-1000X-Cancelling-Headphones-Refurbished/dp/B0774YYR2Y/)も買いました。この[SecondipityってSeller](https://www.amazon.com/sp?_encoding=UTF8&amp;asin=&amp;isAmazonFulfilled=&amp;isCBA=&amp;marketplaceID=ATVPDKIKX0DER&amp;orderID=&amp;seller=A3FG7YW6YCE8DR&amp;tab=&amp;vasStoreID=)は出荷も早いしSony製品を扱っていておすすめ。\n\nNFCペアリングをやってみたくて、でもNFCが本体最下部右側に配置されていることがようやく判明するまで手こずったけど、あとは問題なし。ただ、Oreoが来るまではLDACもaptXもないので、Oreo早くこないかなあ。\n\nで、そのOSアップデートなんですが、開封直後に4回のシステムアップデートを受けて、使い始めた翌日にさらにDecember Updateがきました。Pixelより2ヶ月連続で早く提供できたとかなんとか。\n\n[ ](https://twitter.com/essential/status/938111279188787200)\n\n少なくとも現状ではEssentialのソフトウェアチームはかなり積極的にアップデートを行っていて、Oreoのベータも始まってるし、この調子が続くならGoogle謹製でなくても問題ないなあ。\n\n[ ](https://twitter.com/essential/status/936275149736763392)\n\n[Essentialの社是](https://www.essential.com/blog/why-I-started-essential)?のようなところでAndy Rubinが書いている「Devices shouldn’t become outdated every year. They should evolve with you.」を信じるなら、この調子は続いていくはずなんだけど。\n\nAndy RubinがGoogleを辞めた理由みたいなことが今話題になっていて、それがどこまで事実なのかこの時点ではよくわかっていないんだけど、Andy RubinがいなくなるようなことがあるとEssential社の存在意義みたいなのは急に方向性が変わっていってしまうと思うので、綱渡り感はありますね。[Amazonからの出資を受けた](https://techcrunch.com/2017/08/09/essential-confirms-300m-funding-amazon-and-best-buy-retail-availability/)ので、次世代Fire Phoneになっちゃうんじゃないかみたいな話もあったし。\n\n追記：Andy Rubinは職場復帰してました。\n\n[ ](https://twitter.com/atsushieno/status/939582678751260672)\n\n### まとめ\n\n$499で十分お買い得な上に、[実際に入手した額](/blog/2017-12-09_Essential-PH-1------18f33b97acd2)のことを考えると、買ってよかったとしか言いようがない。もう2、3セット買って親兄弟に配ればよかった。まあまだ使い始めて一週間なので、その後どうなるかはまた書くかもしれないですが。ちなみにUSではSprintがキャリアで販売しているので、Softbankワンチャン。。ないのかな。\n\n"},{"frontmatter":{"slug":"/blog/2017-12-09_Essential-PH-1------18f33b97acd2","date":"Sat, 09 Dec 2017 15:55:49 GMT","title":"Essential PH-1 を買った","epoch":"1512834949","excerpt":"Cyber Monday のディールで Essential PH-1 を $300 未満で買いました。"},"markdownBody":"\n### Essential PH-1 を買った\n\n2016年の初代Pixelを（主に価格的な理由で）スキップして、その分2017年のPixel 2はXLを買っちゃうぞーと思いながら、Nexus 5Xを使い続けていた。その間、[Nexus 5Xのブートループ問題に遭遇](/blog/2017-07-17_Nexus-5X-------1bb1d9c07087)して交換してもらったけどもっさり感は特に改善されず、Black Fridayの何か（値下げとかオマケとか）を期待して11月末までがんばって、それでPixel 2 XLにしようと思っていた。\n\nところが先日の[自転車事故](/blog/2017-10-02_-------------------------2d10b02652db)のせいで計画にない多額の出費を迫られ、計画は完全に頓挫。事故の加害者側との示談交渉もはかどらず、Nexus 5Xをトレードインしても$800以上の出費になると思われる電話を買うような金はない！ってことに。ため息。\n\n交換後のNexus 5Xでもう1年ひっぱるのかなあ、と意気消沈していたところに、[EssentialがPH-1を$200値下げした](http://www.itmedia.co.jp/news/articles/1710/23/news057.html)というニュースが。ベゼルレスでチタン筐体でAndy Rubinという鳴り物入りで登場して、でもカメラが遅いとか写真の質が低いなどの理由でパッとしない感じだったあれだけど、Snapdragon 835で128GBでデュアルカメラってスペックで$499ってお買い得じゃね？その後11月に入り、Black Fridayまだかなーと思っていた矢先には、なんとさらに[$50値下げしたというニュース](https://www.droid-life.com/2017/11/06/deal-essential-phone-drops-another-50-best-buy-just-449/)が。\n\n調べてみると、カメラ問題はその後のソフトウェア アップデートでだいぶ改善されているらしく、さらに[勇者がGoogleのNexus/Pixelカメラアプリを移植していて](https://www.xda-developers.com/google-camera-hdr-customization-raw-support/)それを使えばだいぶよい写真が取れるという評判もあり、これは！\n\nBlack Fridayの週の水曜日。あーどうしようかなー買っちゃおうかなーなんて思いながらAmazon.comの商品ページを見ていてふと気づく。マーケットプレイスに中古が出品されていて、お値段なんと$389。見に行くと、出品者はAmazon Warehouse Dealsで、つまり返品か倉庫内での傷物であり、問題があったときの返品対応とかは、Amazon.comなので心配が少ない。これはお得！ポチってしまった。まあBlack Friday期間中のFree Shippingなんで、2週間後には出荷されるかなあ、くらいの感じで待ち始める。\n\n日付は進んで、翌週月曜日。Cyber Mondayってやつ。ニュースを眺めていたら[Essential PH-1が$399になった](https://www.theverge.com/2017/11/27/16704228/essential-phone-cyber-monday-deal-399-low-price)という記事に遭遇。ええっ、$10プラスで新品か。どうする、ランチ1回分だぞ？と思いながらAmazon.comのページを見に行くと表記は$499。あ、終わっちゃった？と思って記事を見直したら、360カメラ付きで$399と書いてある。で、そっちのBundle Dealを選んだら本当に$399。これは！\n\n先日の注文は幸いまだ出荷されていない。マーケットプレイスの出品物は、通常のAmazonとは違ってすぐに出荷準備中になってキャンセルするのがちょっと難しいんだけど、Amazon Warehouse DealsはAmazonなので、問題なし。キャンセルして、$399の360カメラ付きを改めて購入。つまり、2017年のハイエンド仕様のAndroid電話を$290で買ったってことですよ。カメラが多少ダメだろうと、会社の先行きが若干不透明だろうと、これはお得すぎるでしょ。\n\n![Yes they were.](/images/1*Gij1N5kDwkpSx5dhnVjM0A.png)\n\n1週間の待ち時間を経て、12月3日に無事届きました。[1週間後の使用感](/blog/2017-12-09_Essential-PH-1-----1---5d3b0757a03c)へ続く。\n\n```\n<a href=\"https://mobile.twitter.com/fumiakiy/status/937836294872420352\"></a>\n```\n\n"},{"frontmatter":{"slug":"/blog/2017-10-02_-------------------------d8cb3ae7d810","date":"Mon, 02 Oct 2017 03:57:32 GMT","title":"ニューヨークで自転車事故にあって外科手術を受けた","epoch":"1506916652","excerpt":"この話はニューヨークで自転車事故にあって鎖骨を折ったの続きです。"},"markdownBody":"\n### ニューヨークで自転車事故にあって外科手術を受けた\n\nこの話は[ニューヨークで自転車事故にあって鎖骨を折った](/blog/2017-10-02_-----------------------39bae6cabb2c)の続きです。\n\n### 手術当日\n\n前日午前0時以降は飲食一切禁止ということだし、朝6時には起きないとだしということで、前日はとっとと寝て金曜日の朝。6時半ごろ出発して地下鉄に乗って歩いて NYU Langone Tisch Hospital に到着。でかい。NYU すごい。NYU の病院施設だけでこんなにたくさんあるのに、NYU には他にもキャンパスがたくさんあるし、すごい。桁が違う。\n\n教わった通りに4階の受付へ進み、8時にはなっていなかったけど受付に通されて、またしても同意書などにサインをして、$5,300をクレジットカードで払う。これ、渡米1年目とかだったらもしかして信用枠がなかったかもしれないし、そうしたらどうしてたんだろう、昨日のうちに銀行で小切手を作ってもらっていたんだろうか。\n\n（後で見たんだけど）領収書をみると、手術の総額は$16,000を超えていた。Deductible $2,000 を引いた$ 14,000程度の CoPay 20% + $2,000（Deductibleは払わないといけないから）ということで、プラスSurchargeとかで$5,300的な値段でした。\n\nここで妻を待合室に置いて、診察室的なところへ通され、20分くらい待たされた後に、看護師から服を脱いで、身体を拭いて診察着に着替えて、着替えや靴をこの（NYU ロゴの）袋に入れてと指示があり、済ませる。済ませて、看護師が一連の質問（最後にものを食べたのはいつだとか、酒飲んでないかなど）をして、診察室へ妻が登場。\n\n次に今回手術を行う医師についているresidentだという2人の医師が登場し（2人とも初めて会う人）、手術のリスク事項について説明する。とはいえ、手術の内容は普通のもので、この医師の腕もよいから大丈夫、はははっと。それと、輸血が必要になったときに輸血を受けるつもりがあるかも聞かれた。もうぜひとも輸血してくれと答えた。そして、すべての説明を受けた旨を記したところにサインをするところで、ハタと気づく。\n\n### 通訳システムMartti\n\n前日の電話のとき、この説明時に通訳を必要とするかどうか聞かれて、医学用語がわからないことが多いのでお願いしたいがいくらかかるかと聞いたら「いや、無料ですよ」と言われたので、お願いしていたのだった。それが記録にあったので、よし通訳を呼べ、と。\n\nそして登場したのが、車輪付きで移動可能なデカい自撮り棒の先にiPadがくっついているスタイルの[Martti](https://www.martti.us/)というもの。とはいえただのSkypeではなく、お互いのコード番号やアクセスコードやらをやりとりして初めてつながるような、患者のプライバシーやその他セキュリティに配慮した特化型システムのようだった。\n\n日本人と思われる女性が音声越しに（人によってはビデオ通話なんだけど、日本人はほとんど音声だね、と看護師が言っていた）通訳をしてくれたのだが、結論としては僕には不要だった。というのは、医師はもちろんわかりやすい言葉で説明してくれるし、意味のわからない言葉は意味がわからないと言えばいいだけなので。手元にスマホがあれば、単語を入力したり入力してもらったりして、調べることもできるし。ただ、英語がほんとうにできない人にとっては安心だろうし、そもそも日本語だけじゃないいろんな言語に対応しているらしきシステムで、これはほんとにやっぱりニューヨークだなあと思った。英語を話せなかったために適切な医療を受けられなかったという状況を極力減らすための努力なんだなあと。システム自体は別の会社が提供しているぽいから、お金はかかっているはずなんだけど、通訳が必要という理由で医療費がさらに増えたりはしないという、通訳はluxuryではないということか。\n\n考えてみたら、救急車に乗って最初に隊員に聞かれたのも、救急病院で最初に聞かれたのも、「Do you speak English」だった。アメリカの他の街で病院に行ったことはないので比較はできないけれども、ニューヨークが多様性にあふれる都市であることを良いことだと思っていて、それを維持するために努力をしている街なんだなあと大げさながら思った。東京オリンピックに向けた国際化の取り組みは…とか少し思う。\n\n### 手術準備…\n\n外科手術の同意を終えて、次は麻酔の同意があるはずなんだが、看護師が「手術室の機器に問題があって、ちょっとおしてるから1時間くらいかかると思う」と。1時間くらいボーっと待っていると、木曜日にオフィスで会った執刀医が登場し、「やあやあ、ちょっと機械に問題があってねえ、あと2時間くらいかかりそう。待っててくれよ。同意書はOK？OKね。よしじゃあ印をつけて、と」とかいって、患部になにやら印をつけ、手の親指にはニコちゃんマークを書いて去って行った。\n\nこの部屋にはテレビがあって、なんでも見放題だったんだけどあまり見る気もしないし、CNNをぼーっと見て（このとき[この空軍学校での差別問題に関するスピーチ](https://www.youtube.com/watch?v=WfjZ1otkS3o)のことが流れていた）たりして、そして寝たりして、とにかく退屈で何もない時間がすぎる。あげくに看護師が交代する時間になって、外で引き継ぎをしている様子も聞こえたり。\n\n結局麻酔科の医師がやってきたのは、たぶん12時半くらいだったと思う。4時間以上何もせずに待っていたのだった。自分はともかく、部屋が結構寒くて同じ部屋にいた妻が風邪をひくんじゃないかと。\n\n麻酔科の先生も麻酔の内容とリスク説明をして、同意書にサインして、と日本語のページを開き、そこで看護師が「あ、日本語のページにサインするなら、通訳してもらわないと」「あ、そうなの？じゃあ英語のページで」「いや、外科手術の同意を日本語でしてるから、これも日本語じゃないと」「あ、そうなの、じゃあMarttiか。」ということで再度Martti登場。朝とは違う日本人の方が、通訳をしてくれた。必要なかったけど、でもありがとうございます。通訳コードを入れて、同意書にサインして、完了。\n\n### 手術へ\n\nようやく順番が回ってきた午後1時半。車椅子に乗って手術室へ。ここで妻とは別れ、一般とは完全に隔離されたエレベーターへ。車椅子を押している人が無線で「患者搬送、4階から6階」というとエレベーターが到着する。中にもエレベーター操作専門に乗ってる人がいて、その人がフロアのボタンを押す。とにかくエレベーターやボタンやその他に、患者や車椅子を押す人が一切触らない仕組み。院内感染防止ということらしい（書いてあったのをチラ見しただけ）。\n\n手術室のフロアーは騒然としていて、「この病院、まだこんなにたくさん医師と看護師がいるの？？」ってくらいたくさん人がいた。手術担当の看護師が僕を受け取って、名前や生年月日で本人確認をし、手術室へ。ドラマでおなじみの、目の前にでかいライトがあるベッドへ上がり、右手の甲に点滴の針を刺され、点滴で麻酔を入れますよー、もう1回お名前と生年月日を、とベッドの上で言わされ、もう一人の看護師が「私も担当ですよろしく」「ナイスツーミーチュー」と会話をした。部屋には10人くらいいた気がする。これなら$16,000はかかりますわそりゃ、と\n\n…\n\nここで記憶がぷっつり。\n\n…\n\n### リカバリールーム\n\n目がさめると、ベッドの上で、手術は終わっていた。傷口はだいぶ痛くて、喉もカラカラで、考えてみたら前日の午前0時からすでに14時間以上水すら飲んでいないことに気づいた。目が覚めたことに気づいたかわいい看護師さんが、今ご家族を呼びますからね、何かほしいものは、というので、「み、みず。。。」\n\n水をもらい、妻と会い、いったん妻はまた戻って行って、麻酔の先生とresidentの2人が様子を見に来て、手術は何の問題もなかったらしい。\n\nお隣の患者さんが覚醒後にだいぶ咳き込んでいて、なんか大変なことぽかったんだが、僕についているかわいい看護師さんはそっちも多少ケアしつつも、えらくテキパキと「ちょっと傷口が痛くて。。。」「痛み止めを入れましょう。」「今点滴から入れたからこれはすぐ効くけどすぐ切れるので、錠剤も飲みましょう。でも錠剤を飲むには何か食べないと。クラッカー、塩味と甘いのどっちがいい？」「あー、あ？どっちでもいい。。。」「わかった」「はいクラッカー」「はいさらにクラッカー」「はい水も飲んで。クラッカーってパサつくでしょ？」「はいさらにクラッカー、今度は違う味のやつ。もう少し胃の中に何か入れないと。」「はいまたクラッカー、あ、砕けてたごめん」「はい、じゃあこの薬を飲んで」\n\n痛み止めというものを初めて飲んだ気がするんだが、効きますねこれ。びっくりするくらい痛みがなくなった。他の感覚はあるのに。\n\nその後もしばらくじっとして、2時間ほど経過したところで、じゃあそろそろ帰りましょうか、となった。血圧や心拍をチェックして、機器を身体から取り外して、テキパキ看護師さんが最後に顔を覗き込みながら、にっこりと笑って「最後に例のバカバカしい質問するわね。お名前と生年月日は？」無事に答えられたので、ベッドから降りて、車椅子へ移り、医師や看護師とさようならして、来た時と同じ要領でエレベーターに乗り、診察室へ。妻も戻ってきて、そこで最後にまた別の看護師と対面した。\n\n### Discharge手続き\n\n麻酔付きの手術で日帰りする場合は、付き添いが必須であり、さらに帰っても良い状態であることを看護師が確認する必要があるらしい（というのは前日の電話で言われていた。誰が来るかもそのとき言う必要があった）。この最後の看護師さんが一番とっつきづらい人で辛かった。辛かったのはもう1つ理由があって、ベッドから降りて車椅子に移ったときに立ちくらみがあって、それは当たり前だからそのまま車椅子に乗ったんだけど、車椅子に乗っている間にどんどん貧血っぽい、頭から血の気が失せてすこし吐き気がするような状態になっていて、それを看護師に告げたら、ううーんその状態では家に帰せないが、血圧も正常だし、ちょっと休みましょう、と。んでオレンジジュースをもらい、クラッカーももらったんだけど食べられず、正味4、50分帰れなかったんだろうか。ただ座り、何度か血圧を測り、立った状態で測り、「問題ないんだけど」「やーでもさ、貧血気味なんだよね」と貧血という単語をGoogle Translateして見せても「いや、でも血圧は正常だし」と言われるだけで、いや貧血的な状態と血圧って関係なくね？と思いながら、うー、最後のこの人だけ話しづらいなあ、もう無理して帰っちゃおうかなあ、と思い始めた。\n\n結局、トイレに行って小さい方を出し、最高ではないものの気分もだいぶ治ったので、そういうことでじゃあ帰ります、ってことで、念のため1階まで車椅子で押してもらって、病院を後にした。看護師に「どうやって帰るの？」と聞かれて「地下鉄じゃないかな」と行ったら「はあ？地下鉄？その状態で？私ならUber呼ぶけどね」と言われ、「はあ、それもいいアイデアだね」なんつって、結局病院の外に止まっていたタクシーに手を上げて、帰宅する。8時過ぎ。12時間病院にいて、$5,300というか$16,000の外科手術が完了した。\n\n### 週末\n\nその夜は、傷口がだいぶ痛くて、明け方起き出して痛み止めを飲んでまた寝たりして、土曜日もほとんど動かずぼーっとしていたが、土曜日の夜はだいぶ痛みも引いていて、日曜日もあまり何もせずにぼーっとしていたんだけど、明日は普通に出社します。\n\n事故の相手とは手術前に一応連絡は取れていて、お金の件を少し話してあるので、$5,300のうちいくら払わせられるのか。弁護士にでも頼めば慰謝料やらなんやらでもっと取れって言うんだろうけど、どうしようかなあ。\n\n[続く](/blog/2017-12-17_----------13490d2fdef1)。\n\n"},{"frontmatter":{"slug":"/blog/2017-10-02_-----------------------39bae6cabb2c","date":"Mon, 02 Oct 2017 03:39:51 GMT","title":"ニューヨークで自転車事故にあって鎖骨を折った","epoch":"1506915591","excerpt":"この話はニューヨークで自転車事故にあって救急車で運ばれたの続きです。"},"markdownBody":"\n### ニューヨークで自転車事故にあって鎖骨を折った\n\nこの話は[ニューヨークで自転車事故にあって救急車で運ばれた](/blog/2017-10-02_-------------------------2d10b02652db)の続きです。\n\n### 外科医のオフィス訪問\n\n家に帰ってもろもろ落ち着かせて、それから言われた通りに外科医のオフィスへ電話…しようとおもったら、すでに向こうから電話が入っていた。すぐに折り返してくれと。電話して、秘書らしき人に用件を告げ、何時に来られるか聞かれて午後1時でアポをとる。場所は家から30分くらいのところだったんだが、いろいろおたおたしていたら出発時間になり、なるべく脱ぎやすい服をさがしてきて、出発。\n\nこのオフィスは NYU Langone Orthopaedic Surgery Associates というところで、普段外科の外来を受けるところなんじゃないかと思われる。普通のオフィスぽいとこで、受付でアポを告げて、「2つドアを通った先にある Room F」と言われ、2つドアを通って Room Fに行こうとしたら待ってる他の患者に「EよE」と言われ、「Fって言われたんだけど」「なんかFの先生今いないからEなんだって」「そうなの？ありがとう」みたいな会話をして Room E に行ったら、電話した秘書の人がいた。こういうの、日本の病院の待合とかであまり想像できない。こっちの人って、右往左往してそうな人を見るとすかさずなんかヘルプしようとするよなあ、と思う。\n\n簡単に今日の訪問の用件を聞かれ、「CoPayがあるわね」と、すかさずカード読み取り機を掲示され、$60をお支払い。後で保険会社のWebページで見たんだが、この先生のOffice Visitの定価は$850だそうだ。それが保険会社との契約によるdiscountで大幅に減額され、それの20%をCoPayしたということのようだった。\n\n先生が来るまで別室で待つように言われ、最初に看護師が入ってきて、身長体重から薬の使用歴やら病歴やらを聞かれはじめ、そこでハタと「もしかして今日 Emergency からきた？」「はい」「あーどうりで、全部入力されてたわ。レントゲンも撮った？」「はい」「あーほんとだ、じゃあこれを表示して、ふーん、先生が来るからお待ちくださーい」ってことで看護師の仕事は終了。\n\n次に、アポを取った先生についている研修医的な若手が登場し、レントゲン写真を見て、ふむふむ、OK、これはこうやって骨をまっすぐにしてプレートで固定するって手術になりますよ。職業は何です？プログラマー？じゃあ大丈夫だね。鎖骨ってのは、腕を肩から90度より上に上げたときに動く骨なんだよね。プログラマーがキーボードを打つときの腕はこうだろう？上には上がらないから、手術後は仕事も普通にできるね。お酒は飲む？うん、治るまで飲んじゃダメ。タバコは？うん、治るまで禁止ね。じゃあちょっと待っててね。\n\n最後にアポを取った先生が登場。さっきの若手も一緒についてくる。先生は若手とほぼ同じ質問をして、それに同じように答えると、後ろの若手が満足そうな顔をするのが微笑ましかった。\n\n先生はリスク説明もした。縫った後の部分はちょっと他の部分より鈍感に（numbに）なるよ、麻酔をするから麻酔にかかわるリスクもある（もっと詳細な説明だったけど省略）、それから（レントゲン写真を指差して）ここの黒いところ、肺なんだよね。んで、骨にボルトをこうやって入れるから、ここんとこで刺しすぎると肺に穴があいちゃって空気が入っちゃうことがあるんだよ。そうなったら入院してお腹の横から空気を抜かないといけないんだよね。いやーめったに起こらないから。あとここら辺には神経もあるから、それに触れたり切ったりすることもあるよ。いやーめったに起こらないから。\n\nと、ほんとにこういうノリの説明で、こっちとしてはもうお任せするしかないので、はあ、はあ、はあ、と聞いていた。最後に、「手術は2日後の金曜日にする。手術は午前中に行われるが詳細な日時は追って連絡が来るから。」そしてさっきの秘書のところに戻る。\n\n秘書のところでは、外科手術同意書にサインをし、改めて病歴などのチェックボックスたちにチェックを入れ、コピーをもらって、この日は終了。14時くらいだったかな。\n\n朝から何も食べていないので、なんか食べようとUnion Squareのあたりをうろうろしたけど何かピンとくるものがなく、仕方なくAstor Placeまで歩いて一風堂でラーメンを食べて家に帰ってきた。\n\n### 会社からのサプライズ\n\n家からSlackで会社に連絡を入れ、そういうわけなので、片腕しかないので生産性が下がりますが、今日は家で仕事しますということにして、Pull Requestのレビューをしたり、準備していたPull Request（するためのコミット）を見直したりして、少し働いた。痛みは多少あるものの、動かさなければそうでもない感じだった。\n\n夜の8時ごろ、突然電話が鳴って、出たらアパートのフロントからで「配達が来てるけど」「え、配達？頼んでないけどな、部屋番号あってる？」「うん、とりあえず行かせるよ」「あ、OK」なんだろう？請求書がバイク便で来たか？とか思ったらなんと、会社のみんなから「早く元気になってね」カードとポテチなどが！Office ManagerのSandyがわざわざ家まで持ってきてくれたのでした。俺まだ入社1ヶ月とかっすけど、みんなちゃんと俺のこと意識したメッセージを書いてくれてて泣きそうだった。今書いててもちょっと泣きそう。いい会社に入れたなぁ、おれ。がんばらないと。ありがとうありがとう。\n\n### 木曜日\n\n事故って救急に行き、改めて医師のオフィス訪問をしたのが水曜日で、手術は金曜日なので、木曜日は自宅で仕事をそれなりにやった。骨は折れたままだし、腫れも引かないので、そんなに集中できないんだけども。\n\nそんな中、救急から電話が入る。その後の容体の確認だそうだ。オフィスへ行って、手術が明日になったと告げたら、「早いわね！よかったわね！」と。やっぱりそこまで普通な感じではないんだよねこのスピード感は、と思った。救急からは金曜日にも「その後どう？」という電話が入る。ルーティンなんだろうけども、ちゃんとしてるなあと思った。\n\nさらに手術をする病院から手術費用の連絡が入る。$5,300。「それって保険効いてるの？」「保険のdeductibleやらcopayやらをあーだこーだして出した額です」「ん、でその額を保険が払ってくれるってこと？」「ん、は？いいえあなたが払います」「んあ、えと、手術後に払うってこと？」「いいえまず払ってください」「え、この電話で？」「はー、受付で払ってください。」「あ、そういうことか。」こっちは月$10のAmazon Primeを無駄だと思って入らない人なのに。$5,300とか。Pixel 2は買えないわ。買おうと思ってたものはすべてナシだ。あーあ。\n\n最後にまた手術をする病院から連絡が入り、金曜日の朝8時に来るように、場所はNYU Langone Tisch Hospital。玄関を入ったら左に曲がってエレベーターで4階に来てくれと。そこで払うのね。はい。\n\n[手術の日](/blog/2017-10-02_-------------------------d8cb3ae7d810)へ続く\n\n"},{"frontmatter":{"slug":"/blog/2017-10-02_-------------------------2d10b02652db","date":"Mon, 02 Oct 2017 03:32:02 GMT","title":"ニューヨークで自転車事故にあって救急車で運ばれた","epoch":"1506915122","excerpt":"序"},"markdownBody":"\n### ニューヨークで自転車事故にあって救急車で運ばれた\n\n### 序\n\nいつもの水曜日の朝。いつものように愛車にまたがり、歩行者の予測不能な動きに細心の注意を払いながらブルックリンブリッジを越え、車線のある道に出てほっと一安心し、前方に2台の自転車が並走してこちらに向かってくるのを見て、「まあ完全に車線があるところだし周囲にも余裕はあるし、あっちが避けるに決まってる」と思い込んでそのまま自分の車線を直進し、…\n\nえ？避けないの？？？は？なに？してんのお前？\n\nまったく回避行動をしないでこちらの車線上で逆走を続けた1台と、隣の車線を走る2台との間をすりぬけるような感じになって、すり抜けられた！とおもった次の瞬間、こちらの車線を逆走していたライダーと接触してふっとばされ、左肩から道路に落ちた。\n\nしばらく呆然として、それから何気なく左肩から首にかけて触ってみて、変な出っ張りがあるのに気づいて、「あ、鎖骨折れた」。自転車ロードレースを見ていておなじみになった、fracture、collarbone、という英単語が頭をめぐる。\n\nたまたま交通警官が毎朝立っている場所で起きた事故で、警官が様子を見にきて、事情を聞き、救急車を呼んでくれた。さらにぶつかった相手もすぐにこちらに来て警官と話をして、さらに最初から「アイムソーリー」を連呼していて、あ、やっぱりアメリカ人は謝らないとかいうのもウソなんだなぁとか、もやーっと考えた。\n\n10分くらいで救急車が到着し、警官から「84 precinct で injury report を出してあるから必要なら取りに行け」と言われ、この「precinct」がわからなくて、でもまあいいかと、救急車に乗って、包帯で左腕を曲げた状態で固定し、「あ、これ自転車レースでよく見る姿勢」とか思いながら、あー、救急車で ER か、一体いくらかかるんだろう…。\n\n### 救急車から救急病院\n\n救急車の2人はプロフェッショナルなフレンドリーさで不安感は特になかった。救急車内で住所や電話番号、身長体重なんかを聞かれた。身長体重は、フィートやポンドでは言えなかったんだけど、KgとCmの数値で大丈夫で、入力しているタブレット端末で勝手に変換されていた。\n\n救急隊員が警官から Go をもらって、おそらく一番近いだろう NYU Langone Cobble Hill という Emergency Care 施設へ。20分くらいだったかな。救急車を降りて、歩いて処置室まで行き、そこで看護師が救急隊員と情報を（タブレット端末で）交換し、交換したはずなのに再度身長体重を聞かれ、SSN を聞かれ、言ったら変な顔をされ、「その番号変？」と聞いたら「なんかちょっと変」と。えーなんか違うのかな。\n\n救急隊員は「feel better, man!」と言って去り（周りからいろいろ聞かれていてろくにお礼も言えなかった）、看護師が情報入力を終えたところで、着ていた服を激痛に耐えて脱ぎ、看護服を着たら医師が2人登場し、どういう状況だったのか、身体がどうなっていると思うのかを聞かれ、レントゲン撮影をしましょうとなる。この間、Wifiがあるのを発見して、会社と妻へ事故った旨を連絡。\n\nたぶん撮影準備を待っている間、医療事務の方がタブレットを持って登場し、10箇所くらいサインする必要がある各種同意書の説明をしてくれた。他の病院の医師から紹介があったときに履歴を見せてもいいか、保険会社には見せてもいいか、とかそういうこと。あと臓器提供の意思（するしないではなく、そのどちらかの意思）を示したか、とか。それとパスポートと保険証を渡す。\n\n同意書の説明がまだ続いている間にレントゲン技師が現れて、撮影へ。7–8枚撮影して、ああーこれはいくらになるんだろう…。\n\nレントゲンから戻るとさっきの同意手続きの続き。そうこうしているうちに身体が冷えてきて、それから患部が急速に腫れて痛くなってきて、それを見た看護師が痛み止めを出しましょうかと言ってくれたんだけど、ここでまた「自転車レースでは最近痛み止めも問題視されていたな」とか思って「いいえ結構です。耐えます。」とか言ってびっくりされ、代わりにアイスバッグを持ってきてくれて、さらに毛布もくれた。この毛布が温めてあるんですよ。ほんわかしてホッとするんですよほんとに。\n\nその後2人の医師の1人（すぐ目の前の席でコンピュータを見てた）に呼ばれて、レントゲン写真の説明をされ、要するに1本の骨が3つに別れてしまっていて、しかもそれぞれが微妙に重なり合ってしまっているので、手術することを「おすすめする」と。そこで思わず「えっ、他にオプションがあるんですか？」と聞いてしまったんだけど、もちろん医師は真剣な表情で「放っておいて治るのを待つってこともあるし、実際私はそれで治したんだけど、あなたのとは違って私の場合は折れた場所が山型に盛り上がったような状態だったのと、あなたはアクティブな人のようだから、腕が90度より上に上がらないというような後遺症は避けたいでしょう？それなら手術をした方がいい。」と。\n\nそうか、あくまでも、こんな場合でも患者の意思が尊重されて、患者の意思によって医療行為が行われるのだ。こんなときでも受動的になすがままではいられないんだこの地では、と、ちょっと生きていくのが辛くなる。\n\n「そういうわけで、すでに外科の先生に連絡をつけてあって、先生はあなたに今日中に電話してきてほしい、今日中に会って、なるべく早く手術をしたいとおっしゃっている」と説明され、After Visit Summaryというものを渡されて、「とにかくここに電話して」となって、診察などは終了。\n\nこの間に、さっき渡しておいたパスポートと保険証を使って医療事務の人がいろいろ手続きをしてくれていて、看護師からも最後の説明、とにかく先生に電話しろ、あと家でなにをするかはAfter Visit Summaryに書いてあるから、ということを聞かされ、最後にパスポートを返してもらいに事務の人のところへ行って、返してもらったら、それで終了した。\n\nあれ？ここの料金はどこで払うの？って聞いたら、「んんー？支払いはないみたいよ。」Emergency Care の CoPay は Waive される場合があると保険の説明に書いてあるけど、そういう場合だったんだろうか。よくわからん。まだ請求は来ていない。\n\n会社に改めて詳細を連絡し、事故現場に停めてある自転車を回収して会社に行くと言ったら仰天され、今日は来なくていいからと言われて、考えてみたら外科医にあわないといけないかもしれないしと思って、ありがたくお休みをいただき、妻に連絡して近くの地下鉄駅まで来てもらって、2人で自転車をかついで家に帰った。自転車は外見上は壊れていないように見える。地下鉄に（ラッシュ時以外なら）そのまま自転車を載せられるのがありがたい。\n\nこのとき午前11時ちょっと過ぎ。[外科医訪問](/blog/2017-10-02_-----------------------39bae6cabb2c)へ続く。\n\n"},{"frontmatter":{"slug":"/blog/2017-08-08_Achievement-unlocked----------H-1B-----------2-2--6609e6aa7d68","date":"Tue, 08 Aug 2017 01:35:14 GMT","title":"Achievement unlocked: アメリカ国内で H-1B のまま転職した（その2/2）","epoch":"1502156114","excerpt":"その1からの続きです。"},"markdownBody":"\n### Achievement unlocked: アメリカ国内で H-1B のまま転職した（その2/2）\n\n[その1](/blog/2017-08-08_Achievement-unlocked----------H-1B---------1-2--488f6217c832)からの続きです。\n\n### 11. Visa Transfer\n\nH-1Bビザ保有者は、新しいスポンサーが「transfer」の手続きをしてくれれば、会社を移ることができます。「transfer」と通称されているものの、実質はほとんど新規の手続きと変わらないようで、例えば本当にできたばかりのスタートアップとかだと、却下される可能性も高いそうです（弁護士談）。\n\n弁護士から連絡が来て、必要な書類を至急送ってくれるように連絡がありました。\n\n* パスポート（空白ページも含む全ページ）\n* これまでに得たすべてのI-797\n* 出入国履歴\n* 最新のI-94（入国記録）\n* 直近の給与明細\n* H-1B取得時に提出した、学歴やその評価記録\n\nまた、配偶者のH-4も同時に申請するので、配偶者の分のパスポートや出入国履歴なども。\n\nアメリカで働いているような方々は、日本に一時帰国したり、ヨーロッパへ出張したり、バケーションで海外へ行ったりすることが多いでしょうから、出入国履歴をhandyにしておくことは結構大事だと思いました。かくいう私はパスポートのスタンプから日付を判別し、Google Photosで記録を照らし合わせ、日付を正確にするめんどくさい作業をする羽目になりました。\n\nそれと、最初にH-1Bを取得したときに弁護士が提出したはずの資料のコピーを手元に置いておくことも重要です。私の場合は特に、CSメジャーでない（BA, Liberal Arts, Linguistics）せいで私の学歴及びその後の職歴をSoftware engineerとしての特殊技能を保持していると認定できるかどうかの精査を行ってもらっていたので、その書類が手元にあったことは手続きを早く進める上で役に立ったと思われます。これまでに得たすべてのI-797も同様。\n\n配偶者のH-4も手続きする場合はさらに、婚姻証明や戸籍謄本も（当初の申請時に）取得、作成したはずですから、それも手元に置いておく必要があるでしょう。これらの日付は当然古いわけですが、そこは問題にはならなかったです（これを読んでいる方は弁護士に確認してください。あくまで、2017年8月時点の私の場合はそうだったというだけです）。配偶者の出入国履歴も必要です。記録しておきましょう。\n\nこれらはほぼすべて、スキャンしてPDFをメールで送ればすみます。サインが必要な場合でも、サインしてスキャンしたり、EchoSignのようなオンラインのサインツール（電子署名って書くと誤解がありそうなので…）を使ってオンラインで行うことができます。\n\n実際にFedExで弁護士に原本を送らないといけなかったのは、H-4に関する委任状だけでした。これは私たちの場合、当初のH-4は弁護士に頼まずにすべて自分たちで作業を行って取得したためだと思われます（想像です。必要なら理由を確認してください）。\n\n### 12. transfer手続き待ち…\n\n私の場合、H-1Bを移す先の会社をどうするか問題（詳しくは書きませんが先述のスタートアップだと厳しいかもって話）があって少し遅れ、7月第三週からやりとりが始まり、8月に入ってもまだ完了していなかったので、7月末の退社はどのみち無理筋でした。H-1Bのtransferを伴う場合、1ヶ月は見たほうがよさそうです。\n\nただし、transferが完全に行われるまで待つ必要はなく、USCISがtransferの手続き書類を受理して、その受理番号を受け取れたら、その時点で新しい会社で働き始めることができます（これを読んでいる方はこの件も確認してください。あくまで、2017年8月時点の私の場合はそうだったというだけです）（H-1B portability rule）。\n\nしかしそうなると当然浮かんでくる次の疑問は、「働き始めてからtransfer申請が却下されたらどうなるの」です。ググってみると、「却下されてもビザは無効にはならないので、元の会社では働ける」という説明が出てきます。確かに、transfer申請の事実や、必要書類などについて、現職（つまり前職）の会社に知らせる必要は、手続き上は一切ありません。ですから、失敗したらしれっと働き続けるというのは不可能ではないのでしょう。ですが、オファーを受けて入社日を決めなければtransferの手続きも始まらず、入社日を決めた以上は退社日について通告しなければならないわけですから、これは鶏と卵です。入社日を決めずにtransfer手続きだけ開始してその成り行きで退社日と入社日を決められればよいのでしょうが、自分の場合そこまで頭を回せませんでした。\n\n却下されて前職も退社した場合、残る選択肢は出国以外にはありません。転職が決まったはずでも、多くの場合ここでの雇用はお互いの「At will」ですから、入社数日で解雇という結末になるのでしょう。\n\n自分の話に戻ると、入社予定日（月曜日）の直前の金曜日に「transferの手続きはcomplete」という連絡が来て、晴れて月曜日から（とりあえず却下されるまでは）新しい会社で働けることになりました。\n\n### 12. 残務整理\n\n結果的に新規プロジェクトのリリース直前での離職となることもあって、残務整理というよりはかかえていた仕事を終わらせるので手一杯でしたが、それまでに頭の中にだけあったもろもろのドキュメント化も並行して行いました。狭い業界だし、その会社や同僚が憎くてやめるわけでもないし、クビになったわけでもないので、自分の退社が周囲に対するpunishmentになってしまうようなことはできるだけ避けようと思っていました。\n\nとはいえ、「ちくしょう、転職だっ」と思ったのは初めてではなくて、その度にドキュメント化などの作業は行っていたので、あわててあっぷあっぷで書いたというわけでもないです。もっとも、そういう理由ではなくて常日頃からできるだけドキュメントやワークログを残したり、情報共有をしておくほうがいいに決まっています。全然やっていなかったわけではありませんが、いかんせん目の前の作業の方が多かったもので。結果、ろくに休みもとれずに会社を移ることになってしまいました。\n\n### 13. まとめと反省\n\n転職先に余裕があって入社日をオファー受諾から1ヶ月以上先にできるような場合には、transferをとにかく開始してもらって、進捗を見て最終出社日を通告するのが、気持ち的に一番楽だろうと思います。\n\nですが多くの場合、転職先に余裕がない（今すぐにでも来てほしい）か、現職がそこまでゆるふわっとしていなくて2週間前通告で即退社というわけにもいかない（プロジェクトがどんどんアサインされるとか）、またはその両方でしょう。できるだけコトを円滑に進めて自分の気持ちに余裕を持たせるためにも、「ちくしょう転職だっ」から実際の転職活動に踏み切るまでに、1ヶ月くらいは助走期間を設けるのがいいんじゃないかと思いました。現職からスムーズにフェードアウトできる準備や、必要書類を調べてできるだけ（紙とスキャンした電子データの両方を）手元に用意して、大まかな最終出社日と新しい会社での初日を描いて、それから転職サイトへの登録なんかをやるとよいのかなと思いました。transfer手続きは現職には完全に伏せたまま行うことができるはずですので、transferのめどがたった段階で、最終出社日を通告するのが、気持ち的にはよいかなあと思いました。\n\nとはいえ転職するとかしないとかは自分の気持ちだけで決められるものでもないので、ということは、そういう書類関係は常日頃から用意しておくこと、現職においていつ辞めても周囲が困らないように情報共有して属人化しているものを切り離していくこと、などをしておかないといけないということで、だけどこういう心構えや準備って、当然だといわれるけど実際には業務に追われていたり周囲にやる気がなかったりで難しいことも多いので、やっぱり「転職だっ」とかならないとなかなか難しく、結局鶏と卵なのかなあと。\n\nなお、これを書いている2017年という年は、後から振り返ったときに特異な年として記憶されているのかもしれません。言うまでもなく現政権の「America First」のおかげです。H-1Bの審査を厳正にする話やポイント制度の導入などが聞こえてきます。\n\nですから、もしかするとこれを読んでいるあなたには、私の体験談は の役にも立たないかもしれません。そうでなくてもこれはいわゆる「I am not a lawyer, but」な話ですし、すべての人に一様に当てはまるわけでもありません。そこんところはどうかご了承の上で、それでも参考になる部分があればよいのですが。\n\nおわり。\n\n"},{"frontmatter":{"slug":"/blog/2017-08-08_Achievement-unlocked----------H-1B---------1-2--488f6217c832","date":"Tue, 08 Aug 2017 01:32:47 GMT","title":"Achievement unlocked: アメリカ国内で H-1B のまま転職した（1/2）","epoch":"1502155967","excerpt":"前職でそのサービスを作り始めて7年半、2013年4月に渡米して4年と1/4が経ち、そろそろ新しいチャレンジをしたい、チャンスがまだあるうちに、というわけで転職活動をしておりました。8月から新しい職場で新しい仕事を始めます。 前職の会社、経営陣、社員の皆さまには、自分の書いた汚いコードをこんなに立派なサービスに仕立て上げて、世界4カ国で数十人を雇用し、200万以上のアカウントが作られるまでに育て…"},"markdownBody":"\n### Achievement unlocked: アメリカ国内で H-1B のまま転職した（その1/2）\n\n### 0. はじめに\n\n前職でそのサービスを作り始めて7年半、2013年4月に渡米して4年と1/4が経ち、そろそろ新しいチャレンジをしたい、チャンスがまだあるうちに、というわけで転職活動をしておりました。8月から新しい職場で新しい仕事を始めます。\n\n前職の会社、経営陣、社員の皆さまには、自分の書いた汚いコードをこんなに立派なサービスに仕立て上げて、世界4カ国で数十人を雇用し、200万以上のアカウントが作られるまでに育て上げてもらって、感謝しかありません。ありがとうございました。\n\nさて、せっかくなので忘れないうちに、H-1B ビザ保有者のアメリカ国内での転職はどういう流れで進んだのか、書き留めておこうと思います。検索したんですが、あまりこれだって例が見つからなかったので、誰かの役に立てばと思います。\n\nなお前半は私の転職体験談なので、H-1Bの転職で必要な書類とかの概略だけ知りたいという場合は主にその2から見ればよいとおもいます。\n\n### 1. 前提\n\nコードを書くことについては、転職時点で主に以下のような感じでした。\n* Perl 5 (10年以上)\n* JavaScript (AngularJS, 少々Backbone.js、1–2年)\n* Android (2.xで少々、4.0から本格的に、3年)\n* iOS (Objective Cのみ、2012から2014くらいまで)\n  * インフラ周りの世話もほとんどやっていました(7年)。\n* AWS (EC2, S3, Elaticache, RDS (MySQL, Aurora), CloudWatch,&nbsp;…)\n* Elasticsearch (1.5, 1.7)\n* MongoDB\n* Kurado, xxForecast などのmetrics系\n  * AWSでclassicからVPCに移行するとか、MySQLをAuroraに移すとか、その手の作業も計画から実施まで大体1人でやってました。\n\nそもそもサービスをイチから作ったので、DB設計やサーバー構成やプログラムの設計なども（出来の良し悪しはともかくとして）やってました。7年前に行った設計に大した手直しもせずにここまで来ていて、根本から書き直さないとどうしようもないみたいな問題は7年後の今も起こしていないと思われるので、まあまあのレベルでできていると言ってもいいのかなあと思っています。\n\nこういう、いわゆる「full stack developer」的な履歴書（ただし自分でその言葉は使っていない）で活動を始めたのですが、今の仕事にだいぶ飽きていたということもあり、自分としてはAndroid Engineerで探せないかなあ、と思っていました。\n\n### 2. 転職サイト登録\n\nAngelList、Hired、Vetteryの3サイトにもともとアカウントを持っていたので、履歴書などの内容を更新し、「現在職探し中」のステータスにしました。よさげなところから連絡が来るのを気長に待つつもりでした。\n\nHiredは、職探しを始めると最初の2週間プロフィールをfeatureしてくれるらしく、Hired側のレビューが終わってfeature開始のメールが来た次の瞬間から、エラい勢いで「interview request」が来る結果に。\n\nVetteryも似たような雰囲気だったのですが、こちらはいつまでもreviewingのステータスのままで、結局今もそのままです。全然使いませんでした。\n\nAngelListでは向こうから連絡が来たことはなかったのですが、なんとなく募集中の会社を見ていたら1つ面白そうな会社を見つけたので、こちらからApplyしてみました。\n\n### 3. Phone screening\n\nHired のサイトで、「連絡したいから日時を指定してくれ」と言われたり、「カレンダーの空いているところにリクエストを送りました」と言われたりするので、日程を設定して電話を受けました。Hiredのカレンダーは真面目に更新しておいたほうがよいと思います。空いているところにいきなり予定を入れられることもあって、Google Calendarと同期できていないために見落としたり忘れそうになったことがありました。\n\nPhone screeningは基本的に先方の人事担当者がかけてくる15–30分くらいのもので、自社の紹介をしてくれた後、こちらの希望ポジションや勤務地を聞いてくるもので、技術的な話はほぼありませんでした。ただしここで大事なのが、「H-1B の transfer をする意思があるか」を確認することです。Hired にはそれが必要である旨を示す項目があるのですが、私の10社くらいの電話経験では、そこを見た上で連絡してきた人は少数でした。30分の電話の最後に、「ところで、…」と聞いたら「ああああー、それ無理だわーごめん」と言われて終了したところもありました。\n\n電話の後、24–48時間後には次の連絡があるのですが、この時点で「お祈り」されることも数社ありました。正直理由は全然わかりません。なんで電話してきたの？って感じでした。たぶん、HRの人は手当たりしだいに電話をし、なんとなくよさげだったらエンジニアや開発チームに履歴書を投げ、エンジニアや開発チームがそれを見て「イラネ」って言ってるんだろうと思います。\n\n### 4. Coding interview 1\n\nCSメジャーでなく、仕事以外のコードを公開しているわけでもない、ただの叩き上げプログラマーの自分にとって、Coding interviewは鬼門以外の何物でもなく、恐怖の対象でした。1ヶ月無給でいいから雇ってくれれば証明できるんだけどなあ、といつも思ってました。とはいえ恐れてばかりいても仕方ないので、leetcodeなんかで多少の練習はしつつも、基本的に最初のほうの会社のCoding interviewは、それ自体が練習なんだと思うようにしていました。出された問題を理解すること。書き始める前に問題に対して些細な、あるいは当然と思われることでも質問すること。その時間を通して自分自身のIce breakingをするような感覚でした。とはいえ、あの種の、これまで実践で書いたことのない種類のコードを30分でそれなり動くように仕上げるのは、非常に難しかったです。バカみたいなことでも、書いている最中に考えていることをブツブツ言うことも心がけました。\n\n1社だけ、interviewの前にinterviewerがメールを送ってきてくれて、「このinterviewで見るのはどういう風にコードを書く人なのかということで、問題に対する答えを書いたかどうかは重要ではないし、ググっても何しても全然構わない。」と強調してくれたところがありました。まあそうは言ってもねえ、と思ってましたが、その人のことをGitHubなどで調べられるし、そもそも変なところで緊張しなくてよいように気遣ってくれているのがありがたかったです。\n\n### 5. 履歴書の内容を少し変更\n\nここまでで数社coding interviewの予定ができて、phone screeningも数社入っている状況で、どれも基本的にはFull stackとかBackendとかArchitectとかいう肩書きの募集で、Android Engineerで先方から連絡があったのは1社しかない状況でした。考えてみたらそりゃそうで、履歴書にはAndroid EngineerとしてのAchievementsがあまりに目立たないので、あれを見てAndroidのポジションで雇おうと思う人は少ないだろうと。こちらとしては「なんでもできるから、なんなら2人雇うより安いよ」みたいなイメージでいたのですが、薄々分かっていたとおり、「なんでもできる」というのはポジションではないので雇われないんですね。\n\nそこで、履歴書の内容に少し手を加えて、Androidのアプリ開発で何をやっていたかを、他の項目以上の量で盛り込んでみました。それと、思い切ってfullstack/backend developerのチェックボックスを外して、Androidのポジションだけで職を探していることにしてみました。まあダメならあとで戻せばいいやと思って。先述のとおり、いいところがあったら…という感じでいたんです。\n\nそうしたら、Androidでの連絡もちらほらと来るようになりました。\n\n### 6. Coding interview 2\n\nある会社から、オフィスに呼ばれてホワイトボードコーディングをしました。データ構造を与えられて、RDBのスキーマを答え、続けてそのスキーマを使ってある種のデータを取り出すコードを書くという感じで、一見とっつきやすいが始めてみると普通に再帰してしまうと重複データが出てきてしまう、それを避けるためのコードを書くと、件数が多いときどうする？って話になる、と、よくできた問題でした。\n\nありがちかつ苦手な、「バイナリーツリーをバランスしろ」とか「文字列と別の文字列を比較してこれとこれの条件にあうやつを取り出した文字列の最大長を答えろ」みたいな問題ではなくて、もう少しその会社の実際の業務に近い内容とそこで直面する問題についてどう考えるかを聞かれた感じだったので、楽しめたしまあまあうまくいったんじゃないかなあという反応でした。\n\nここでも、とにかく問題が出たら質問する。考えすぎずに最初の思いつきで何かを書き始めて、途中で（普通なら自問自答するような内容を）聞く、あるいは議論するということを心がけました。あとあちゃー間違えたーと気づいたときも、「あちゃー間違えたー」と言いつつ、今やっていたことをそれなりに書き終えて、説明する中で、「ここはこういうつもりだったけど前提条件のこれを忘れてて、この条件がある以上これだとデータが重複しちゃいますね」みたいなことを、自分のバカさをさらけ出すようにしゃべって、反応をうかがったりしました。\n\n### 7. Coding interview more\n\nその他いろんな会社と電話でやったんですが、まあ失敗しますね。問題は解けたかなあと思っていても、その後の返事はお祈りだったってことがほとんどでした。負け惜しみですが、こちらからすごく興味を持ったのにお祈りをくらったわけではなく、そっちが興味あるっていうから話聞いてあげたのにさあ、とか思うようにして、あまり落ち込まないように心がけたりして。\n\n### 8. ここまで\n\n長々と書きましたが、じつはここまでで2週間経っていないくらいじゃないかと思います。なんというか、早い。Hiredでプロモートされる期間が2週間だけなので、それが終わったらどうなるんだろうなあと思っていましたが、3回目のinterviewまでいったところもあって、うーんどうしようかなあと。\n\nただそんな中、ここまでで「こちらからapplyした」唯一の会社でもinterviewは継続していて、この会社のことを知るほどに興味が湧いてこの時点ではここが第一志望ってことなんだろうな、と思うようになっていました。先述のinterviewerが事前に連絡をくれたのもこの会社で。印象もよいしやってることも面白そうだし、ポジションはAndroid Engineerだし。\n\n独立記念日の前の週になって、続けているのは2社という状況になっていました。前回オフィスに呼ばれた会社に、もう一回オフィスにきてCTOと他の開発メンバーとあってほしいということになり、ただ独立記念日の直前なので、みんな出払ってしまうのでどうしようかと相談され、結果Hangoutで木曜日にやることになりました。そしてその前の水曜日に、もう1社の「第一志望」的な会社からオフィスに来て経営陣とあってほしいということになり、休みをもらってオフィスへ行きました。\n\n素敵オフィスで4人と順番に話をし、自分が今までしてきたこと、今できること、今後やりたいことなどを話しました。好感触だったし、やろうとしていることも簡単ではないけど自分にできることもありそうだし、ここからオファーがあったら行こうと決めました。\n\n### 9. オファー\n\n結果、オファーをいただきました。先に電話でオファーの概要とこちらの気持ちや状況を確認され、問題なかったので即答しました。が、この電話のときにH-1Bの件を確認するのを（だいぶ舞い上がっていて）忘れたことにあとで気づき、あわててメールで連絡をしました。幸い、翌朝には「なんとかする」という返事をもらったので、ほっと一息ついたのですが、だいぶ胃が痛かったです。\n\nもう1社のほうにそういうわけでお断りとお礼の連絡をメールで送り、その他のこの間に始まってまだ残っていたinterview requestもすべてキャンセルしました。\n\nそしたらなんと、お断りしたほうのもう1社から「すぐオファーを出すからもう1回話させてくれ」という返信をもらい、うれしいやら困ったやら。この会社も印象はすごくよかったし、これでさらに好印象になったのですが、気持ちはもう決まってしまっていたので、「本当にごめん」と再度連絡して、「仕方ないねグッドラック」的な返事をいただきました。\n\n### 10. Two weeks notice\n\nオファーを受諾したので、前職（この時点で現職）のCEOに退職する旨を伝え、最終日の相談をしました。2週間という意味では7月末でよかったのですが、その時点で関わっていたプロジェクトの進捗との兼ね合いもあり、8月中から末を打診され、新しい会社のほうとも相談して、8月第一週ということで決まりました。\n\n想像ですが、おそらく私が転職活動をしていることはすでに知っていたのだろうと思います。会社のことよりも、ビザの件などこちらの心配をしてもらって、ありがたかったです。\n\n[その2](/blog/2017-08-08_Achievement-unlocked----------H-1B-----------2-2--6609e6aa7d68)へ続く\n\n"},{"frontmatter":{"slug":"/blog/2017-07-17_Nexus-5X-------1bb1d9c07087","date":"Mon, 17 Jul 2017 03:29:24 GMT","title":"Nexus 5X 交換顛末記","epoch":"1500262164","excerpt":"昨年のPixel をスキップしてもう1年同じ端末を使い続けようと決めて、「もっさり」も「フリーズ」も我慢してきたんだが、独立記念日の前日にとうとうブートループになってしまい、OSが起動しなくなってしまった。"},"markdownBody":"\n### Nexus 5X 交換顛末記\n\n昨年のPixel をスキップしてもう1年同じ端末を使い続けようと決めて、「もっさり」も「フリーズ」も我慢してきたんだが、独立記念日の前日にとうとうブートループになってしまい、OSが起動しなくなってしまった。\n\nfastbootには入れるんだが、そこでrecovery modeに入ろうとしてもまたブートループになってしまってお手上げ。Google Storeで買ったのでGoogleのサポートとチャットをした。独立記念日の前日（月曜日）に。\n\nブートループに入ったのを説明し、IMEIを教え、型通りの「これをやってみてくれ」という手順（fastbootからのrecovery mode）を教わり、やってみて、「やっぱり同じです」と言ったら、あっさりと「Warrantyは切れているけどspecialでreplacementします」と。\n\nReplace用のリンクを渡され、そこで「購入」手続きをして、出荷待ちになったのがJuly 4th。3日後の金曜日にもう交換品のNexus 5Xが届いた。アメリカなのにすごい。箱に貼ってあるシールを見ると、「Manufactured: 01/2017」と。え、2017年1月製造? てっきりrefurbishedのものが来ると思ってた。\n\n起動してみるとROMはAndroid 7.0。そこから今の時点までの月次更新と、7.1.1と7.1.2とその後の月次更新をひたすらやり続け、アプリをそれなりにインストールし、Googleアカウントを設定し、ほぼ復旧できた。\n\n復旧できなかったものが3つ。\n\n1つはLINEで、僕はcellular networkの契約をしていないので、SMSが受け取れないので、アカウント移行ができない。Google Voiceの番号には送ってくれない（Invalid Numberだって）ようで。\n\n2つ目はDropboxで、これはAuthenticatorアプリを失ったのに、emergency backup codeも紛失していたため。サポートリクエストを投げてみたがどうなるか。\n\n最後の、一番の大問題はAndroid Pay。機種変更したから復旧というか、新しくカードを追加すれば済むし、普段あまりつかっていないので「移行」という意味では問題ないんだが、壊れたほうの端末を送り返さないといけなくて（30日以内に送り返さないと、上述の「購入」手順で取られたAUTHをCaptureされてしまう）、送り返してどこぞの工場で復旧されてAndroid Payでお買い物されるの嫌だなあ、と。\n\nそういうわけで、どうかあと一度だけ起動してくださいお願いします、という願いをこめて、壊れた方の、2015年10月製造のNexus 5Xは今[冷凍庫に入っています](https://www.youtube.com/watch?v=SD25mdrgAys)。\n\nまあ指紋認証があるから、起動できないまま送り返しても大丈夫だとは思うんだけど。梱包して送る前に端末についてるだろう指紋をきれいに拭き取っておこう。\n\nそういうわけで、もしこの記事を見た人がいたら、今すぐ 2FA のバックアップコードのありかを確認しておくことをお勧めします。\n\n追記:\n\nDropbox サポートから連絡があり、1) 2FA のバックアップコードがない &amp;&amp; 2) 電話番号を登録していない、3) 他に登録されているデバイスがない、のトリプルコンボ達成済みのあなたのアカウントにはもうアクセスできません、と回答がありました。ま、そうですよね。\n\n"}]},"__N_SSG":true}