{"pageProps":{"frontmatter":{"slug":"/blog/on-not-following-my-passion","date":"Mon, 06 Oct 2014 19:43:50 GMT","title":"On not following my passion","epoch":"1412624630"},"markdownBody":"\nMike Rowe’s response to why he thought people should not follow his/her passion is getting a buzz. To simply summarize it, he argues that one should not follow one’s passion for too long because many if not most cannot reach there anyway; and he believes those people should see it earlier rather than later to make their lives happier.\n\nI am not rich. I am not even close to be rich at all. I am not what I thought I would want to be when I was younger. I wanted to be a journalist. I wanted to make my living by telling others stories from the rest of the world in “a journalistic way”. But I wasn’t able to even start my carrier as a journalist. I was employed by a systems integrator after I failed all of my applications to most of the newspaper publishers in Japan when I graduated school.\n\nBut I can safely say I am very fortunate to be where I am. Not because now those newspaper companies are struggling; but because I found what I would love during my tenure since then. It turned out I loved writing software to solve someone else’s problem.\n\nThe first batch of “programs” I wrote - or more like I typed - was games printed on magazines. Basic Magazine and later I/O. I had fun with it with my brother sitting next to me. I took basic computer programming classes of Natural Science division when I finished getting most of grade points to graduate college with my major. But it never got me until I was assigned to the R&D department at the second year at my first company when I found that I loved, and was very good at, learning something new about computer software and telling people about my learning by writing and speaking. That was when my carrier really has started.\n\nI could have followed my heart and have tried harder to be a journalist, by for example spend a whole year abroad and apply for the next year’s new hire opportunity. I was too scared of doing that. Instead I grabbed a job that wasn’t what I thought I would be - a programmer. Since then, like someone that Mike Rowe shared in his response, “I found a way to love it”. With a little bit of luck of department assignment.\n\nI am in no way eligible to telling someone else something to do or something not to do; I am nobody anyway. But I can say to myself now that I am doing what I wanted to do, by “telling people what I learned about the world”; That world may be smaller, or virtual world of computer programs. Bonus is that I am paid to do it and colleagues around me (I believe) thinks I am doing it good.\n\n"},"__N_SSG":true}