{"pageProps":{"frontmatter":{"slug":"/blog/moving-5-20220904","date":"Mon, 05 Sep 2022 01:56:18 GMT","title":"引っ越し当日になった","epoch":"1662342977","excerpt":"いよいよ引っ越しの日になりました"},"markdownBody":"\n## 引っ越し当日の流れ\n\n[引っ越し荷物の梱包もすべて終えた](/blog/moving-4-20220831)ので、あとは当日を待つばかり。\n\n内見のために引っ越し先のアパートを訪れたときは、ロスアンゼルス空港に入ってレンタカーで回った。今回もレンタカーするのだが、2、3日で返したあとで自宅へ戻らなければならない。LAXで借りてLAXへ返すとLAXから自宅までUberか何かで帰ってくる羽目になる。LAXはデカくて混んでるしLAXから自宅までのフリーウェイもなかなか大変な道のりだ。\n\n自宅近くにはLAX以外に3つ空港がある。Long BeachとOntarioとSanta Ana。一番近くてNYCから直行便が出ているのがSanta Anaなので、ここへ飛んでレンタカーをすれば便利だ。NYC発LAX行きの便に比べてSNA行きの便は$100前後高いんだが、LAXからレンタカーしてSNAに返したり、LAXまで返しに行ってLAXからUberする値段などを考慮すると実はたいして変わらない。SNAはローカル空港なのでこじんまりしていてLAXみたいな大混雑もなさそう。というわけで、UnitedのEWR発SNA行きを予約した。\n\nEWRの出発時間が午前7時なので、Williamsburgから出てEWRに6時とかに着くのは辛い。そこで、EWR近くの安いホテルに一泊することにした。したがって荷物の搬出はNYCにサヨナラする日の一日前になる。搬出日の作業時間が朝イチに設定されたこともあって、その日に焦って何かをしなくてよいこともメリットだった。引っ越し先のアパートで入居手続きを予約しなければならないのだが、時差の関係でNYCで朝7時に発つ便は現地の朝10時過ぎに着くので、11時からの設定でちょうどよい。\n\n## 日本通運搬出チーム\n\n当日、指定の時間に日本通運チームから入電。作業が始まる。梱包資材を持ってきた方とはまた違う日本人のリーダーとヒスパニック系の3人組の合わせて4人。やりとりは日本人リーダーと行うのがほとんどなので日本語だけで済む。スペイン語力を試すことはできなかった（笑。最初みんな靴を脱ぎ履きしていたので、土足で入っていいよと伝えるとやたら喜ばれた。\n\nこちらの梱包にいくつか問題があったものの、基本的にはそのまま30数個の箱を運び出すだけ。上記の通り、梱包作業中に箱の中身を思い出しながら個数をmanifestに記録し、日通のリーダーが例の謎の記号（箱の大きさ、箱が日通のものか客が用意したものか、それと梱包は日通がやったか客がやったか）を入力し、部屋から出すときに番号を確認していく。\n\n梱包できなかったのは輪行袋に入れた自転車とSwifferの棒とフロアランプ。どうするのか分からなくて番号だけつけておいたのだが、でっかい箱にまとめて納められた。テレビは足を外して、その場ですっごい念入りに箱が作られ、念入りにテープで巻かれた。それと無印のプラスチックの衣装ケースも番号だけつけておいたのだが、周りを囲う段ボールがあっという間にその場で作られて梱包された。ものの2時間で工程は完了。チップを渡して搬出は終了。\n\n## 処分品の処分\n\n部屋の中はベッドフレームとマットレス、ダイニングテーブルと二脚のチェア、それにカラーボックスみたいな棚だけが残った。これらを解体し、まだ引っ越しモードになっているエレベーターに乗せて運び出し動線の途中にある大物が捨てられていると思しき場所まで手で持っていく。途中でアパートで普段Handymanをやっているおっちゃんを見つけて、「マットレスを捨てたいんだけど運ぶ道具を貸してくれ」と言ったら予想外に「マットレスなんて捨てられないよ何言ってんの？」「あそこに捨ててあるじゃん。あれと同じことをしたいだけ」「いやマットレスは捨てられない」というやりとりをすることになって、「えーじゃあどうしろっての？」「サイズは？」「クイーン」「。。。。。じゃああそこに置いておけ」いやだからそれでいいんじゃん。結局運ぶためのドーリーみたいなものはないので、仕方なくマットレスをひたすら引きずって運ぶことに。[NYCではマットレスは袋にきちんと包めば普通にゴミに出していいことになっている](https://portal.311.nyc.gov/article/?kanumber=KA-02378)ので、アパートの前のゴミ捨て場に出していいはずなのだ。だから道具を借りたかっただけなのに。ひいひい言いながら妻と2人でマットレスを1階まで運んだ。\n\n最後に空になった部屋で床や壁などの様子を動画で記録しておいた。多分ないとは思うんだが、傷とかをセキュリティデポジットから引かれると癪だから。\n\n## 退去してNewarkへ\n\n最後に忘れ物を確認して、スーツケースを持って部屋を出る。出たところでさっきのおっちゃんと鉢合わせして、「お世話になりました」といったら「あ、あんたが引っ越す人だったのか！」という反応をされたので、マットレスですったもんだしていたときは住人だと気づいていなかったのかもしれない。\n\n部屋の鍵、郵便ポストの鍵、アメニティを使うためのFOBを2組、フロントデスクに返す。[奇しくも入居のときに鍵をもらった（というか鍵が見つからなくて結局作り直した）とき](/blog/2018-03-22_-----------------bd1b22641946)と同じフロントマン。「お世話になりましたありがとう」「ああやっぱり今日出ていくのはあなただったのね。元気で」というやりとりをしてさよならする。\n\nアパートのすぐ下にあるカフェで昼飯を食べて、それから歩いてすぐのところにある乗り場からフェリーでWall Streetへ渡る。この辺りはこんな具合で交通の便も良くて、コロナとかその他もろもろで外出したくないような状況にならなければ、住みよい場所だったのだ。もうああいう空気には2度とならないんだろうね。\n\nWall StreetのPierで降りて、猛暑の中マンハッタン島を東から西へ移動する。WTCの麓にあるPATHの駅からNewarkへ行くのだ。[前回Uberで渡って高くて時間がかかって辟易した](/blog/moving-2-20220807)ので、今回は電車で行くのだ。乗ったことないのでおっかなびっくりだけど昼間だし大丈夫だろ？\n\nこの移動がなかなか大変で、スーツケース2つを引きずりながらウォール街周辺をとぼとぼと歩いた。だいぶ暑い日で汗だくになり、水筒で持ってきた水もなくなってしまう。この周辺に住んでいたので土地勘があって道に迷ったりはしなかったものの、暑さのあまり途中のBodegaで水を追加購入して休憩してしまった。少し休んで気を取り直して「確かこの辺」という場所へ進むとWTCのビルの入り口にSubway and PATHの文字が。Oculusの中からPATHに行けるのを思い出してビルに入る。冷房！涼しい！おまけに公衆トイレがある！\n\nトイレを済ませてOculusを通り抜けてPATHの駅へ。Oculusの大きな広場みたいなところに出て「こんなになったんだー（正式オープンする前に引っ越したので来てない）」としばし眺めていたら、おばちゃんが寄ってきて「どこに行きたいの？」どうやらスーツケースを持って途方に暮れる観光客に見えたらしい。「いやPATHに乗ってNewarkに行くつもりだから大丈夫」「あ、そう」ってやりとりをしてこの街にはこういう親切があふれているんだよなあ。見えづらくなっていたけども、と思って少し感慨深かった。だが未練はない。さよならNYC。\n\nPATHの券売機で「これも最後か」と思いながらメトロカードに2回分チャージして、2人で改札をくぐる。数セント残ってしまっているがもう仕方ない。一応取ってはあるが、もし今後NYCに行くことがあったとしてもメトロカードは使わない（使えない？）だろうなあ。\n\n止まっていたPATHの電車に乗ってNYCを後にした。\n\nPATHでNewark Penn Stationまで行ったら、外に出てUberを呼びホテルまで乗せてもらう。電車で最寄り駅まで行けただろうけど、こっちの方が楽そうだったので。ホテルにチェックインしてシャワーして一息ついた。空港までのシャトルバスが毎時00分と30分に出ていることを確認して、朝5時のシャトルに乗ることにした。この時点で5時くらいだった気がするので、Uber eatsをホテルへ頼む。メキシカン。量が多くて味も良かった。\n\n## EWR - SNA\n\n朝起きて5時のシャトルに無事乗り込み、空港について荷物を預け、セキュリティを普通に通過してゲートへ。なかなか綺麗でそこまで混雑してもいない感じ。時間までぼーっとして、搭乗した。\n\n機内ではなぜか席の上の荷物入れはそもそも使えないようになっていて、荷物を入れられない人たちが下に預け入れるために一旦外に出されたりしていたが、離陸時間は予定通りだったと思う。6時間以上の旅だったが、ダウンロードしておいたNetflix映画を見ていたら着いた。The Gray Manはなんか深みがなかったなあ。Unitedは好きじゃないんだけどもまあまあ問題なし。\n\n## 新住所へGo\n\nフライトは予定より1時間くらい早くSNAに着陸した。あるあるなんだが、これだけ早く着いてしまうとゲートが空いていなくて結局機内で待つことになる。まあ時間通りにゲートを出られたのでよし。手荷物もさっさと出てきたし、レンタカーの場所もすぐにわかった。\n\nLAXと同じようにGoldメンバーは直接駐車スペースへ行くようになっていたが、LAXとは違って鍵は駐車スペースで人から受け取るようになっていた。「日本人？」「そう」「私はペルーから来たので日本人には親しみがあるよの。大統領も日本人だったし」「フジモリさん」「そうフジモリ」フジモリ大統領の評価というような野暮な話は持ち出さないように相槌を打って鍵をもらう。燃費を気にしてMediumサイズにしておいたのに車に行ってみたらなんとGrand Cherokee。デカすぎて不安だったので戻って「小さい車ないの？」「んー、Nissan Altimaならある」「じゃあそれで」というわけでFull sizeになってしまった。どんまい。\n\nアパートへは20分程度で到着した。10時半には着いてしまったのでLeasing Officeに入ってみると、隣のResident Serviceまで案内してくれて、そのまま手続き開始。この時点で支払っておくべき今月分の家賃やセキュリティデポジットなどはすべてオンラインで支払い済みで、書類にもサイン済みなので、やることは多くない。鍵を受け取ったという書面にサインし、駐車場の位置やゲートの動作などを案内してもらって確認して、部屋に入る。無事にマットレスが届いていて安心した。\n\n[入居した](/blog/moving-6-20220905)へ続く\n","navs":{"nextPage":{"epoch":"1662427509","title":"引っ越し先へ入居した","slug":"/blog/moving-6-20220905"},"prevPage":{"epoch":"1662012453","title":"引っ越し業者を探して荷物を梱包した","slug":"/blog/moving-4-20220831"}}},"__N_SSG":true}