{"pageProps":{"frontmatter":{"slug":"/blog/resuming-bike-ride-20221001","date":"Sat, 01 Oct 2022 20:38:22 GMT","title":"自転車に再び乗り始めた","epoch":"1664656703","excerpt":"週末に気軽に自転車で出かけられるようになりました","ogImage":"/images/bike-route.jpg"},"markdownBody":"\n## 自転車にさっと乗れる環境を\n\n日本にいた当時、特に毎週末暇だった時期にはよく[自転車で荒川沿いを数十キロくらい走っていた](https://connect.garmin.com/modern/activity/43433128)ものだった。ニューヨークへ移ってからすぐの頃は、せっかく自転車を持っていったこともあって[週末にセントラルパークまで行ったり](https://www.strava.com/activities/81037346)していたのだが、それもしばらくするとやめてしまった。[自転車通勤はぼちぼちしていて](https://www.strava.com/activities/2497739102)ストレス解消には役立っていたものの、どうも週末とかに乗る気にならなかった。\n\n乗る気になりづらかった大きな理由は、出かけるときと帰ってきたときの自転車の出し入れのめんどくささにあった。自転車置き場に置いてある自転車にまたがってふらっと出かけられるわけではなく、エレベーターに乗って部屋の中まで持ってこないといけない。ただでさえ狭いStudioの一部を汚い自転車が占めてしまうのがなんともアレだし、オイルをさしたり掃除をしたりといった作業をするのも難しい。通勤のときはある意味仕方がないからということでがんばってはいたものの、週末に楽しみのために「がんばって」自転車を準備する気になりづらかった。そして通勤も2020年初頭を最後に行われなくなった。\n\nだが[今はカリフォルニア州民である](/blog/moving-6-20220905)。引っ越してきたアパートの駐車場には、セキュリティゲートのついた自転車置き場がある。この辺りは外部から荒らしがふらっと入ってくるような土地柄ではないので、[Kryptonite NY Lock](https://www.kryptonitelock.com/en/products/product-information/current-key/002154.html?type=bicycle)をかけておけば十分な気がする。ので、自転車を置いておく場所という問題が解決した。土曜日の朝起きて、着替えて水を持ってふらっと出かけられる。\n\n## ブラケットカバー交換からのブレーキキャリパー交換\n\nそういうわけで、引っ越してきてすぐにさっそく乗ろうとしてみてはたと気づいた。自転車を買って以来ずっと、14年以上使ったブラケットカバーがベトベトで実はすでにやぶれていたこと。あれ？とちょっと持ち上げたら切れちゃってそれきり使えなくなってしまった。105の5600シリーズのSTIレバーにあうカバーなんてまだ在庫あるのかな...と探したら[Amazonで6600用のカバー](https://www.amazon.com/SHIMANO-ST-6600-Ultegra-Hoods-Black/dp/B001P9EVHS/)があって5600にも使えるということなので、注文した。\n\nブラケットカバーが届いたので、事前に[YouTubeで](https://www.youtube.com/watch?v=eEwuHR5iQxw)確認した方法で交換にチャレンジ...と思ったら、この方法じゃ無理じゃん。先端からギアのケーブルが出ているので、前からではなく後ろからしか入れられない。ということはSTIレバーは外さないといけない。STIレバーを外してブラケットカバーを通すには、ブレーキケーブルを一旦抜かないといけない。\n\n![こんな感じのケーブル取り回し](/images/sti-5600.jpg)\n\nというわけで仕方なくブレーキケーブルを抜いたのだが、ブレーキケーブルの先端がすでにばらけてしまっていて、もう一度入れ直すことができそうにない。なんてこった。せっかくだから14年以上そのまま使っていたブレーキケーブルも交換するか...\n\n以前から気になっていたというか、今乗っている自転車は、その他はほぼ全部105 5600なんだが、ブレーキキャリパーだけShimano BR-R560という完成車用のグレードダウン品？だった。別に困らなかったし性能を云々するほど乗っていないのでいいんだが、たまに他の人の自転車のケツにくっついたときにブレーキに105ロゴが入っているのを見て少しうらやましかった。\n\nそこにきてこのブレーキケーブル交換である。この際12年も使ったブレーキキャリパーも交換してしまおう。そしてどうせ交換するなら105じゃなくてUltegraにしよう。この際ブレーキだけDura-Aceとかいうバカなことも考えたが、高すぎるのでやめたw\n\n色々探した結果eBayでBR-R8000ブレーキを前後で$80弱で落札に成功。送料を入れて結局$100になったけどまあよし。届いてみたら新品同様のピカピカ感だったのと、コルクのシューがついていて予備のシューが2組もついてきたのでお得だったと思うことにした。ワイヤーカッターも買う必要があったので、ケーブルはAmazonの激安ワイヤーカッターもついてますセットを買った。めったに40kmも出さないんだし、いきなり切れたりしないでしょさすがに。\n\nそういうわけで2週間もあいてしまったが、無事にブラケットカバーを交換して、新しいブレーキケーブルを通して、STIレバーを付け直して、ブレーキを交換できた。この際新しい自転車を、とか思わなくもないんだが、このフレームの色がお気に入りなので変えたくない。他のところは105 5600のままだけど別に問題ないし。\n\n![Ultegra!](/images/new_brake.jpg)\n\n## 家の周りの自転車コース\n\n家の周囲には、バラエティに富んでいるわけではないものの、ロードバイクで走るための道がそこそこ整備されているので、ふらっと[20kmくらいなら行けるルート](https://www.strava.com/activities/7895966214)を見つけた。適度にアップダウンもあって運動にもなる。久々にまじめに乗ってみて、全然登れないのでがっかりしているけども。\n\n![コースその1](/images/bike-route.png)\n\nそれより実は未舗装路のトレイルがたくさんあることにびっくり。さらにこれらのトレイルの多くで自転車OKなことにもびっくり。みんなマウンテンバイクで登っている。もしかしてこっちの方が楽しいのでは？マウンテンバイク買うか？うーん、でも[Mini](/blog/bought-mini-cooper-s-20220910)には自転車積めないな。キャリア買うか？\n\n","navs":{"nextPage":null,"prevPage":{"epoch":"1663452385","title":"カリフォルニアで運転免許を取った","slug":"drivers-license-ca-dmv-20220917"}}},"__N_SSG":true}