{"pageProps":{"frontmatter":{"slug":"/blog/job-change-20220516","date":"Mon, 16 May 2022 04:00:00 GMT","title":"転職した","epoch":"1652673600","excerpt":"ソフトウェアエンジニアとして再出発します。"},"markdownBody":"\n## そうだ転職しよう\n\nこの会社に入ってもうすぐ5年。5年同じ仕事をしていればそろそろ飽きも来るというものだが、今の会社にはAndroid Engineerとして入ったものの、そのアプリが2019年末でサービスをやめてからは、ReactJSでWebアプリ、Objective CでSketchプラグイン、AndroidアプリやiOSアプリ、たまにFlutterもやるなど、同じ仕事を毎日やっていたわけではなかったので、飽きたというのはちょっと違う。\n\nそもそも今の会社に入ったときの転職活動のときに思っていた、このままだと[「何でもできる＝何もちゃんとできない」エンジニアってことになってしまうという懸念](/blog/2017-08-08_Achievement-unlocked----------H-1B---------1-2--488f6217c832/)が再来してしまった。アメリカ合衆国内での職探しはどうしてもJob Descriptionにきっちりフィットする履歴書を持っていないとダメな気がしていて、何でも人並みにできますのでその仕事ももちろんできます、という売り込み方は通用しない印象がある。\n\nそれならAndroidのアプリをシャットダウンしたタイミングでAndroidエンジニアの職探しをすればよかった。当時の同僚エンジニア2人は2人ともSquare出身で、紹介ネタもありそうだったし。しかし当時は[H-1Bがすでに切れていてI-140ベースの延長期間中で](/blog/green-card-2018-2021-11-1/)、会社を移るのは無理ゲーだった。\n\nその後[ようやくグリーンカードをいただけて](/blog/green-card-2018-2021-11-2/)、そこから半年くらいは待ったほうがいいよという各所の助言を得て、2022年には転職活動を始めてみることにした。\n\n## 転職活動にあたって\n\n今回の転職活動にあたって、当初職探しの条件に設定したのは以下の3点。\n\n1. フルリモート、または西海岸の仕事\n2. Androidアプリのエンジニア職\n3. 給料をあげる\n\n### 1. フルリモート、または西海岸の仕事\n\nトランプ、BLM、パンデミック、(Stop) Asian Hate、バイデン、クオモといろいろあるニューヨークライフだが、あまりテレビニュースで見るようなひどいことには巻き込まれていなかったので、どこか他人事感を持っていた。しかし2022年になって、いわゆるコロナ禍が終わりに近づいてきたせいか、周囲の家賃相場がアホかというほど上昇していくのを見るにつけ、いいかげん現状の給料ではここには住み続けられないと気づき始めた。それならということでもう少し家賃の安いところを探してみると、ここに住むのは治安的な意味で無理ってところばかり。無理じゃない場所は高い。当たり前。ハドソン川を渡れば少しは安くなるけど、会社はそろそろハイブリッドに変わりつつあって、通勤が面倒になる。というわけでこのままだと給料をあげるしかない。現状で給料をあげるには転職しかない。8月（今のアパートの契約切れ）までに転職だ。そして、転職するなら何もニューヨーク市に住み続ける必要もないんだ。だったらちょっと風景を変えてみよう。というわけで、西海岸へ引っ越すことを視野に入れることにした。\n\n### 2. Androidエンジニア\n\nJob Descriptionにフィットするような履歴書を書けるようになるためのポジションということで、自分のスキルと興味を棚卸しすると、やっぱりAndroidエンジニアが一番それっぽいんじゃないかと思った。試しにちょいと探してみると、それなりに給料が上がりそうな募集も結構ある。なのでそれで行こうと思った。\n\n### 3. 給料をあげる\n\nニューヨーク市から出ることで家賃が下がるなら、給料は現状維持でもいいのかもしれない。したがってこの点は柔軟に、下がらなければ良いってことで。そしてこれを実現するために、複数社からオファーをもらうことを目指す。\n\nこの3点を念頭になんとなく職探しを始めてみてすぐに、これらの条件にマッチしそうで、めちゃおもしろそうなことをやっていて、日本との繋がりもある会社があったことを思い出してその会社のホームページを見に行ったらなんとモバイルアプリのエンジニアを募集していた。速攻で応募してみたのが1月のことだった。この会社からは結局3月頭にお断りされてしまってとても残念だったのだが、一社応募しちゃったんだしということで俄然ヤル気が湧いてきて、LinkedInの内容を整理し、職務経歴書を書き直し、Hired.comに登録してプロフィールを公開して、まじめに転職活動を始めたのが2月。\n\n## 転職活動の内容\n\n前回の転職活動での反省を踏まえて、今回はCVの内容をAndroidアプリ開発に関わることに絞って書き、それ以外の「何でもできるんですよ」みたいなアピールをしないようにした。それと、普段から公開していた履歴書には大学卒業以来のすべての経歴を書いていたのだが、これだと年齢差別にあいかねないので、直近数社のものだけにした。大学の卒業年度とかも消した。そもそもそういうのは採用プロセス中に聞いてはいけないのだし。\n\n転職活動の準備として行ったのは、Leetcodeのeasyやmediumをやることと、HackerRankの問題を上から順番にやること。それとdeveloper.android.comで最近のAndroidアプリの書き方をあらためておさらいし、Flickrの写真を一覧するアプリとか、Google Authenticator的なTOTPをやるアプリ（QRコードをスキャンするとか）をそのやり方で作ってみることくらい。あとはインタビューを受ける会社のJob Descriptionを見て、それに合わせて自分の職歴をしゃべれるようにまとめることはインタビューの前にやっておいた。\n\nHired.comで審査を経てプロフィールが公開されると、さっそく数社からインタビューリクエストが来た。どれも希望する給与を満たすAndroidエンジニアのポジション。これは幸先がいいぞ。ここから6ヶ月あれば1社くらいには滑り込めるのではないか。\n\n振り返ると、まじめに始めてから1ヶ月程度の期間で、リクルーターの電話スクリーニング、Hiring Managerとの面談と進んだのが10社くらい。その後コーディング面接の時間までスケジュールできたのが5社。就業時間中にはやらないようにしたので、ランチタイムの1時間と夕方以降だけでスケジュールしたのだが、多くの会社が太平洋時間にいるせいでうまく行った。もっともこちらは通常業務を終えてから日によっては2コマもインタビューを入れたりして、だいぶ疲れた。\n\nコーディング面接で、いわゆるLeetcodeだったのは2社。そのうち1社はマージソートを書かされた。今どきソートとか書かせねーだろとかヤマをはって完全に裏目った。最終的には書けたんだけど、それで40分使っちゃったので予定されていた2問目には進めず。この会社はその2週間後に連絡が来て、なんとお祈りではなく次のステップをと言われたのだが、すでにオファーをもらったあとだったので断った。\n\n### Coderpadのバグ？を踏む\n\nLeetcode的なやつのもう1社はフィンテック？な会社で、簡単なクレジットカード番号のパーサーを書くところから始まった。定石にしたがって、入力の長さチェックとか数値以外が入る可能性があるのかとかそういう質問をし、「いやそれは気にしなくていいからとりあえず書いて」と言われたので、テストケースにあらかじめ挙げられているものをパースできるコードを書いて、CoderpadのRun Codeを押す。問題なく3つのテストケースをPassした。そしたら向こうは不思議がって、あれ？あれ？ちょっと待てよとかいいながらassert(false)的なテストケースを向こうで追加してRun Codeした。すると今度はさっき通ったテストも含む全部のケースがFailした。は？なんで？テストケースを追加したらさっき通ったやつもFailしたのなんで？相手はなぜか満足そうに「これは思った通りの結果だ。どこがおかしいかわかる？」え？\n\nいやどこもおかしくないんだけど、といいながらこちらでRun Codeしたらやはり全部Fail。さっきは通ったのに、テストを追加したら今度は全部Failしたことになる。意味がわからなくてprintlnを挟んでみたりして実行するんだが、Fail。いやまじでわからない。追加されたテストを消して元に戻してもやっぱりfailするって何？\n\n本当にわからなかったので焦ってブラウザの戻るボタンを押してしまい、あわてて元のページへ戻って、書いたコートが消えてないか確認してみてびっくり。なんとさっきは一番下の行で見えていなかった、最後のreturn文を書き直した分が消えていた。元々`return null`が書いてあったのを、最初のRun Codeの直前に`return map[issuer]`的なコードに書き直したのに、`return null`に戻っていた。最初にテストをpassしたときには書いてあったのに、実行してpassしたのを見て「あれ？」とか言っていたのは、向こうのCoderpadのエディタにはその最後の書き換えが反映されてなくて、それなのにテストがpassしたのでおかしいと思った、それで向こうでテストケースを追加してRun Codeしたせいで、向こうの見ているものが最新になり、こちらの画面はリロードするまで内容が変わらなかった、ということだったようだ。通信環境のせいかもしれないが（相手は音質も画質も悪かった）、Coderpadのバグだと思う。I swear I wrote this line; you saw the tests passed the first timeとかなんとかいったが、とにかくこれのせいで時間を取りすぎて肝心の「このダメコードをどう直すか」みたいな部分へ進まず、「じゃあ時間がないから何か質問ある？」ha、ダメだこりゃ意味ねーわと思って「特にないです」「じゃあさよなら」で終了した。\n\nこの会社は1週間経っても連絡がなかったので、こちらから「先に進むつもりはありません」と送ったら「候補者の意思でプロセスを打ち切りました」みたいな自動メールが来た。\n\nこの後もう1社Coderpadを使う会社があったのだが、そこではいちいち「この行、今書いたの見えてる？」「最後のreturn hogeって見えてるよね？じゃあ実行するよ」とかってやった。Coderpadを使うときは気をつけよう。\n\n### Androidクイズでつまずく\n\nある会社の面接ではAndroidクイズを出された。1問目はAndroid Studioのレイアウトエディタのデザイン画面のスクショを見せられて、それを作る方法を口頭で言わされる。ConstraintLayoutで、Text1はstartをparentにして次のText2はstartをtoEndOfでtext1にして...とか。2つ目のデザインではLinearLayoutでlayoutWeightで、とか言ったらうちはLinearLayoutは使いませんとか言われて、はあ、しかしこれをConstraintLayoutで実現する方法は覚えていないです。やれば数分でできるだろうと思いますが、今は覚えてません、みたいな返事をした。\n\n次の質問は「Describe the difference between ViewModelOwner and This」。Google Docに書いてある文で、大文字小文字も原文ママである。なんの文脈もない、この一文だけ。今どきこういうのを聞かれるとしたらやっぱり「Activityとかでflowをcollectするコードを書け」みたいな、launchWhenStartedじゃなくてrepeatOnLifeCycleを使おうね、みたいな話を聞くんだろうなと思って、LiveDataは最近使ってないしもう使わんでもええやろ的なヤマをはって裏目った。ViewModelOwnerって大文字で始めてるから、あれ、これってクラスだよねそれとThisの違い？Thisってなに？もしかして自分の知らない何かなの？単に先頭が大文字になっちゃっただけでしょ？とか頭の中大混乱。今思えば、「これ大文字に意味あるの？」って質問すればよかった。なんかこの面接ではクイズが唐突に始まったので、これはウォームアップなんだと思って、いわゆるコーディング面接がその後に続くんだろうと思い込んでいたので、コーディング面接での定石が頭からすっ飛んでしまっていた。クイズだから、なんかパッと即答してどんどん進まないと行けないような錯覚に陥ってしまっていた。\n\nいやFragment内でthisでobserveするとviewが消えてもfragmentが生きててさあ、みたいなことを答えた。そういう程度の知識はあったけど、あれ、これってonViewCreatedの話だったよな、あれ？ActivityでもViewModelOwnerってクラスで何かできるの？知らないよそんなの、ってパニクってしまった。\n\nそして最後の問題「2つのActivity間でデータを共有する方法を答えなさい」。何を答えればいいのかわからない。1つ前の問題ですでにパニクっていたので、ここでもえ？え？となってしまい、えーと例えばファイルやデータベースを使うとか、あーいや、Intentで送ってonActivityResultで返してもらうっていうレベルの話ですか？みたいなことを言ったら相手は困惑顔で、「えーと、OK。SingletonをInjectすればよいですね。Singletonはわかりますか？Dagger2を使ったことがあると履歴書に書いてありますが？」まじかよ。その質問で正解がそれだけってことはないだろ。\n\nこのインタビューの最後には、「あなたはこれらの質問に正しく答えられなかったので、Seniorのポジションで進めるのは難しいと思います。でもあなたには多くの経験があるようですので、1つ下のレベルのポジションで進めるとしたら興味はありますか？」と聞かれた。いや、うぅぅぅ、このクイズに即答できないとSeniorじゃないの？そうなのか...まあでもコーディング面接をまだ続けられるなら練習にはなるし、いやもう少し自分を証明できる機会をもらえるのでは？とか思って、ぜひお願いしますと答えたが結局1週間後にお祈りされた。SingletonをInjectするシニアエンジニアを雇ってがんばってくれよチクショー。\n\n### その他\n\nもう1社はそこそこ実践的なものでLeetCodeではまったくない。Google Doc上で擬似気味なコードを書いた。この段階は通って次のvirtual on-siteのスケジューリングへ進んだんだが、他のオファーを受けたのでお断りの連絡を入れた。\n\nコーディング面接の前に宿題を出された会社も1社あった。このポジションはプラットフォーム横断的なことをする内容で、宿題もフロントエンド（UIデザイン含む）、API設計と実装、モバイルSDK（ライブラリ）開発の3つから1つ選んで、まあ2、3時間でやってください、というもの。これだと週末にできるのでとてもよい。\n\n最初API設計と実装のプロジェクトを始めて、expressでTypeScriptとNode.jsとOpenSearchでさくっと実装したんだが、地図上のある点に近い登録情報を検索して出すみたいな内容をOpenSearchを使ってやってしまって、これじゃOpenSearchのQuery DSLを知っているだけでできてしまうので面白くないと思い、モバイルSDKの方に鞍替えしてみた。まあこれも結構あっさりできたし、DIで外部レイヤーを抽象してテストを書いてみたいなことをやったので、そこそこ自信を持って提出した。だがしかし、それから音沙汰なしでGhostされた。宿題を提出させてGhostかあ。Hiring Managerとの最初のスクリーニングでは好感度高い感じだったんだけどな。無視されるほどひどいコードを書いたとは思えないんだけど、Ghostなので何もわからない。オファーをもらってしまったのでこちらから連絡するのも癪だし、結局なんのフィードバックも得られなかった。\n\n## そしてもう1社\n\nコーディング面接まで進んだ中の最後の1社は、こちらから応募した会社だった。そうしたら応募したポジションとは異なるポジションはどうですかという連絡がきて、とりあえず話を聞いてみることにしたのだった。その時点ですでに電話スクリーニングだけで10社くらい、上記のコーディング面接もいくつか設定済みで、さらにその次の週末からまる2週間以上日本へ行く予定を抱えていたため、最初のHiring Managerとのインタビューでその旨を伝えたところ「じゃあそれまでにオファー出せるように面接を入れようか？」と言われた。さらに「それじゃあ一連の面接の中のシステムデザインのところは俺がやるから、今からやろうか？」このとき午後6時半。夕飯を作ってくれていた妻に断って、それをやってみた。\n\n内容はその会社の製品の内容を簡略化したシステムで、外部API連携をどう作るか、API呼び出しの回数に制約があるが普通に作ったらそれを超えてしまうけどもどうするか、外部APIは遅いこともあるが、UXを悪くしないために何ができるか、自社内にキャッシュのDBを作る？じゃあそのスキーマは、それにアクセスするSQLは？など。Google Drawで絵を描きながらやったのだが、何か答えるたびに厳しいツッコミがきて、正直これは通らなかったなと思っていた。面接終わりに「あなたはモバイルエンジニアなんだよね？」と聞かれたのでますます「あ、これはダメだったか」と思ったんだが、翌日には早速Hacker Rankの宿題と、本当ならHacker Rankの試験の後にスケジュールされるはずの面接3本の予約フォームが送られてきて、すごいスピードでプロセスが進み始めた。\n\n金曜日にまずAndroidチームのエンジニアとコーディング面接。これもLeetcodeではなく、渡されたお題に対してinterfaceを定義してdata classを定義したら、そのdata classにまつわる内容が変更されたときどうする？data classにフィールド追加、またはMap<>でやっちゃう？でもキーにとりうる文字列はどこかで定義しておきたいかな、などと話す。さらに別の場所で似たような問題が起きたらどうする？ああその要件ならMap<>よりも別のdata classを定義して別のメソッドも定義する方が安全だと思う、など。AndroidクイズではなくてAPIを呼ぶコードを実際に書いて、それを運用した経験があるよね？ってなことを確認した感じだった。\n\n土曜日にHacker Rankの試験をやる。75分の設定で、60分はコーディング15分は書き問題。それなりに業務に即した内容で、コーディングの方は60分で20個くらいあったテストケースのうち2つをpassできなかった。焦りまくって15分の方の書き問題を超スピードでこなしたが、ときすでに遅し。\n\n宿題を全部passできなかったのでお断りされるかと思ったけど、そのまま月曜日にもう一度コーディング面接。今度はバックエンド開発的な内容で、キャッシュをパージするタイミングはどうするかとか、呼び出し相手によってAPIや結果の形式が違うから、外部API呼び出しの部分はアダプター化してそこだけ別に更新できるようにしようとか、まあそういう提案をして納得してもらったような感じ。\n\n月曜日はもう1つ、TPMとのBehavioralな面接。これはまあ、常識的にそりゃそうだよねえというような返答をしていって終始和やかに終わる。「判断に必要なデータが足りていない状態で何かを実装しなきゃならないとしたらどうしますか」みたいな。\n\n火曜日にリクルーターから連絡が来て、エライ人との最終面接が木曜日の朝に設定された。エライ人はどちらかというと会社の状態の説明や、入ろうとしているチームに会社が期待していることなどを話し、こちらからは2、3定型な質問をして、おしまい。金曜日に、本当に出発前にオファーレターが届いた。\n\n面接してくれたメンバー全員がいい感じだったのと、どの人にも「そこで働いていていいことなんですか」と聞いたんだが、みんなとてもよい感じの返事をしてくれていてよかったのだが...。\n\n## オファー、そして...\n\n怒涛の手続きを経てオファーまで一気に進んだこの会社だと、当初掲げた条件3つのうち1つを満たさない。つまり、給与は上がるしフルリモートで西海岸への引越しはむしろ歓迎されるのだが、Androidエンジニアではない（ただし手出しする機会はありそう）。給料をあげようという目標のために、今回の転職活動ではオファーを複数もらってそれから考えるということをやりたかったのだが、ここ以外の他の会社の状況はどう考えても日本に行って戻ってきてから面接を再開することになる。その頃にはこのオファーは期限切れである。\n\n数時間考えたのだが、オファーを複数もらうというのはそれ自体が目標なわけじゃないし、掲示された金額はこちらの言い値がベースで、それにストックオプション少々、健康保険も本人分はプレミアムまで会社負担ということでトータルでかなりの増額になる。給与をあげるという目標は達成されたと言ってよい。Androidエンジニアではなく、相変わらず広く浅く手を出す仕事になりそうなんだが、この会社の製品自体はモバイルアプリなので、カルマをうまく貯められれば（そしてやりたければ）社内異動もできるかもしれない。どうしてもAndroidエンジニアじゃないといけないのかといえば、別にそんなこともないんだし。\n\nというわけで、現職の上司を日本へ行く前の金曜日にZoomで呼び出して、その旨を告げてひどくがっかりされた。とてもとてもお世話になったので申し訳ない気持ちでいっぱいだ。そして日本に到着した翌々日の早朝、時差ぼけで起きてしまったので朝4時にオファーレターを改めてじっくり読んでサインした。\n\n日本から帰ってから具体的に面接日時を決めようとしていたリクルーター数名には、お断りするメールを送った。ここでさすがというかなんというか、大手で余裕がある会社のリクルーターほど「おめでとう、今回は残念だけどまた関わる日も来るだろうからまたそのときに」的なメールを返信してくるのである。好感度爆上がりなのである。めんどくさいから送らないことが多いだろうこういうのが後々効いてくるんじゃないかなあと思ったりした。\n\n## 転職活動に関する余談\n\n今回転職活動をしてみて一番おもしろかった（いやおもしろくない）のは、Hired.comでプロフィールが公開されてからすぐ、爆発的にスパムメールが増えたこと。週に数通程度だった（のでスパムフォルダは何もせずに放置していた）のが、1日に50通来るようになった。メールアドレスは自分のWebサイト上で公開していたのだが、以前はそんなに来ていなかったのに、それがHired.comに登録した途端に爆発した。何が起きているんでしょうね。\n\nもう一つおもしろかったのは、Hired.comでプロフィールを公開してすぐに、突撃リクルーターメールも爆発的に増えたこと。Hired.comでインタビューリクエストを送ってくる会社もあるのだが、なぜかそれは使わずにメールアドレスだけを抜いて直接メールをしてくるリクルーターがたくさんいることがわかった。これの多くがスパム送りになるので、スパムフォルダを毎日チェックして整理する羽目になった。\n\nまた、Hired.comには空き状況を示すカレンダーの機能があるのだが、多くのインタビューリクエストはそんなのはお構いなしで、Calendlyを使っていた。Hired.comのカレンダーで一元管理できない以上使う理由がゼロなので、結局自分もGoogleカレンダーで管理することになり、Hired.comのカレンダーでは空きがまったくない状態にせざるを得ない。律儀にHiredを使うユーザーほど損というか面倒になってしまうので、プロダクトの根幹に関わる問題な気がする。\n\n## 反省\n\n今回の転職の反省点。結局コーディング面接まで進んだ会社が5社しかなかった。本当はもっとたくさん受けるつもりで、期間も3ヶ月くらいはやるつもりでいたんだが。しかしその3ヶ月の中のどこでリクルーターとのファーストコンタクトは締め切るかは決めておくべきだった。コーディング面接を控えたランチタイムに別の社のリクルーターとの電話をすると身が入らない。もっといいところ、もっといいところ、と思ってなんとなくずるずるとインタビューリクエストを受けまくってしまった結果、大して興味のない会社のリクルーターとの面接では明らかに自分にやる気を感じなくて、相手にも申し訳なかった。\n\nコーディング面接の準備はHacker RankとLeetcodeをただただやっていたのと、developer.android.comで最近のおすすめな書き方を見て実際にやってみる程度のことをしていたのだが、HR/LCはそもそも苦手なのでやはりあまり身が入らない。ほとんどJavaScriptでやっていたのだが、途中からEasyをKotlinでやってみるとかしていたおかげでCoderpadにKotlinで書かされたときに対応できたのはメリットだったかもしれない。でもアルゴリズムとデータ構造が身についたとは言えないな。次に転職するときはマージソートを練習しておこう（たぶんやらない）。\n\nリクルーターやエンジニアでないHiring Managerとの電話面接では、相手のJob Descriptionに合わせて自分の経歴を微妙に変えてしゃべるようにしていて、それは事前に調べてメモっておいたので、どの会社とでもまあまあうまく喋れたと思う。1社だけ、Series Aの調達を今まさにやってますっていうスタートアップに対して、西海岸に引っ越すつもりで、引っ越した途端に仕事がなくなったとか辛いから「で、Runwayどれくらいあるの？」って聞いたら、リスクを取りたくない人だと思われたらしくお祈りされたことがあったのだが、まああれは仕方ない。\n\n振り返ると、最初にこちらから応募して、7−8人と面接をして、どれもそれなりにうまく行ったと思ったのに3月にお断りされてしまった会社が一番悔やまれる。どこでダメな印象を与えたのかわかっていないんだが、たぶん言い方の問題でこっちの本心とは違う受け取り方をされたんだろうと思う。あれはなんとも悔しい結果だった。\n\nこれ以降は、何かに答えるときに取りようによっては悪く思われそうなことがあった場合は、どういう答えを期待しているのか聞いてから答えるようにした。例えば「現職でのデザイナーとのやりとりでうまくいかなかったことはありますか？どういう風に対処しましたか？」みたいなやつ。現職でやりとりするデザイナーはみな凄腕でうまくいかなかったことなどないのだが、「そんなことはなかった」と答えてしまうと耐性や免疫がないと思われて敬遠されるかもしれない。かといって全然問題なかった話をさも大問題だったかのように説明するのも嫌だ。そこで、「パッと思い当たらないんだけど、今デザイナーとエンジニアの関係で何か困っているようなことがあるのですか？」と質問者に聞いてしまった。これで、関係に困っているのではなく、ジュニアなデザイナーしかいないのでシニアなエンジニアはジュニアなデザイナーのこともメンターして欲しい、みたいなことだったことがわかる（こともある）ので、こういう場合はうまくいかなかったことではなく、うまくいった（最初からうまくいかせた）ときに何に気をつけたのかを話してしまえばよい。\n\nAndroidエンジニアを業務でやっていないのにAndroidエンジニアで転職したいということで、[OSSのAndroidアプリの地味なバグを地味に直す作業](https://github.com/signalapp/Signal-Android/commits/main?author=fumiakiy)も続けてきたのだが、その点を話してちゃんと評価してくれたらしきコメントをくれたのは1社だけだった。自分のプロジェクトでもない限り、やはり業務でやっている人じゃないと即戦力とはみなされづらいのかもしれない。それに結局は定型のコーディングテストをパスしないと、あの程度のコミットの内容ではスキルもよくわからないんだろうし。\n\nリクルーターからたくさん連絡をもらったのだが、前回の転職時と同様に結局はこちらから応募した会社に行くことになった。ただし前回よりもはるかに多くの会社にこちらから応募したのだが、面接まで進めず、Ghostだったり最初の書類でお断りされたりすることが多々あった。リクルーターはやはりそれなりにこちらの書類を見た上で先に進めそうな人だからコンタクトしてきているので、積極採用中らしき会社なのに向こうから来ない場合はこちらから行ってもダメなのかもしれない。オファーを受けることになった会社も、実はHiring Managerの方でHired.com上でこちらを見つけてくれて、声をかけるつもりでその前に自社の採用データで名前を調べて見たら、なんと前日にこちらから別のポジションに応募していたことがわかってびっくりしたと言っていたので、実質向こうから声をかけられたようなものだ。自分程度の経歴では、こちらから応募しても多数のライバルに埋もれてしまって無駄なんだろうなと気づかされた。次回はもっと声をかけられるように仕事をがんばろう。\n\n## One Room Disco\n\n新しいのは会社だけではなく、住む場所も新しくするつもりで、西海岸、具体的にはロスアンゼルス近郊で探してみることにしている。\n\nニューヨーク市に住んでいて良かったなあと思っていた点は、世界一レベルの文化施設（美術館とか博物館とか）がまとまっていて、でかい公園もたくさんあって、そしてそれらに地下鉄でお気軽に行けるということだった。多様な人々が狭い島にぎゅうぎゅう詰めで生きていて、狭い地下鉄に詰め込まれながら日常を過ごしていることからくる安心感にあった。しかし、何を起点にそうなっていったのか定かではないし元々幻想だったのかもしれないが、とにかく今の地下鉄には安心して乗ることはできないし、人にお勧めすることもできない。女性がベンチに座って電車を待っていたら人糞を顔に投げつけられる地下鉄とかムリ。大して遅くもない夜にアジア人女性が自分の住むアパートの廊下で後ろから刺されて死ぬような街では、一人で出歩けない。そりゃ地下鉄に乗らずにシェア自転車で出かければいいし、夜は外に出なきゃいいし、そもそもそんなのは全米のどの街でも大して変わらない、むしろニューヨーク市ははるかにマシな方だということも知っている。だけど人糞事件で（そしてその容疑者が何度も逮捕されては保釈金なしで釈放されていたらしいことを知って）自分の中の何かが切れてしまったのは事実で、だったら、どうせどこでも同じなら、風景を変えてみるのもいいんじゃないかと思った。家賃高いし。\n\nそれなりの治安、家賃安そう、リベラルな空気、東アジア人の多さ、などから思いつくのはシアトルやポートランド。しかし聞けば聞くほど、夏が終わると次の春まで晴れ間がないというのはちょっとイヤだなあ。じゃあやっぱりサンフランシスコかベイエリアか。しかし家賃は高い割にNYCに比べると何もないよなあ。\n\n西海岸で何でもあって大きな都市といえばロスアンゼルス。チラッとapartments.comをみてみると、家賃はNYCよりは安い。治安が心配ではあるが、前回ロスに行った90年代に比べれば改善されているような印象をうける。給料も上がったしフルリモートなおかげで、辺鄙なところに住んでも問題ないのだから、治安優先で探せばなんとかなるのでは？まずは週末弾丸ツアーでもして巡ってみようと思う。しかし航空券高いな。あーカリフォルニアなら車も買わないと。あーガソリン代も高いな。うーん、給料足りないかな。\n\nそういうわけで5月から新しい職場でまたがんばります。新しい場所でうまくやっていけるかな。\n","navs":{"nextPage":null,"prevPage":{"epoch":"1642451049","title":"壁に埋め込まれている電気のスイッチをHomekit対応のものに入れ替えた","slug":"/blog/meross-smart-wall-switch-1"}}},"__N_SSG":true}