{"pageProps":{"frontmatter":{"slug":"/blog/moving-6-20220905","date":"Tue, 06 Sep 2022 01:25:10 GMT","title":"引っ越し先へ入居した","epoch":"1662427509","excerpt":"カリフォルニア州民になりました"},"markdownBody":"\n## ベッドとマットレス\n\n[引っ越し当日](/blog/moving-5-20220904)から少し時間を戻して、引っ越す2週間くらい前の話。引っ越したあとの生活を想像したとき一番問題になるのが寝床の確保だった。こちらからベッドを送ったところで2-3週間は届かないので意味がない。そのため、オンラインであらかじめ購入して絶妙のタイミングで配送してもらうことで引っ越し当日の寝床だけは確保する必要がある。今更ホテルやAirbnbには行きたくないし。\n\n前回引っ越したときもCasperもどきのNectarというブランドのマットレスにトライしたんだが、今回もチャットで聞いてみたところやはり今から頼んでも配送は8月中旬以降になるという返事が来た。結局ある程度高いのは承知で、しかし配送日が確実なCasperでマットレスを買った。事前にアパート側に問い合わせたところ、人間が到着する以前に家具が届いてしまう場合、スタッフが「できる限りの努力」で部屋に家具を入れてくれるらしい。それを信じて、Casperに発注をかけた。ベッドフレームについても使っていたものと同じものをAmazonで発注する。こちらは最悪2、3日届かなくてもマットレスを床に置いて寝られないことはないので、届くのを期待しつつあまり信用しないことにした。\n\nCasperのマットレスは予想より早く出荷され予想よりも早く届いてしまうことが判明したので、あわててカスタマーサポートにチャットで連絡して「配送を8月8日以降にしてほしい」と、お願いした。その後もやりとりはあったものの、最終的にこのお願いは届いて、UPSはきっちり8月8日に配送してくれた。最も、8月8日ではまだこちらはニューヨークにいるため、メールで「マットレスが家の前に置き配してあるので、部屋の中に入れておいてほしい」とResident serviceのオフィスにお願いした。これも何度かやり取りがあって、最終的には電話したところ「OK今すぐ見てきます」と言ってなんとかしてくれた。そういうわけで、前記した通り、部屋に入ったらマットレスが置いてあったので安心したのだ。\n\nAmazon発送のベッドフレームの方はこれほどスムーズにはいかなかった。これも入居1週間前にAmazonで発注して、PrimeなしのFree shippingで1週間後に届けばいいやというノリでいたのだが、これが早く出荷されてしまい、入居する前に配達に出られてしまった。配達マンらしき人から携帯に電話が入ったのだが、たまたまそれを取ることができず、すると「配達不能」ということで止まってしまった。Amazon上のステータスでは「後日再度挑戦します」になっていて先に進まない。引っ越してきた後も再挑戦してくれないので、チャットでこれをキャンセルし、同じものを再度Primeで注文し直した。\n\n間の悪いことに、2回目の注文の方も外出中に配達マンから連絡が来たのを取り損ねて、また持ち帰りになってしまった。「中に入れなかったので配達できませんでした」という前と同じステータスになってしまったので焦った。たまたま外出していたそのタイミングでこれかあ、どうしようかと悩んでいたらその後「配達完了」になったので？？？と思いながら帰ってきたら部屋の前に置き配されていた。なんかどうにかしてアパートの中に入ったのだろうか。まあ届いたからよしとしよう。\n\n## バー スツール\n\n寝床はなんとか確保されたのだが、部屋でくつろいだり食事したりするために座る場所がない。新居にはキッチンの後ろにカウンターが設置されていて、ダイニングテーブルはいらないね、ということになっていたで、そこで食事するためのバー・スツールを買うつもりでAmazonでPrimeに入り、注文をした。しかしこれがまた「配送場所に入れないので配達不可」となってしまった。USPSだったのでトラッキング番号を入れて明日の再配達依頼をWebでやってみた。\n\nしかし1日経っても何も起こらない。Amazonに行くと「後日再挑戦します」というステータスになっている。Amazonのチャットに行ってみると、明日まで待ってもう一度連絡しろとBotに言われる。もう1日待ってみたがもちろん来ないので、再配達依頼を出す前に見た「局で預かっているので取りに来い」というステータスを信じてUSPSのオフィスに行ってみた。\n\nオフィスではやる気のない職員がトラッキング番号を見てそれを探しに行き、数分後に戻ってきて「ないです」。そして思い立ったように横にあるPCに何やら入力し、ため息をつき、「ないです。配達に出ているかもしれないのでまた来てください」家に帰り、何も信じられないのでこれはAmazon上でキャンセルできるようになったらキャンセルすることにして、再度一番早く配達できるとなっているものを注文し直した。\n\n新しい注文の方は2日後に配送中状態になったのだが、また同じ「配送場所に入れないので配達不可」となって「後日再挑戦します」というステータスになってしまった。これは困る。家にもどってAmazonのチャットに行き、人間にたどり着いて、さらに（どうやったのか覚えていないが）電話することができた。人間と思しき相手が出たのでことのしだいを改めて説明し、ああだこうだやっているとなんと上司に代わるという。上司氏に対してまた説明をし、なる早で配達してくれと伝えると「状態が不明なので今すぐ返答できないが、私の責任で必ず調べて結果を30分以内に折り返します。良いですか？」はいお願いします\n\nそして...。それっきりこの上司氏から（も他の誰からも）一切の連絡はない。結局1週間立って食事をし、床に座ってテレビをみていた。\n\n2点のバー・スツールが再配達に挑戦しますというステータスのまま放置されて1週間が経ってしまった。途方に暮れつつ、Redditで「ずっとステータスが変わらなかったパッケージがUSPSのWebフォームに入力した途端に見つかった」という書き込みをみつけたので、2つ目に頼んだ方について[ロストパッケージの連絡](https://www.usps.com/help/missing-mail.htm)をしてみた。どうせ何も起こらないんだろうと悲観していたんだが、数時間後になんと担当者から電話がかかってきた。そしてその担当者曰く「お宅のStreetへは配達はしませんので自動的に局留めになりますから取りに来てください」はぁぁぁぁぁぁぁ？なんで？え？取りに行くのはいいけど「お宅のStreetへは配達はしません」？？？配達しないならAmazonでPickupするのもやめてくれよおい。Amazon直営の配達業者なら配達してくれるんでしょ？\n\n担当者には「いや取りに行ったんですよ、そしたら配達中だからここにはないって言われたんですよ」「え？ちょっと私が今見てきます」...「はい、ちゃんとありました。取りに来てください」ほんとかよ\n\nこの担当者はいい感じの人だった。申し訳なさげな、ただ内容は「お宅には配達はしないことになってるんで」という話を繰り返されたので、「わかったじゃあ明日行きます」「はいどうも」となった。\n\n翌日車でUSPSへ行くと、今度はちゃんと箱が出てきた。なんとか車に積み込んで帰宅して、箱を開けてみてびっくり。2つ目に頼んだ方だと思っていたのに、最初に頼んだ方のだった。どうなってんの？2つ目のトラッキング番号でロストのクレームを入れたのに？なんだろうこれ。椅子が来たからまあいいけど。\n\n結局「私の責任において調べて必ず折り返す」Amazon上司氏からの折り返しはないまま、2つ目の方はCancel & Refundを受けた。引っ越してきて1週間、ようやく座って食事できるようになった。\n\n## その他\n\n住んでいる場所はすぐ近くにニトリ（Aki-Home）がある。引っ越してきた翌日にソファを見に行って、なぜか包丁とまな板を買って帰ってきたのだが、色々ネットで検索してみたり、IKEAにも行ったのだが、結局ここで見たソファがコスパが良いということになり、再度出かけていって購入した。\n\nそんなこんなで徐々に生活ができるようになっていった。出荷してから2週間後の25日には日通の荷物も届いた。やはり日本人のリーダーとヒスパニック系の2にんと計3人。箱を開けるところまでやると言われたのだが断って、運び入れてもらうだけで終わったのであっという間。壊れていたりなくなっているものもなく、自転車も無事だった。これにてようやく普通の生活を取り戻した。\n\n日通さんは多分アメリカンな会社に頼むよりも絶対的な金額は割高だったんだろうと思うが、そもそも精神的な余裕がなくなりがちな引っ越し、さらに考えたこともないような長距離ということを踏まえると、決して無駄に出費したような感じはしない。今回はニューヨークからロスアンゼルス近郊ということで発と着の両方に営業所があったこともあって、担当してくれた全員が見積もり依頼から梱包資材の配達、出荷当日、入荷当日とひたすらとてもよくしてくれた。限界まで節約したいということなら別だが、アメリカ国内で引っ越し会社に頼んで引っ越しをする際に自力でU-Haulしないなら、日通さんはお勧めできます。\n\nそういうわけでカリフォルニア州民になりました。","navs":{"nextPage":{"epoch":"1662860353","title":"カリフォルニアで車を買った","slug":"/blog/bought-mini-cooper-s-20220910"},"prevPage":{"epoch":"1662427509","title":"引っ越し先へ入居した","slug":"/blog/moving-6-20220905"}}},"__N_SSG":true}