{"pageProps":{"frontmatter":{"slug":"/blog/2021-08-26-driving-lessons-in-nyc","date":"Thu, 26 Aug 2021 23:34:52 GMT","title":"ニューヨークで運転免許取得のためのレッスンを受けた","epoch":"1630020892","excerpt":"ニューヨーク州で運転免許を取得するために、90分の教習を2回受講した話"},"markdownBody":"\n### 実技試験を受ける前に\n\n[前回からの続き](/blog/2021-06-13_five-hour-course-drivers-license-ny)。日本で普通自動車運転免許を取るには（ペーパー試験に加えて）警察署で一発実技試験を受けるか、教習所で練習して実技試験免除の認証をもらう。ニューヨーク州では仮免を取って5時間講習を受けたらあとはDMVで実技試験を受けるだけ。しかし自分の場合、普段自動車を運転していない上に右側通行での運転経験もほとんどない。さらに試験の様子や合格のためのテクニックも教えてもらえるということもあり、5時間講習を受けたFuji Driving Schoolさんで90分の講習を2回含んだパックにお金を支払っていた。\n\n### 運転教習1回目\n\n2回の教習の日程は、試験日の1週間前と前日にしてもらっていた。試験会場周辺は一度も行ったことのない場所なので、試験が火曜日に設定されたのでその1週間前の火曜日に教習を入れてもらい、その曜日ならではのトラフィックを体感しておきたかった。それと前日に設定しておけばまあいいんじゃないですか？というアドバイスもいただいたので。\n\n試験会場がQueensのEast River寄りの場所（Astoria Heights）だったので、練習もその近辺でさせてもらえるらしい。待ち合わせ場所へは地下鉄やバスを乗り継いで行くのが面倒だったのでCiti Bikeで向かう。事前に入念にGoogle MapsでTurn by turnのdirectionを暗記し、万全の準備で出発...したつもりだったが、やはり途中で道を間違えて予定より10分ほど多く時間がかかったものの、遅刻ではない。湿気が多くて汗を拭くタオルを持って出なかったことを後悔しつつ、待ち合わせ場所のCVSで水を買い、講師の方の車を待つ。\n\n講師の方は人の良さそうなおじさんで、最近の型のプリウスで来た。おそらくこの車で試験も受けるのだろう。この型のプリウスは日本でも何度も乗っているものの、なんとなくサイズ感がつかめない感じが不安だった。なんせ賞味2時間ほどしか乗っていない車で縦列駐車とかするのである。つらい。\n\n手指消毒などの手順を踏んで車に乗り込み、いきなりここから運転である。Astoriaのさらに外れの住宅街へ進み、レッスン開始。とにかく日本人にありがちな落とし穴を何度も丁寧に教えてくれてとてもよかった。詰め込まれる内容が多くて全部を頭に入れられるわけではないが、同じことを何度も繰り返し、全然嫌な感じでなく教えてくれるので助かる。\n\n教習の時間の大半は、縦列駐車に費やされた。右左折や交差点へ侵入するタイミングについても、縦列駐車できる場所を探して移動しつつ行い、しかしすきあらば縦列駐車である。縦列駐車ができないとこの街では免許をもらえないのである。切り返しも1回まで？縁石に当てたらだめ、縁石から離れすぎていてもだめ。試験なんだから当然だが、しかし苦手なものは苦手である。\n\n90分は結構あっという間に過ぎ、次は1週間後、ということでその日は解散となった。またCiti Bikeにまたがって帰宅する。必要以上に交差点の状況に気を配り、今まであまり確認したことがなかったAll WayとそうでないStopサインの違いなどを見ながら。\n\n### 運転教習2回目...の5日前\n\n1回目の教習を受けてから2日後。グリーンカード申請の件で弁護士から突然の連絡が来る。RFEが来たのでmedical examを受けてこい、期限は8月9日だ、と。詳細は別記事に書いたが、日程調整の結果どうしても路上試験の日にmedical examを受けないとならないことになってしまった。時間はmedical examが午前、路上試験は午後2時ということで、詰め込めばできないことはないかな...と一瞬思ったのだが、いやいやこの国でこの手のものが時間通りに行くことなどあり得ないのだから、と安全側に判断を倒し、試験日の変更をお願いした。\n\n後で決まった試験日は8月後半ということで、結果的に1回目の教習からまるまる1ヶ月空いてしまうことになった。しかしグリーンカードの手続きを期限通りに進めることの方が重要なので、仕方ない。別記事に書いた通り、結果としてこの期限は結局延長されたので路上試験を優先しても大丈夫だったのかもしれないのだが。\n\n### 本当に運転教習2回目\n\n1ヶ月まるまる空いて、路上試験前日の2回目講習である。前回と同じ場所で待ち合わせなので再度Citi Bikeで向かう。前回の反省を踏まえて、上り坂が多いのでe-bikeで行こうと思っていたのに近隣のドックにない。仕方ない、前回よりも時間に余裕を持っているしゆっくりこいでいけばいいか、と家を出た直後に携帯の充電がほぼないことに気づき、慌てて家に戻って妻の携帯を持って出る。あわててCiti Bikeにまたがり、慌てふためきながらこいで前回よりもさらに道に迷う。夏の最後の暑い日で汗だくである。どうにかこうにか待ち合わせ時間ぴったりに到着した。ふう。\n\nそんなこんなでアドレナリンが出まくっていたせいか、初手でインストラクターから「ちょっとハンドルが荒いのでもっとゆっくり、スムーズにしてください」と言われる。うーん、まあそこまでギャンギャンとステアリングを回していたわけではなく、ただ二重駐車が両側にあったのを避けつつなるべく自分の車線に戻ろうとしていただけなんだが、まあまあと自分で深呼吸して気持ちを落ち着かせる。\n\nこの日は試験をやっていないようだということで、まずテストのスタート地点へ行ってテストコースになりそうなところをさっと周回した。この辺で縦列駐車をやりがち、この辺はスクールゾーンなので速度超過に気をつけて、など。\n\nその後は前回もぐるぐる回った場所へ行って、縦列駐車の練習。まあなんだろう、15回くらいやってOKが9回、ちょっと離れすぎ3回、NG3回くらいな感じだった。NGの直後はうまく行く傾向があるんだが、なんせ試験では1回しかできないのでこれはもうなんというか、がんばるしかない。\n\n3ポイントターンと普通の右左折、一時停止やAll way stopなどを一通り回り、これは問題ないですねーと言われた。一般論として右折時にワイド、左折時にショートしがちなので本番では曲がり始めに気をつけよう、など。\n\n90分の練習が終わり、いよいよ翌日は本番の試験である。せいぜい15分くらいの運転で70点くらい取れれば（つまり減点を30点以内に抑えれば）よいのである。よいのであるが、これをすると一発で15点減点みたいなのもたくさんあるので、実質的にミスは1回までである。試験官によっては英語が聞きづらいみたいな人もいるらしく、聞き返すとやる気をなくしてあっという間に不合格にされるみたいな話も聞くので、どうせ落ちるよ俺は運というものがついた試しがないんだから、と自分に言い聞かせる。\n\n[試験当日へ続く](/blog/2021-08-27-dmv-road-test-astoria-heights-1)。\n\n","navs":{"nextPage":{"epoch":"1630087252","title":"ニューヨークで運転免許取得のための路上試験を受けて落ちた","slug":"/blog/2021-08-27-dmv-road-test-astoria-heights-1"},"prevPage":{"epoch":"1623624560","title":"ニューヨークで運転免許取得へ動き出した","slug":"/blog/2021-06-13_five-hour-course-drivers-license-ny"}}},"__N_SSG":true}