{"pageProps":{"frontmatter":{"slug":"/blog/moving-1-20220731","date":"Sun, 31 Jul 2022 19:13:05 GMT","title":"カリフォルニアへ引っ越そうかなと思った","epoch":"1659294821","excerpt":"カリフォルニアへ引っ越すことにして、場所を決めて内見ツアーを組んでみました。"},"markdownBody":"\n## 引っ越すことにした\n\n[転職してフルリモート勤務になり](/blog/job-change-20220516/)ニューヨーク市に住み続ける理由がなくなったので、転職活動中から考えていた引っ越しをいよいよ実現することにした。フルリモートといってもいわゆるLower 48ということで、アラスカやハワイはナシ。じゃあどこへ行くか。\n\nもちろん真っ先に考えたのはサンフランシスコで、友人もいるしLower 48内ならNYCに次いで土地勘がある場所だし（そんなに知ってるわけじゃないんだけど）、ソフトウェアエンジニアなら考えるでしょそりゃ。Apartments.comなんかで見てみると、家賃はNYCと比べてあまり変わらない感じ。ただそのあまり変わらないというのが、なんというか、うーん。\n\n他に治安とそれなりの東アジア人コミュニティてなことを漠然と考えると、シアトル、ポートランドあたりを思い浮かべてみた。さっそくZillowあたりでざっくり賃貸物件を探してみると、NYCよりはやはりだいぶ安い。土地勘が全然ないのであまり安いところはやめたほうが良いと思ったのだが、[ポートランドについてはtypesterさんのブログ](https://unknownplace.org/blog/)を読み返してこの辺ならいいのかな？と思ったあたりを見てみてもやはりNYCよりはだいぶ安い。というか、NYCでStudioに払う金額で2ベッドになる感じ。シアトルについてもベルビューあたりまでなんとなく調べてみたがやはり同じような感じだ。\n\nだがしかし、現地在住らしき日本人（だと思われる人）たちのブログやYouTube動画を見るにつけ、どうしても気になるのが夏以外の天気。年中曇りで日がささないせいでDepressionになるとか。うーん、残り少ない人生を家賃が安いとかいう理由でそんなふうに過ごしていいものだろうか。\n\nじゃあむしろいわゆるベイエリア行っちゃうか？とサニーベール、クパチーノ、ロスガトスあたりも検索してみる。まあ確かに住めそうな賃貸アパートがないわけじゃない。天気も良いし、ソフトウェアエンジニアなら考えるでしょやっぱ。んーでもなあ、ここに住んで自分はともかく妻は楽しめるだろうか、と考えるとなんか違う気がする。\n\n妻に「西海岸へ引っ越したい。西海岸限定だとしたらどこに行きたい？」と聞いてみたら即答で「ロス」。えええ？ロス？あの[Straight Outta Compton](https://www.imdb.com/title/tt1398426/)のロス？[Killing in the name](https://www.youtube.com/watch?v=bWXazVhlyxQ)のロス？と思わず詰めてしまったのだが、考えてみたらそれって80年代90年代の話か。最後にロスに行ったのはTech Ed 96の時だから25年前だ。今のロスアンゼルスはそうでもないのかも？\n\n## 憧れのレドンドビーチ\n\nZillow以外にApartments.comなんかでロスアンゼルスの家賃を見てみる。サンタモニカやビバリーヒルズは当然高いんだが、それでもNYCと比較したら「え、住めるじゃん」って金額だ。とはいえ少し安くなるところはないのかと、やはり日本語ブログやYouTubeを漁って見てみたところ、Silver Lakeってところが「西のWilliamsburg」らしい。Williamsburgは気に入って住んでいるので、これは気になる。物件は数が少ないものの家賃自体は住めそうな範囲の金額だ。ここ、いいのでは？\n\nさらに漠然と検索を続けていると、ロスアンゼルス空港の南側のトーランスという場所に日本人が固まって住んでいるらしいことがわかった。「ロスアンゼルス」ではない気がするが、「日々平穏に暮らしたい」という妻の要望はむしろこちらの方が叶えられるのではないか。ミツワもあるし。車が必要だけどまあそこはどうにか。\n\nっていうかちょっと待って。トーランスって[Developmentorがあったあのトーランス](https://www.showmelocal.com/profile.aspx?bid=13273063)？行きたかったけどついに行けなかったあの[Guerilla COMをやっていたDevelopmentorの所在地](https://web.archive.org/web/19990909153246/http://www.develop.com/dm/Course.asp?id=1)じゃん！俄然トーランスに気持ちが傾き、さらにHotpads.comなども動員してアパート探しをしてみた。そしたらなんと、トーランスって**あの**レドンドビーチの隣街じゃん！ということにも気づいてしまった。[あのお方が住んでいたあのRedondo Beach](https://books.google.com/books?id=kfRWvKSePmAC&lpg=PR23&ots=oafZceeIco&dq=redondo%20beach%20%22essential%20com%22&hl=ja&pg=PR23#v=onepage&q=redondo%20beach%20%22essential%20com%22&f=false)じゃん！俄然テンションが上がって検索の網を広げて見たところ、レドンドビーチでも普通に住めそうな物件がいくつも出ていた。俺、あのレドンドビーチに住んじゃうのかも？\n\nレドンドビーチとトーランスは車があればいくらでも行ったり来たりできる距離だし、治安的にも東アジア人的にもよさげ。妻の知人も「トーランスなら日本語だけでも住めるかも、くらいのところ」ということだそうで、この周辺でまじめに探すことにした。\n\nまじめに探すといっても気軽に出かけていって見て回ることはできないので、もっぱらネットで賃貸アパートを検索できるサイトを毎日毎日眺めるくらい。毎日見ていても物件がそこまで動くわけじゃないし、まして申し込むこともできないわけだが、同じ場所を見続けているとなんとなく家賃相場がわかるし、それ以外の要素、例えばガス水道電気やゴミ出しなんかに必要な金を誰が負担するのが普通なのか、みたいなことがふわっとわかってくる。NYCで住んだ最初のアパートはガスと水道は大家さん持ちだったが、2軒目の今住んでいるところはガスもこちらもち。でもゴミ捨てにお金を取られるなんて話は聞いたことがない。だが、探している場所のアパートの説明ではゴミはrenterなどと書いてあるところが結構あって、へえーそうなんだ、みたいな。\n\nまじめに、しかし漠然とトーランス、レドンドビーチ、ハモサビーチあたりの物件を検索していると、[日本のスターツ](https://kaigai.starts.co.jp/la/house_rent_apart)がここ周辺の物件を扱っていることがわかった。日本から来る駐在さん向けにオンラインで内見ができるらしく、日本からではないけどここに頼めれば、実際に行かずにアパートを見つけられるかも。手数料がかかっても、こっちから飛んでいって数泊してってしたら同じようなお金がかかるので、無駄じゃなさそう。\n\n## アーバイン\n\nスターツのWebサイトで物件を見ていると、「アーバイン・コスタメサ」という地域が出てくる。どういう場所かなあとなんとなく調べてみると、アナハイムの少し南にある計画都市で「全米トップクラスの治安の良さ」らしい。大谷翔平が住んでるらしいという噂はどうでもいいんだが、日本人や東アジア人が多くいて、ミツワだK-martだがいっぱいある。そしてこの地のアパートメント・コンプレックスはどれもこれもやれプールだBBQエリアだとリゾートホテルのようなアメニティがついていて、それでいて家賃の金額はトーランスで探していたような範囲に収まっている。\n\nもちろんクソど田舎のベッドタウンで人工的に作られた計画都市の中にある狭い1ベッドでその金額かよ？って言われるとそりゃそのとおりなんだけど、絶対的な金額の範囲に収まっていればあとは周辺の治安とか住んでいて安心とか、そういうことを重視して引っ越すことにしたんだから、相対的な価値については目をつぶる。目をつぶるとなんだかこっちの方がトーランスよりよく見えてきた。アーバインの街を作って牛耳っているIrvine CompanyのWebサイトでアパートの写真や動画をやたら綺麗に作ってあるので、なおさらトーランスの物件たちがなんとなく暗くてみすぼらしく見えてしまったりして。\n\n## 弾丸内見ツアー\n\n8月中旬に現在のアパートの契約が満了となる。アパートを決めて、申し込んで、書類や小切手を準備して、もしかしたら却下されて、っていう一連の流れを想像すると、7月中旬には決定したい。NYC - LAX のフライトを調べて、6月末の週末に弾丸ツアーを敢行することにした。6月末なら入社して1ヶ月経っているし（関係ないけどなんとなく気分で）ということで金曜日を休みにして、木曜の夜のフライトでLAXへ飛び、金曜日と土曜日に内見をしまくって、土曜日の夜の便でNYCに帰る（日曜日の朝着）という日程を組んだ。内見はギリにならないと連絡しても意味がないので、1週間前になってから、8月にAvailableになると書いてあるアパートを中心に連絡を入れてみた。\n\n...入れてみた、んだが、Webで内見を予約できる1軒以外、レドンドビーチとハモサビーチの物件からは連絡が来なかった。飛ぶ前々日にそんな調子だったので、焦ってアーバインにあるWebで内見を予約できる5軒に急遽予約を入れ、結局ハモサビーチのアパート1軒とアーバインのアパート8軒を見ることになった。こう書いてみるとなんじゃそりゃって感じなんだが、この時点では2人ともアーバインの方がいいかなあと思い始めていたので、まあそういうことでいいか、もし空振りだったら帰ってからスターツに連絡しよう、ということにしていた。\n\n内見ツアー当日へ続く。","navs":{"nextPage":null,"prevPage":{"epoch":"1652673600","title":"転職した","slug":"/blog/job-change-20220516"}}},"__N_SSG":true}