{"pageProps":{"frontmatter":{"slug":"/blog/2020-01-11_--------------45d1865c8b3a","date":"Sat, 11 Jan 2020 22:49:20 GMT","title":"ニューヨークで仮免を取った","epoch":"1578782960","excerpt":"前回からの続き。仮免を取るための筆記テストを受けるために、12月30日の朝10:30のアポイントメントをDMVのWebサイトで取った。"},"markdownBody":"\n### ニューヨークで仮免を取った\n\n[前回からの続き](/blog/2019-12-29_-------------------e3f6436b0b67)。仮免を取るための筆記テストを受けるために、12月30日の朝10:30のアポイントメントをDMVのWebサイトで取った。\n\n### テスト勉強\n\n12月23日で仕事を納めて、後の一週間でDMVのサイトにある[Drivers manual and practice tests](https://dmv.ny.gov/driver-license/drivers-manual-practice-tests)をひたすらやり、答えをほぼ覚える。これ以外の準備は何もしなかった。他の人が書いているブログなどを読んでも、ほとんどこれと同じ問題が出ると書いてあるし。\n\n### 当日\n\n12月30日当日。10時10分にマンハッタンのダウンタウンのDMVオフィスへ到着。ここにした理由は、単に以前近くに住んでいて場所を知っているからというだけだった。中に入ると、アポイントメントのメールに付いていたQRコードを読み取る機械が2台設置されていたが、両方ともout of orderでそこに職員が立っている。その人に「筆記テストを受けにきた」と伝え、アポイントメントのメールを印刷した紙を見せると、「今10:10だからまだ時間じゃない」。\n\n「じゃあここで待ってればいいの？」\n「いや、んー」、横にいたもう一人に\n「この人、筆記テストのアポイントメントを持っているんだけど」\n「筆記テストにアポなんかない」\nは？DMVのWebで取ったアポなんだけど？\n\n結局その横にできていた30人くらいの列に並ばされた。最初はなんの行列かもわからなかったけど、並んでいるうちにこれは写真を撮るのを待つ列だと判明。まわってきた別の職員からピンクの紙を受け取って署名する。写真を撮っていいよという同意らしい。順番が近づくと、ブース内の別の職員から今日の目的を聞かれて「テスト受験」と答えると、Tで始まる番号札を渡された。\n\n順番がまわってきて写真を撮る。写真を撮ったら、番号が呼ばれるまで待機。待機エリアにはベンチが大学の教室くらいの数あったが、すでに満席。呼ばれている番号を眺めると、30番くらい後だった。まあ薄々想定してはいたけども、結局アポイントメントを取った意味はゼロだった。最初に「じゃあここで待ってればいいの？」って聞かずに時間まで待っていたとしたら、20分後に同じ行列に並ばされることになっていたはず。早速の洗礼である。\n\n写真を撮る場所のすぐ横にテストエリアがあって、PCが10台くらい置いてあって、それでテストを受ける（マウスで選択するだけ）のだが、常時1、2人しか受験しておらず、それでいて番号はちっとも進まない。まあそんなことだろうとは思っていたよ。スマホにダウンロードしておいたPDFでテスト内容をひたすら復習。\n\n90分くらい経過しただろうか、とうとう妻の番号（自分の番号の1つ前）が呼ばれたので、二人でブースへ向かう。\n\n### 用意すべき書類\n\nニューヨーク州でDMV発行のIDを取るには、1) 誕生日を証明する書類、2) アメリカに滞在する許可を持っていることを証明する書類、および 3) ニューヨーク州に住んでいることを証明する書類が必要で、1はパスポート、2はI-94、ビザ、グリーンカードやEAD、3はbank statementかutility billが定番なんだが、妻には3がない。DMVのサイトにはしかし、「Parent/Spouse ID (in the same last name or with proof of relationship) (if issued within 1 year)」という項目があって、夫たる僕がIDを出して、同姓の妻がパスポートと（グリーンカード取得作業中に無駄に取った）日本領事館発行の婚姻証明を提示すればよいはずだったので、一緒にブースにいった。\n\nところがDMVの職員は、「これじゃ彼女の証明にならない」。\n\n「DMVのサイトで妻が一緒に住んでいる同姓の人であることが証明になるって書いてあった」\n「彼女の居住証明がないとだめ。bank statementかutility billか」\n「いやWebサイトに書いてあった」\n「ここではダメ」\n\nしばらく粘ったが取りつく島はまったくなく、結局妻はテストを受けられなかった。お役所関連のことでWebに書いてある内容なんか信じてはいけない。\n\n妻は待合所へ戻り、僕はテストを受ける端末番号を知らされて、テストを受ける。15分くらい。テストを始めると、最初に誕生日や名前を確認する画面が出てくる。その後テストの練習として、画面に円が書かれていて選択肢として「Triangle」や「Rectangle」が並んでいる中から「Circle」を選ぶという問題が出てくるので、それに答えると、次に本番のテストが始まる。\n\n見たことのある問題がほとんどだったが見たことのない問題も4問くらいあった。テストは英語で受けた。証明書を出すときにどの言語で受けるか聞かれるのだが、妻が「Japanese」と言ったら「日本語なんてあったっけ？」という始末。日本人の方は、Lower ManhattanのDMVはやめた方がいいかもしれない。\n\n### テスト、視力検査、仮免発行\n\nテストは、2問間違えたが無事合格。画面に「pass」と出るので、テストを終えて、すぐ横にある20人ほど並んでいる行列にまた並ぶ。この行列の目的は、最終的な証明の確認、視力検査、およびお支払い。この行列もまた遅々として進まず、1時間くらい並んだ気がする。道理でテスト端末は空いているのにTの番号は全然呼ばれないわけだ。端末が空くたびに人を入れていたら、この行列も100人を超えてしまうだろう。\n\nようやく順番がまわってきて、もう一度パスポート、SSNカード、bank statementなどを見せる。視力検査はおなじみのランドルト環の表のようなもの、でもランドルト環ではなく大文字アルファベットが書いてある紙がブースの少し奥に天井からぶら下がっていて、それの上から4番目？くらいを読み上げる方式。問題なく見えた。その場で印刷した紙が渡され、それが写真付きのカードが届くまでのlearners permitとなる。これを使う予定はないけども。\n\nこうしてすべてが終わり、出口に向かったのは午後1時。3時間コースだった。この時点でオフィスへの入館規制がかかっていて、オフィスの外の歩道に列が伸びていた。うっかりアポを午後にとっていたりしたらとんでもない目にあったところだった。\n\n写真付きのカードは1月10日に無事に郵送されてきた。これで当初の目的の1つだった「財布に入れておけるIDが欲しい」という目的は達成。有効期限は5年後の誕生日まで。さて、実際の運転免許証を取りに行くかどうか。どうしようかなあ。\n\n### DMVに行く前にこれを読んでいる方のために\n\nDMVのWebサイトはあてにならないが、できる準備はなんでもしていこうという観点から、アポをとって確認メールは印刷していった方がいいと思う。アポは1日の初めの枠、8時とか9時とかにしておいて、その時間につくように行けば、たとえアポが無意味でも並ぶ時間は短くなるはず。ただしDMVオフィスによってはWalk inでの筆記テスト受験はできないとWebに書いてある場所もあるので、その場合アポは必須なんだと思う。Webは信用しないと言いつつ、自分に不利になりかねない情報は受け止めて対策しておく必要がある。\n\nSSNとパスポート、ビザやグリーンカードはあるとして、自分名義現住所のbank statementとutility billを印刷して持って行くこと。DMVのWebサイトに色々書いてある、この書類は何ポイントこれは何ポイント、そして全部で何ポイント必要、とかいう内容は信用しない。bank statementかutility bill。これしか聞かれなかった。他の書類はまったく取り合ってもらえないと思った方がいい。H4では働けないなどの理由でSSNもなく、奥様の居住を証明することが難しい場合、SSNなしでも作れる場所で銀行口座を作っておくとか、Utilityの契約時に奥様の名前にするとかしておくと何かと便利だと思う。\n\nあとは、半日無駄に過ごすつもりで、時間が無為に過ぎることを容認できるくらい心に余裕がある状態のときに行きましょう。DMVで3時間なら「早めに終わったね」くらいの感じです。6時間（うち5時間45分は何もしない時間）とかを許容するつもりで行きましょう。\n\n[5時間講習の受講](/blog/2021-06-13_five-hour-course-drivers-license-ny/)へ続く。\n\n","navs":{"nextPage":{"epoch":"1590268499","title":"Sonoff Basic R3でセキュアなスマートホームを構築する","slug":"/blog/2020-05-23_Sonoff-Basic-R3-------------------f5498b92027b"},"prevPage":{"epoch":"1577638764","title":"ニューヨーク市で仮免を取ろうと思った","slug":"/blog/2019-12-29_-------------------e3f6436b0b67"}}},"__N_SSG":true}