{"pageProps":{"frontmatter":{"slug":"/blog/moving-3-20220813","date":"Sat, 13 Aug 2022 22:16:05 GMT","title":"カリフォルニアの引っ越し先を決めた","epoch":"1660428964","excerpt":"カリフォルニアでどこに住むか決めました。"},"markdownBody":"\n[前回](/blog/moving-2-20220807)からの続き。\n\n## Hermosa Beach or Irvine\n\n起きてみたらまだ昼だった。この時点でだいぶ熱っぽく頭がガンガン痛かったのだが、気合いを入れてどのアパートに応募するか考えることにした。\n\nこの時点では、一番最初に見たHermosa Beachのアパートに気持ちが傾いていた。トーランスにもビーチにも近くて便利そうだけど街自体は小さくて静かな感じで雰囲気が良かった。Redondo Beachまで行けばシーフードレストランも豊富だし、行かなくてもHermosa Beachにも海沿いに店がちらほらある。アパート自体も小さな中庭にプールがあって、見た感じ住人もパリピって感じではなかったし。LAの中心にも近いし。\n\nふと思ってGoogle Mapsでアパートのレビューを見てみると、何件か「敷地内の駐車場で車上荒らしにあった」という星1つのレビューがある。またまたぁと思いながらも[Crime Map](https://spotcrime.com/)で見てみると確かに、2022年以降ですらすでに何件か報告がある。[Hermosa Beach PDの週間Crime Logs](https://www.hermosabeach.gov/our-government/police-department/weekly-crime-log)でもその報告は裏付けられた。マジかよ、そうは感じなかったけど結構そういう輩もうろついているのか。\n\nもう一度思い出そう。引っ越したい理由は、そういうことをなにも気にせずふらっと出歩くような生活をしたい、そのためなら便利とか文化とかはなくてもいい、そういうことだったはずだ。LAの中心に近いなんてことはむしろマイナス要素だ。\n\n同様にIrvineのアパート近辺もCrime Mapで見てみる。ゼロではないけど数と種類が全然違う。もちろん田舎だからだし、田舎なのにゼロじゃないならますます夜にふらっと出歩いたりできないじゃんとも思うが、Irvineのアパートは出歩かなくても敷地の中にあるカフェでビールも飲めるしだだっ広いので敷地の中で散歩するだけで相当疲れるのでそれで良いのだ。\n\n## アプリケーション（申し込み手続き）\n\n8月5日からの入居で良いという点とメモった家賃をもう一度確認するために、担当者に（日曜日だったので）メールを送ってみた。そしたらいかにも手元のiPhoneで急いで返事しましたみたいなメールが速攻で返ってきて、こちらのテンションも上がってしまい、申し込み手続きに入ってしまった。\n\nNYで行った2軒のアパートの申し込み時には、最初の月の家賃だセキュリティデポジットだというお金は銀行小切手（Cashiers Check）で用意させられ、雇用契約と給与の額を会社のCEOのサイン入りで要求され、さらにChracter Referenceのために会社の上司と友人の2人から推薦状を書いてもらって、ようやく審査に入り、2週間くらいしてやっとYesの返事が来るということだった。この友人からの推薦状というやつが、友人のいない身にはとても高いハードルだった。ああ誰に頼もうかなあと思いながら、推薦状以外で用意できるものをとりあえず用意しておいた。\n\nところが、このアパートの申し込み手続きはすべて、専用のWebサイトで完結した。まずは基本情報を入力してSSNを渡すと信用調査が入り、あっさり申し込みが受け付けられ、セキュリティデポジットも最小額でOKという結果が、なんとものの数分で返ってきた。なにこれ簡単。もちろんそれなりのスコアを持っていればこそだけれども、NYではクレジットスコアが780くらいある状態で応募しても推薦状だのなんだのを要求されたし、そもそもスコアを見られた形跡がなかった。それはそれでcomplianceのためなのかもしれないけども。\n\n入居に関する諸手続きもすべてWebサイトで、書類はDocuSignで署名する。セキュリティデポジット、初月の日割り家賃、Renters Insuranceなどのお金関係もすべてWebでクレジットカード払いで完了。カリフォルニア最高です（このアパートだけなんですかね？！）。\n\nというわけで5週間先に入居するアパートの契約手続きがオンラインであっという間に完了した。\n\n## カリフォルニアでやられた\n\n月曜日。妻と2人して朝から熱っぽくて喉が痛い。熱を測ると36度台後半。まだ大丈夫だったので仕事をする。喉が痛くて話ができないので、ミーティングでは自分だけ筆談。\n\n火曜日。前日寝る前にベンザブロックを飲んだら少し喉の痛みが引いたんだが、熱はさらに上がってひどくなったので米国政府からもらった抗原検査キットで検査してみたが、結果は陰性。うーんCOVID-19じゃないのか？しかし辛いので休みをもらって一日中寝る。\n\n水曜日。朝起きたらだいぶ戻ってきた感じだったので、ミーティングもないし、そのまま仕事。しかし夕方にはまただいぶ辛くなる。火曜日の夜にもう1回ベンザブロックを飲んだんだが、今回は喉の痛みが引かなかった。\n\n木曜日。さらにもう少し戻ってきた感じだったのでだましだまし仕事をする。\n\n金曜日。まあまあ治ったというか、病み上がり感満載な雰囲気になる。熱は下がったし、まあまあこんなもんか。\n\n検査キットの結果は陰性だったので、COVID-19ではなかったのかもしれないが、その後テレビなどでみるBA.1の典型的症状といわれているものに症状がそっくりだったので、やっぱりそうだったのかも。内見ツアーの間なのか飛行機内なのかわからないが、そこそこ辛かった。\n\nその後しばらく経つが、息切れだとかの後遺症はないように思う。\n\n[引越し業者選定]へ続く","navs":{"nextPage":null,"prevPage":{"epoch":"1659908051","title":"カリフォルニアで引っ越し先を探した","slug":"/blog/moving-2-20220807"}}},"__N_SSG":true}