{"pageProps":{"frontmatter":{"slug":"/blog/js-til-2021-09-03","date":"Fri, 03 Sep 2021 14:03:09 GMT","title":"Custom async iterator in JavaScript","epoch":"1630677789","excerpt":"Today I learned how to implement and use an custom async iterator in JavaScript."},"markdownBody":"\nYou can write an async iterator/generator of your own in JavaScript.\n\nThe motivation behind the idea was that\n\n1. I wanted to call AWS.Comprehend.batchDetectEntities and pass 309 items of texts in an array.\n1. When I did the first time, AWS returned \"Throttoling Exception\". It turned out that the current settings allow only 10 items per second and a \"batch\" call is considered as N calls (number of calls in a batch call) not a call for the quota.\n1. So I thought I would split the array of texts into pieces so each piece has 10 items in it, and call the API over and over with 2 seconds interval.\n\nIt would be something like this:\n\n```\nasync function getPiece(data) {\n    const piece = data.splice(0, Math.min(10, data.length))\n    await new Promise((resolve) => setTimeout(resolve, 2000));\n    return piece\n}\n\nconst data = [ ... ]\n(async () => {\n    const results = []\n    const cloned = [...data]\n    while (cloned.length > 0) {\n        const piece = await getPiece(cloned)\n        const result = await AwsApiCall(piece)\n        results.push(result)\n    }\n    console.log(results)\n})()\n```\n\nIt waits 2 seconds and then pulls out the first 10 items from inputs and calls AWS API with the set of 10 items, process the result and see if there are more inputs.\n\nIt works, but I felt itchy because the content of the inputs or `cloned` at a particular moment was ambiguous from the code. The `getPiece` function modifies the content of `cloned` which is not obvious from the main function, but the main function is relying on the fact that the content would eventually become empty.\n\nThere could be many ways to write cleaner code than this. For example, the number of times the loop in the main function should iterate can be pre-calculated in the main function, thus it's not necessary for the main function to rely on the `getPiece` function to manage the content of inputs.\n\nBut I found it easy to use a generator/iterator here. The similar code could be written like this if we use an async generator:\n\n```\nasync function* dataSplitter(data) {\n    const cloned = [...data]\n    while (cloned.length > 0) {\n        const piece = cloned.splice(0, Math.min(10, cloned.length))\n        await new Promise((resolve) => setTimeout(resolve, 2000));\n        yield piece\n    }\n}\n\nconst data = [ ... ]\n(async () => {\n    const results = []\n    for await (const piece of dataSplitter(data)) {\n        const result = await AwsApiCall(piece)\n        results.push(result)\n    }\n    console.log(results)\n})()\n```\n\nThe `dataSplitter` yields 10 items every 2 seconds until there are no more data, and the main function doesn't have to know how it manages the content of the data. All the main function has to do is to call the AWS API for each piece that the generator yields in the `for await of` loop which was also new to me.\n","navs":{"nextPage":{"epoch":"1635001192","title":"ニューヨークで運転免許を取得した","slug":"/blog/2021-10-21-dmv-road-test-astoria-heights-2"},"prevPage":{"epoch":"1630087252","title":"ニューヨークで運転免許取得のための路上試験を受けて落ちた","slug":"/blog/2021-08-27-dmv-road-test-astoria-heights-1"}}},"__N_SSG":true}