{"pageProps":{"frontmatter":{"slug":"/blog/20201122-bt-toggle","date":"Sun, 22 Nov 2020 16:43:23 GMT","title":"Android quick settings tile that [dis]connects a Bluetooth headset","epoch":"1606063403","excerpt":"I wrote a simple Android app in Kotlin for the first time in months for myself to get used to the current Kotlin development again"},"markdownBody":"\n## Motivation\nI stopped writing code for Android and for iOS sometime ago because my job doesn't need them at the moment. I started to feel wary of my not being able to write code for apps as well and as spontaneous as I used to be. I needed to write code in my spare time.\n\n## Contributing code to an open source project\nI think I first heard about [Signal](https://github.com/signalapp) a few years ago but it caught my attention again lately when I read a story or two about the situation in Hong Kong. I went to check it out and found it is being built open source and pull requests are being merged from time to time.\n\nSince then I am looking at its code regularly, both iOS and Android and submitted a handful of pull requests. Some of them are merged which felt good.\n\nBut it's not my code. I won't submit a pull request to Signal written in Kotlin because I am pretty sure that it doesn't help the project. If I think about my next job interview, I believe I should be able to write Android apps in Kotlin, smoothly. It requires a practice. So let's practice.\n\n## The three virtues of a good programmer\nI was looking for a topic to write code for; you know, [the three virtues of a good programmer](http://threevirtues.com/). I found one; I am using Sony WI-1000x Bluetooth headset every day and quite a few times I have been having to disconnect it from my phone to connect it to my laptop, and the other way around.\n\nThe problem is that in order to disconnect a headset from Android **without killing Bluetooth** (the Covid-19 app needs it being turned on), you have multiple steps to do. A few times a day. Annoying.\n\n![Disconnect a headset from an Android phone](/videos/disconnect-1.mp4)\n\n![Connect a headset to an Android phone](/videos/connect-1.mp4)\n\n## App requirements\n\nThese are the requirements that I had in mind while I was writing the app:\n\n* A quick settings tile that allows you to connect and to disconnect simply by tapping the quick settings icon\n* The app remembers the device to connect and to disconnect\n* You can select a device for the app to remember in a simple list UI\n* Don't turn off Bluetooth itself; connect/disconnect only the specific device\n\nAlso, these are the non-feature requirements, that are the reasons why I wanted to write code of the app:\n\n* Use Kotlin\n* Use Kotlin Coroutine for async operations\n* Use AndroidX ViewModel\n* May not use a DI framework but make the modules as friendly as possible to write automated tests\n* i.e. Avoid fat activity\n\n## Coding highlights\n\nI found a few interesting points while writing the app.\n\n### 1. Both A2DP and HEADSET had to be disconnected to disconnect the headset\n\nI am not sure if it is with WI-1000x or it is the way for all Bluetooth headphones, but I found that you can connect to the headset by calling `connect` method only to the HEADSET profile, but [you must call `disconnect` method both to HEADSET profile and to A2DP profile](https://github.com/fumiakiy/BTToggle/blob/4780b091fc754040e14e96bb3c34d7fecb48c80d/app/src/main/java/com/luckypines/android/bttoggle/AndroidBluetoothAdapter.kt#L94-L113) in order to disconnect the headphones from the phone.\n\nBecause the code to receive a profile object is done asynchronously, I ended up writing code like this ([more code here](https://github.com/fumiakiy/BTToggle/blob/4780b091fc754040e14e96bb3c34d7fecb48c80d/app/src/main/java/com/luckypines/android/bttoggle/AndroidBluetoothAdapter.kt#L19-L55)) below to wait for both profiles before moving on to allow the app to intereact with the headphone. I feel there must be a better way of writing this type of *wait all events to happen before moving on* kind of code like `Promise.all` in JavaScript but wasn't able to find it atm.\n\n```\nsuspend fun onReady() {\n    coroutineScope {\n      while (true) {\n        delay(1000L)\n        if (headsetProxy != null && a2dpProxy != null) break\n      }\n    }\n  }\n```\n\n### 2. You must release the profile objects before leaving\n\nAndroid Studio was kind enough to let me know that the profile objects are leaking when I implemented the [TileService](https://developer.android.com/reference/android/service/quicksettings/TileService) for the app. I was kind of wondering the necessity of doing it but it was not obvious when I was writing the [Activity](https://github.com/fumiakiy/BTToggle/blob/4780b091fc754040e14e96bb3c34d7fecb48c80d/app/src/main/java/com/luckypines/android/bttoggle/MainActivity.kt) for the app.\n\nBut surely you need to [clear profile objects](https://github.com/fumiakiy/BTToggle/blob/4780b091fc754040e14e96bb3c34d7fecb48c80d/app/src/main/java/com/luckypines/android/bttoggle/AndroidBluetoothAdapter.kt#L115-L118) before [you leave](https://github.com/fumiakiy/BTToggle/blob/4780b091fc754040e14e96bb3c34d7fecb48c80d/app/src/main/java/com/luckypines/android/bttoggle/MainTileService.kt#L21-L39).\n\n### 3. You cannot [dis]connect Bluetooth headphones by Android SDK\n\n!!! Surprise! I wasn't able to find a simple and easy way to connect or to disconnect the headphones in Android SDK. Well there may be one, but simple web searching and browsing SDK website did not show me a `connect` or `disconnect` method to do it.\n\nI figured that folks out there who wanted to do that were calling the [connect](https://android.googlesource.com/platform/frameworks/base.git/+/48695cb07352cb3033dc11bb828e1ca947dfc04d/core/java/android/bluetooth/BluetoothA2dp.java#279) method and the [disconnect](https://android.googlesource.com/platform/frameworks/base.git/+/48695cb07352cb3033dc11bb828e1ca947dfc04d/core/java/android/bluetooth/BluetoothA2dp.java#319) method that were marked as `@UnsupportedAppUsage` through reflection. It worked ok, and I have no intention to publish this app for anybody to use, so [I just settled with it](https://github.com/fumiakiy/BTToggle/blob/4780b091fc754040e14e96bb3c34d7fecb48c80d/app/src/main/java/com/luckypines/android/bttoggle/AndroidBluetoothAdapter.kt#L82-L92).\n\n```\nval connect = BluetoothHeadset::class.java.declaredMethods.findLast {\n  it.name.equals(\"connect\")\n}\nconnect?.setAccessible(true)\nconnect?.invoke(headsetProxy, device)\n```\n\n### 4. You cannot collect two StateFlows in a launch block\n\n`collect` method of `StateFlow` blocks? I was not able to run this code as intended:\n\n```\nselectedIndexJob = CoroutineScope(Dispatchers.Main).launch {\n  viewModel.selectedIndex.collect { index ->\n    if (index < 0) return@collect\n    listAdapter.notifyItemChanged(index)\n    sharedPreferencesAdapter.setLastSelectedAddress(viewModel.getDevice(index).address)\n  }\n  viewModel.previousIndex.collect { index ->\n    if (index < 0) return@collect\n    listAdapter.notifyItemChanged(index)\n  }\n}\n```\n\n... because the second `collect` (or the block of it) was never called even when the state was updated. I had to write like this:\n\n```\nselectedIndexJob = CoroutineScope(Dispatchers.Main).launch {\n  viewModel.selectedIndex.collect { index ->\n    if (index < 0) return@collect\n    listAdapter.notifyItemChanged(index)\n    sharedPreferencesAdapter.setLastSelectedAddress(viewModel.getDevice(index).address)\n  }\n}\npreviousIndexJob = CoroutineScope(Dispatchers.Main).launch {\n  viewModel.previousIndex.collect { index ->\n    if (index < 0) return@collect\n    listAdapter.notifyItemChanged(index)\n  }\n}\n```\n\n... that is fine, but had to struggle a little bit of why the second block was not executed.\n\n### 5. AndroidX ViewModel and constructor injection\n\n[`by viewModels()`](https://developer.android.com/topic/libraries/architecture/viewmodel) is an easy way to get a view model instance but it requires the view model to have a default constructor. [You have to create your own `ViewModelProvider.Factory`](https://github.com/fumiakiy/BTToggle/blob/4780b091fc754040e14e96bb3c34d7fecb48c80d/app/src/main/java/com/luckypines/android/bttoggle/MainViewModel.kt#L47-L55) that instantiates a new object if you want to do constructor injection.\n\n### 6. lifecycleScope.launchWhenStarted ???\n\nI wrote the app on Saturday, November 21 2020. I'm writing this part the following day, and one of my favorite news letters [**Android Dagashi** issued a new post](https://androiddagashi.github.io/issue/147-2020-11-22/). In it was [the link to the SDK document about Kotlin Flows](https://developer.android.com/kotlin/flow/stateflow-and-sharedflow), and I learned that there is this thing called `launchWhenStarted`. The description goes:\n\n> \"In the previous example that used launchWhenStarted to collect the flow, when the coroutine that triggers the flow collection suspends as the View goes to the background, the underlying producers remain active.\"\n\nOh, so with that you don't have to keep a `Job` object, launch it and cancel it because it's handled by the context? Huh. I was doing it manually but you probably don't need this code any more (and the code I wrote may be a wrong way to do it in the first place?). I'll update the code when I have bandwidth.\n\n## Conclusion\n\nWhat ended up being implemented is here: [BTToggle app in GitHub/fumiakiy](https://github.com/fumiakiy/BTToggle/)\n\nMy life is now a little bit easier with this app and I am satisfied.\n\n![Disconnect a headset from an Android phone](/videos/disconnect-2.mp4)\n\n![Connect a headset to an Android phone](/videos/connect-2.mp4)\n"},"__N_SSG":true}